[
      {
            "cls": {
                  "result": 1,
                  "result_proba": [
                        0.2518564541768997,
                        0.7481435458231003
                  ],
                  "domain": 0,
                  "domain_proba": [
                        0.9644771679463011,
                        0.03372513251627816,
                        2.4219484428309874e-10,
                        2.238935180398343e-05,
                        9.547870679009017e-06,
                        0.0017657620727431012
                  ],
                  "similar_articles": [
                        {
                              "text": "A common report by male recruits undergoing basic training is their inability to troop the morning colors, so to speak. Erections that came so easily before boot camp become few and far between. This surprising downturn of events is frequently attributed to the presence of saltpeter in the chow rather than to the powerful combination of anxiety to succeed, physical exhaustion, and a radical change of lifestyle. Barracks life also contributes to this suppression, with the knowledge of the close proximity of many others subconsciously working to inhibit that aspect of an individual’s expression. “I’m worried that I might not make it through the training,” “I’m dead tired,” “I don’t yet feel like this is my home,” and “There are all these other guys around” are weak-sounding admissions to give voice to, so it is comforting to instead be able to cling to the belief that the Army, in its all-knowing wisdom, must be slipping something into the food to cause what’s seen as a striking physiological betrayal in young men who haven’t previously experienced such a dry spell: Examples: It was certainly well-known that ‘they put bromide in the tea/coffee’ to reduce randiness, though such measures were hardly necessary in view of the strenuous regime we had to follow at the time. Such stories seem to have been prevalent everywhere and through the ages — ‘the myth of the doctored wine.’ It is reported that the sexual prowess of recruits always diminished, and who can be surprised at that? In France, the wine was doctored; in Poland it was the coffee. In South Africa, it was the food itself which contained a mysterious anaphrodisiac called ‘blue-stone’ — as it had allegedly been in the First World War. In Germany, iodine was put into the coffee, and soda into the meat. [Collected on the Internet, 2000] Potassium Nitrate! Saltpeter! The military used to put it in the eggs at breakfast so a certain “joint” wouldn’t get stiff when it wasn’t supposed to. We could spot it right off in the Army. It, the saltpeter, gave the eggs a greenish tint. This need to believe that an outside force is deliberately working to keep things down fuels the saltpeter myth. Such a construct works to reassure the woodless recruit that there’s nothing wrong with him — it’s all the sneaky doings of those in charge. The myth is every bit as empowering as it is reassuring; it says “We are such rampantly virile men that those in command fear us and what we might do if left unchecked.” It thus works to build pride in the unit by helping to establish an internalized reputation for being such wild men that the group as a whole has to be drugged into docility if its commanders are to have any hope of keeping it under control. Yet the truth is, there’s no additional levels of saltpeter hidden in Army chow. There’s also no proof potassium nitrate (saltpeter) has any effect on libido, plus or minus, so there would be nothing to be gained from such a doctoring of edibles. Yes, saltpeter has long rumored to be an anaphrodisiac, a substance that reduces sexual drive. But it’s all rumor and no fact. Saltpeter has a long history of medical use. It and other nitrates were employed by doctors during the 18th century to treat such varied problems as asthma, sore throats, and arthritis. Not that it was used wisely for these purposes, however — physicians were far less knowledgeable in those days, and potassium nitrate’s hazards were not then understood as well as they are now. Saltpeter can be toxic in large quantities. It can cause anemia, methemoglobinemia (a blood disorder), headache, stomach upset, dizziness, kidney damage, and can raise one’s blood pressure to a dangerous level. It is thus strongly recommended against, and no one in his right mind would dose himself or anyone else with it. Given that saltpeter doesn’t suppress sexual urges and is dangerous to use, the Army lacks any reason to administer it to those within its ranks. Yet those two facts will probably do little to dissuade those who are certain the coffee continues to taste funny.",
                              "label": 0,
                              "dataset": "pubhealth",
                              "distance": 0.5812259138192728
                        },
                        {
                              "text": "A year after first launching its fermentation method to reduce bitterness in coffee beans, one of the world’s biggest commodity markets, MycoTechnology, Inc is expanding into cocoa and will launch its process on Tuesday. The market is smaller, but the potential may be bigger with health-conscious consumers seeking lower-calorie foods amid mounting concerns about obesity and diabetes. “We use mushrooms that we train specifically to remove unwanted aspects of food and infuse it with the natural health benefits of the mushroom,” said Alan Hahn, chief executive of MycoTechnology, Inc, formed in 2013 in Denver, Colorado. “Particularly with chocolate, the bitterness is a big issue. We remove that bitterness and the need for sugar is reduced drastically.”  About half of the average milk chocolate bar is made of sugar, according to industry experts. Hahn said his MycoSmooth technology, invented by the company’s chief science officer Brooks J. Kelly, can cut the amount of sugar needed in the average chocolate bar by half, from 31 grams to about 15 grams. The company is in talks with “major chocolate players” in the United States, but Hahn declined to name them. From its Denver headquarters, the company will start processing its own beans as well as those on behalf of its customers and will license out the technology. The process will compete with other more widely used methods, including the “Dutching” process that was developed in the 1800s and modifies the bean’s taste with an alkalizing agent. MycoTechnology’s chemical-free process reduces the bitterness, rather than masking it, at minimal cost. It adds “pennies per lb” to the cost of cocoa, Hahn said. MycoTechnology’s chocolate plans may, however, not be as simple as they first appear. Cutting the sugar content may pose new hurdles for confectionery makers if they cut sugar use and replace it with higher cocoa or milk content. Both are more expensive than sugar. “If you wind up taking sugar out and raising the (cocoa) liquor content, you will raise the fat content of the bar, which will be higher calories,” said Ed Seguine, president of Seguine Cacao Cocoa & Chocolate Advisors in Hanover, Pennsylvania, with over 30 years’ experience in chocolate product research. “It doesn’t make economic sense because you’ve got to put something in its place,” Seguine said. After coffee and cocoa, MycoTechnology is looking at widening the use of its procedure to bulk agricultural markets like rice and other grains. In the process, MycoTechnology takes fermented beans, sterilizes them and then inoculates them with their unique strains of mushroom root systems that have been trained specifically to remove bitterness. The beans are then placed in a sealed bag and for the following seven to 21 days, the roots do their work. Mushrooms naturally feed on moisture, oxygen and sugars.",
                              "label": 1,
                              "dataset": "pubhealth",
                              "distance": 0.5812259138192728
                        },
                        {
                              "text": "From the first minute Ellen Shepherd - a kindergarten-to-5th-grade special education teacher - picketed Thursday morning, along with other school employees in Elkins, West Virginia, community members showed their support.  \"It was amazing,\" said Shepherd, who is also the president of the Randolph County Education Association. \"People were stopping to offer support, coffee, doughnuts, stuff all day long,\" she added.  \"Most importantly, those who weren't sure about was going on stopped and asked us, so we were able to explain why we are here, what we are doing, and what got us to this point.\"  After months of writing legislators, attending hearings, and holding educational pickets before and after school, the three teachers' unions representing educators across the US state of West Virginia announced a collective walkout for Thursday and Friday, forcing all public schools to close.  On Friday afternoon, the unions announced the strike will continue on Monday.  The teachers are demanding higher wages and better benefits as they struggle to afford rising healthcare costs.  On both Thursday and Friday, thousands sang and chanted at the state capitol building in Charleston, calling for an agreement before the end of the legislative session on March 10.  According to local media, teachers in the state set up food banks to ensure students who depend on school meals were fed during the strike.  Struggling to fill positions  While the American Federation of Teachers-West Virginia, West Virginia School Service Personnel Association, and West Virginia Education Association have historically competed for members and influence, they unified in the face of reduced healthcare coverage and doubling insurance premiums, copays and deductibles.  Cuts to benefits forced Mary Stiles, a high school teacher in Morgantown, to stop taking a medication that was no longer covered by the mandatory Public Employees Insurance Agency plan required for all government employees.  Critics in the government and local communities, Stiles said, \"are trying to make it look like we're being greedy, that we want this big raise\".  \"But, we want our medical insurance to be fully funded and we want good coverage,\" she told Al Jazeera, not just for educators, but for all public employees.  Organisers have said that salaries are so low, that many have had to take second jobs to support their families  As salaries and benefits have declined, so have teaching incentives, and the number of vacancies has risen to more than 700.  There are nearly 20,000 teachers employed by the state.  Shepherd told Al Jazeera: \"We cannot fill kindergarten positions, music positions … English, special ed, social studies: positions that were a given in the past.\"  West Virginia Governor Jim Justice signed legislation this week that gives teachers a two percent pay increase in July. It will be followed by a one percent increase over the next two years. The bill, however, reduces the increase that had been previously proposed.  West Virginia's public school employees are also concerned about legalising taxpayer-funded private school vouchers and increasing the number of charter schools, policies which have been at the core of US Education Secretary Betsy DeVos's policy platform.  'A risk worth taking'  Though teachers have not gone on strike since 1990, teachers' unions in West Virginia rank 13th in the United States, according to a 2012 study which found that they were formidable and thoroughly engaged state politics and in developing policies.  Viewed as the birthplace of the US labour movement, West Virginia has a long history of strong unions that organised workers such as coal miners, craftsmen, and nurses to collectively bargain for improved wages, working conditions, and healthcare.  However, it is illegal under West Virginia law for public employees to go on strike, and teachers risk fines or imprisonment by continuing the walkout.  At a meeting to discuss legal ramifications, Shepherd told Al Jazeera that the response of the 300 assembled educators was unanimous: \"Our kids are more important.\"  Shepherd added: \"So, yes, we face that risk, but that's a risk that's worth taking because our kids and their education is so valuable to us.\"  In a statement released on February 20, West Virginia Superintendent of Schools Steven Paine noted the illegality of work stoppages by public employees and encouraged \"educators to advocate for the benefits they deserve, but to seek courses of action that have the least possible disruption for our students\".  While educators hope that an agreement will be reached quickly, the unions are taking it day by day.  \"Let's call a spade a spade: It's a strike,\" said Josh Nelson, who has been teaching high school Spanish and English in Huntington for three years. \"We don't know when this will end.\"  Potential next steps for the unions include returning to work for a few days before resuming the stoppage, having rolling walkouts by county, or continuing the statewide strike until changes are made.  \"West Virginia teachers have been terribly, terribly slighted for a long time,\" said Cindy Stemple, a retired teacher and union member who worked for public schools in West Virginia for 35 years.  \"People are fed up with it, they've had enough,\" she added.",
                              "label": 0,
                              "dataset": "qprop",
                              "distance": 0.5812259138192728
                        },
                        {
                              "text": "Keywords: pet care , pet care tips \nHaving a pet or a companion animal is an amazing thing as the little bundle of joy loves you immensely without asking for much in return. But they do want your little time and attention. Pets are just like kids who need care and support from you, and if they don’t get these things, then they can become victims of infection, malnutrition, and diseases. Therefore, here we have listed some important pet care tips so that you can easily keep your pet happy and healthy. Train your pet \nBehavioral training is very important for dogs and cats especially when you have children at the house. Proper training can reduce their aggression and help them to accommodate easily in your home environment. If you are not well experienced with pet training, then you can take help of a professional trainer to train them like sitting on command or walking on a leash. Spaying and neutering \nIf you have many pets and you don’t want an increase in their numbers, then you can get them spayed or neutered by a vet. It also benefits your pet as it reduces the chances of your pet getting lost because the tendency to roam around will decrease after spaying and neutering. It also lowers the risk of certain cancers, hernias in male pets and uterine infection in females. Induce natural healing \nIncreasing immunity of your pet is very important, and you can do with a much safer approach. Animal oral nosodes provide a wide range of protection to your pet from various diseases like Corona virus, Lyme disease, West Nile virus. Tick fever etc. and they are very easy to administer as it can be given either by mouth. This natural alternative is safe and has many advantages over the conventional vaccines, many of which are found to be carcinogenic or having side effects. Body cleaning \nIt is important to get your pet habitual to bathing and other cleaning activities like clipping nails, flea or tick examination, etc. from an early age so it doesn’t get surprised when you give it a bath or try to cut its nails. They can even attack you in defense if they are not used to these activities. Keep them active \nWalking your dog early in the morning is good for him and you as well. It gives you time to bond and keeps both of you fit. Besides that, you must play with your pets regularly to keep them active. You can use a Frisbee or ball to play with your pets or tell them to chase you while you run. These activities benefit both of you mutually. Skincare \nThis is very important especially in the case of pets with a white coat or less pigmentation as they are prone to skin inflammation and skin cancers. Also, check your pet regularly for any external parasite like fleas as it can cause irritated skin, hair loss, hot spots, infection and introduction of other parasites like a tapeworm in your pet. After cleaning and check up, groom your pet by brushing their coat as it helps in reducing hair shedding by them. Watch their diet \nChildren tend to feed their pet anything even their favorite food without knowing that it can be harmful to them, therefore, inform your young ones about the right food for your pet. Food items containing alcohol, coffee, chocolate, poultry bones, salt or unripe fruit can be bad for your pets. You can also ask your vet about other food items which must not be given to your pet. Moreover, you also need to check the weight of your pet regularly as less physical activity and regular feeding can make them obese or overweight. Pet bedding \nProper rest is equally necessary for the overall well-being of your pet, and they need a corner for their own for that. You should pick a spot in your house which is warm, clean and quiet to make their bed. Their bedding should be cleaned on a regular basis to prevent any parasites like ticks and fleas. Provide a healthy environment \nYour pet can understand your mood as it is a living being like you, therefore, try to act happily around them. You must have seen that your cat is scratching the post or toys or your dog becomes restless when you come home. They do these things because they need mental stimulation. Give them toys to play, take them on a walk and play with them to reduce their restlessness and keep their boredom away. Pet identification \nThis prevents your pet from getting lost or taken away by the municipal persons by considering them as stray ones. Make them wear a collar with the address of your house so that it can be returned to you if it gets lost. These days, microchips are used to identify the pet. These microchips are of the size of a rice grain and placed under the skin of the pet within a second. It doesn’t require any battery and sensitive enough to be scanned and tracked easily by a vet or animal control officer. You might also like…",
                              "label": 1,
                              "dataset": "grafn",
                              "distance": 0.5812259138192728
                        },
                        {
                              "text": "Carmela Tyrell November 6, 2016 Surviving Off-grid: 5 Ways to Manage Chimney Creosote \nThe government is doing everything it can to deter people from burning wood , it still remains popular with home owners that don’t want to use oil or other more expensive fuels. Wood is also very popular with off gridders, preppers, and homesteaders because it can be harvested from natural resources or grown for this purpose. \nMany people that burn wood are plagued by creosote that builds up in chimneys. As dangerous as this problem can become, preventing or reducing creosote buildup is not as hard as it seems to be. \nHere are five ways you can reduce or prevent creosote buildup in your chimneys. \nDo not forget to inspect your chimneys on a regular basis and clean them even if the creosote only looks like it is in the early stages of buildup. \nHow Does Creosote Form? \nHave you ever blown on a mirror or piece of glass so that some of the water vapor from your lungs condenses on the glass? If so, then you may also know that condensation occurs because the glass is cooler than the air exiting your mouth. \nIn a similar way, when hot gas and smoke enter the chimney, they are hotter than the stove pipe. If the pipe is not hot enough, then creosote will condense out of the smoke and be deposited in the chimney. Video first seen on Corey Binford . \nThe Three Degrees of Creosote Buildup \nAs with many other situations in life, creosote build up may not be especially dangerous at first. However, if it is left unchecked, or not taken care of soon enough, it can become a very expensive problem. As you review the three degrees of creosote buildup, bear in mind that simply cleaning up the mess is only part of the problem. You will still need to take active steps to prevent or at least slow down further creosote buildup. \n1st Degree \nJust about every chimney will build up layers of soft black material known as soot. If you can easily brush the black layer of material out of the chimney, chances are there is actually very little creosote in it. \nMany people consider this a good sign because it means the fire is burning hot enough to reduce the amount of temperature difference between the smoke and the chimney. While this stage isn’t especially dangerous, you will still need to clean out the chimney on a routine basis in order to keep good air flow. \n2nd Degree \nAt this level, you will start to see more creosote in the soot. There will be quite a few shiny black flakes of material that can still be removed if you put some effort into it. If you see this kind of soot, it is very important to increase the air flow in the burning area. \n3rd Degree \nThis type of creosote buildup forms layers of a tar like coating on inner surfaces of the chimney. If you think about how cholesterol builds up in arteries, then you have a pretty good picture of what I mean. \n3 rd Degree creosote also contains a good bit of unburned fuel . As a result, when it does catch fire, it can be quite dangerous. The third degree of creosote buildup is caused by cool burning fires with inadequate ventilation, or by a flue that is too large. \nHere are five ways to resolve this type of buildup. You may need a combination of answers in order to reduce the level of creosote buildup as much as possible. \n1. Keep a Robust Airflow \nHave you ever lit a candle, and then put it in a glass cup? If so, then you have also probably seen soot build up on the sides of the glass. \nWhen a fire burns under any kind of restricted air flow, the soot from the fire will also concentrate and condense into smaller areas. Typically, fireplaces that have glass doors, or are otherwise closed off will have the most problems with airflow. \nHere’s what you can do to remedy this problem: Keep the ash bin and grate area as clean as possible. Open the damper so that more air gets into the fireplace. If you cannot get enough air moving in the fireplace, try using a fan or blower to push more air in through the damper. Make sure that the fan is made of metal or some other non-flammable material. Aside from purchasing a new model, you may also find some old, or vintage blowers at a flea market for a much lower price. Never underestimate the power or durability of these old, but incredibly durable blowers and fans! In some cases, downdrafts from the outside can also cause poor air circulation inside the stove. You can try adding a partial cover to the top of outer pipe. Alternatively, add an insert with an inward curve that will also reduce the amount of downdraft that can get down the chimney. \n2. Keep the Fire Hot \nEven though you may think of a piece of wood as a single object, it is actually made up of all kinds of molecules. This, in turn, means that some molecules will have a higher kindling point than others. \nIf the fire is not hot enough, some of the molecules that require a hotter temperature will escape into the chimney and form a layer of creosote if the conditions are right. Later on, if the temperature inside the chimney gets hot enough, these particles will catch fire and burn. \nThe hotter the fire is, the better chance there is of these molecules being reduced to heat and ash in the fireplace. In addition, the hotter the fire is, the hotter the chimney will be. When the chimney is hot enough, all the gunk that forms creosote cannot collect. \nHere are some ways to increase the heat output from a wood fire: add a few handfuls of coal to the wood fire. Coal burns at a higher temperature and will also last longer. Without a question, anyone that has used a coal fire on a freezing winter night can tell you just how delightful they are! install heat retaining bricks in the fireplace. This will increase the temperature inside the burn area and help keep the temperature steadier. insulate the chimney pipe with bricks. This is especially important if you are using a metal chimney, as they will always be cooler on the inner surface. The insulation will help, however it will not entirely solve the problem if it is caused by using a metal chimney. \n3. Check the Size of the Flue \nConsider a situation where you want to heat up a cup of coffee over a campfire. Chances are it will only take a few minutes to achieve this goal. Now let’s say you want to heat up a gallon of water over the exact same campfire. \nHeating up a gallon of water will take longer than a cup because there are more atoms to deal with. In a similar way, when the flue is too large, there is simply too much material for the fire to contend with. A wood stove should not have a flue larger than six inches. \nWhen you reduce the size of the flue, it allows less heat to escape. Some people have noticed a 20% or better increase in heat produced by fireplaces that have an optimally sized flue. Therefore, you will be reducing creosote problems and get more heat at the same time. \nDepending on the construction of the stove and chimney system, you may not be able to simply rip the whole thing out and start over again. Your best option will be to insert a sleeve into the chimney so that it has a smaller internal diameter. Even though these sleeves are usually made of metal, the surrounding brick in the chimney should keep it warm enough to reduce the risk of creosote build up. If you still get too much creosote, focus on increasing the heat produced by the fire and the amount of air flow going up into the chimney. Remember, the more air flow you have going up the chimney, the harder it will be for particles to stay still long enough to attach to inner surfaces. You may also want to let the wood season longer than a few months, and choose some type of wood other than pine. Look for wood that has less resin or sap in it. It is also very important to stay away from pellets or other types of pre-manufactured wood because they may be designed to burn at lower temperatures than what you will need to heat up an over sized chimney. \n4. Make Sure the Wood is Fully Seasoned and Dry \nHave you ever tried to start a fire during or after it rains? If you are camping, chances are you use a number of methods to dry the wood out as much as possible so that it produces more heat than smoke. \nIn a similar way, when wood is not fully seasoned and dried out, it will produce more creosote. Fires that produce a lot of smoke also have the following problems: there is less airflow, which reduces the amount of oxygen available to the fire the fire will burn cooler because water impedes combustion smoke is also a sign that more fuel is escaping into the air than you would get from a cleaner burning fire. \nThere is no substitute for time when it comes to seasoning wood. You can try keeping logs closer to the fire place for a few days before you actually burn them. Just remember to rotate them often so that the log dries out more evenly. \nChopping the log into smaller pieces might help too. This will increase surface area, which in turn will speed up water evaporation. You will still need to rotate the wood around to ensure the fastest possible drying. \nWhen it comes to seasoning wood , many people make the mistake of covering the wood with a waterproof, air tight tarp. The wood will release water vapor, however it will fall right back onto the wood and be absorbed all over again. \nYou will be better served by keeping the wood loosely covered and in a warm, sunny spot while it is drying. As with drying the wood out indoors, do not forget to rotate the woodpile every few days so that the pieces dry out as much and as evenly as possible. \nIf the weather is especially damp, humid, or rainy, it may be of some help to cut the wood into smaller pieces. No matter how you look at it, increasing surface area always speeds up evaporation. It may seem like a lot of extra work, however it will pay off when you have hotter fires   and fewer problems with creosote. \n5. Do Not Overload the Stove With Wood \nWhen you have had a long, hard day, it is tempting to load the stove with as much wood as possible so you won’t have to add more through the night. On the other side of the equation, when you put too much wood in the stove, it reduces air flow. \nAside from this, when fires burn, they also release some water vapor. When there is too much wood in the stove, some of that vapor may just land on the wood and increase its moisture level. No matter how well seasoned the wood is, that increased moisture will cause the fire to burn poorly. \nHere are some ways to resolve this problem: start off by adding just one piece at a time to the fire. If the fire burns well, try adding a second piece. Keep adding more pieces as long as the fire burns cleanly. Do not forget that you may not be able to add as many pieces at one time on rainy days or ones where it is impossible to prevent a downdraft from the chimney. install an automatic wood feeder. Even thought a wood feeder can take up a good bit of space, it may be a better solution than trying to manually feed the stove. Use coal and other materials that might burn longer during times when you won’t be available to feed the stove more wood. \nWherever you live in (an apartment or a house), chances are the building will have a chimney, and there will also be a stove available for burning wood . Getting started with wood burning is not especially difficult, but avoiding creosote buildup in the chimney can be challenge. \nBe careful about the condition of the fire, the wood, and ventilation issues that may lead to creosote buildup. Once you find a way to reduce the speed of creosote buildup, do not forget to inspect the chimney on a regular basis. \nA clean chimney is not just a safe one, it is a valuable asset that will help you burn wood efficiently and get the most from it. \n  Carmela Tyrell for Survivopedia. 464 total views, 463 views today",
                              "label": 1,
                              "dataset": "grafn",
                              "distance": 0.5812259138192728
                        },
                        {
                              "text": "DON'T MISS 'I've had to get comfortable with being naked': Braless Kate Moss talks nudity and fancying Johnny Depp... as she turns up the heat in W magazine shoot 'I have to learn to shrug it off': Lisa Riley was tormented by vile trolls who claimed she 'looks like a cancer victim' after shedding a whopping 11 STONE 'She's parading him around': Jeremy McConnell accuses Stephanie of living off baby son... but insists he WANTS to be the father as he breaks silence 'Rest with the galactic stars!' George Takei and Dirk Benedict lead tributes to Battlestar Galactica's Richard Hatch who has died from cancer at 71 Careful there! Kylie Jenner busts out of a bustier as she gives fans more than just a sneak peek of new collection from hers and sister Kendall's line The bisexual artist and the socialite who parties with DiCaprio - but can you guess which of Britain's Next Top Model's new hopefuls was born a BOY? Amanda Holden supports Simon Cowell's girlfriend Lauren Silverman after claims about the music mogul's sex life Gal pals 'He moved into her hotel... on purpose': Joshua Sasse's Galavant co-star claims actor 'set his sights on Kylie Minogue from the start' Pregnant Binky Felstead teases a glimpse of her thighs in a pink shirt dress... as she reveals she and JP are 'the happiest they've been in a long time' 'I was 12 when it all started': Poppy Delevingne reveals how she supported sisters Cara and Chloe through their mother's heroin addiction 'When it just ain't happening!' Jesy Nelson leaves Little Mix bandmates in hysterics as she drops the F-bomb mid-song on stage during US Tour Fifty Shades of sexy! Dakota Johnson sizzles in a backless glitter-encrusted gown as she attends the Berlin Film première with Jamie Dornan PICTURE EXCLUSIVE: Flaunting it! Hailey Baldwin shows off her toned figure in a colourful bikini as she splashes around in the water in Hawaii g on the island. Human Ken Doll Rodrigo Alves steps out in two-piece metallic blazer and VERY skinny jeans during night out in London... after denying he's addicted to surgery Mischa Barton looks in good spirits as she emerges make-up free in LA following shocking 'meltdown' Actress was hospitalised last week Newly-single Bianca Gascoigne puts on a leggy display as she hits the town after being DUMPED over the internet by her CBB lover Jamie O'Hara 'Get a life!': Sharon Osbourne SHAMES David Beckham over 'shallow' calls to get a knighthood in furious rant over his leaked email scandal Just like Kim! Kourtney Kardashian shows off her bare legs as she wears a hoodie as a dress when taking Mason out in LA Casual yet chic 'My Everything!': Stephanie Davis shares a super cute picture of her newborn Caben-Albi... as her ex Jeremy McConnell claims the baby looks like him Seeking frills! Braless Pamela Anderson teases her famous cleavage in nothing but high-waisted knickers and a sheer lace frock Pin-up perfection Rita Ora forgoes a bra in a very low-cut wrap dress and matching trousers as she slips into something 'fifty shades lighter' for third outfit change of day Charlotte Dawson flashes the flesh in a nude corset, TINY mini-skirt and white thigh-high boots as she hits Birmingham for a night out Blind Date set for 'young and sexy' reboot with Vicky Pattison tipped to step into Cilla Black's shoes Hot on the heels of First Dates and Take Me Out 'It would have been more respectful to hear it from him': Bianca Gascoigne claims Jamie O'Hara didn't TELL her that he 'wanted to split to focus on his family' Katy Perry asks 'why are we all so chained?' as she teases new song Chained To The Rhythm written by pop princess Sia New music More to love! Paris Hilton displays bigger chest in plunging dress during Vegas trip... even though she insists she's never had a boob job Taking the plunge She's Taken again! Action flick heroine Maggie Grace shares snap of herself with fiance Brent Bushnell after getting engaged No longer Liam's little girl 'She sends me videos of our cats': Ed Sheeran describes his 'chill' relationship with Cherry Seaborn and says 'everything is a lot easier' with her 'Heaven!': Jennifer Lopez posts sweet throwback photo of herself hugging her son Maximilian when he was just a baby Flashback 'Don't call ME ignorant!' Zayn Malik lashes out at trolls who call him a TERRORIST... after defending girlfriend Gigi Hadid in 'racism' row Adele brought in $80.5m in 2016 making her the highest-paid Grammy nominee with Beyonce and Justin Bieber trailing behind Forbes figures 'My little Poosh!' Kourtney Kardashian plants a tender kiss on her daughter Penelope in sweet Instagram snap as she enjoys some quality family time Downcast Victoria Beckham fails to crack a smile as she departs NYC hotel amid husband David's leaked email scandal Focusing on work Jemma Lucy shocks fans as she reveals lurid details about sex act she's performed with new girlfriend Chantelle Connelly Too much information Queen Letizia of Spain cuts a chic figure in simple black dress and elegant braided updo as she attends press event in Madrid Elegant The scarves! Catherine Zeta-Jones gives tour of her cavernous closet loaded with luxury items and designer wares Envy-inducing 'Because it's nearly Valentine's!': MIC's Frankie Gaff flaunts her enviably toned figure in red lace lingerie as she poses seductively on her bed Her little merman! Kim Kardashian shares heartwarming snaps of a sweet mother and son moment with baby Saint taken on exotic family holiday Braless Rita Ora comes dangerously close to a nip-slip in a backless top as she slips into a sexier second outfit of the day in NYC What a doll! Gigi Hadid is transformed into a Barbie doll for new Tommy Hilfiger capsule collection Life in plastic, it's fantastic 'He's eating like a little pig': Father of nine Mel Gibson, 61, says newborn son Lars is 'doing great' Welcomed son with Rosalind Ross, 26 Pascal Craymer puts on a very busty display in two equally eye-popping dresses as she party hops around London Centre of attention 'He had his hand in her lap!' Blac Chyna 'seen cosying up with a mystery man who was not her partner Rob Kardashian' Trouble in paradise? 'If I lived in Bristol, he'd be alive today': Anne Diamond reduces Stacey Solomon to tears on Loose Women as she discusses loss of baby Sebastian from SIDS 'She sounds like she's from Carlisle!' Viewers mock Sheridan Smith's attempt at a Yorkshire accent in BBC's Shannon Matthews drama Beyonce, 35, and Jay Z, 47, 'tried for YEARS' to expand their family and now that she is pregnant with twins they are 'very happy' Baby joy Chloe Lewis puts on a classy display in black jumpsuit as she attends fashion event in London amid rumours her ex Jake Hall has proposed to girlfriend Missé Beqiri Bottoms up! Jimmy Fallon flaunts his delightful derriere as Joe Jonas gives him underwear modelling lesson Brief encounter 'My son was getting a little chubby': Model Natalia Vodianova admits being 'military' about her five children's diets... as she discusses future marriage plans 'We're touring right until the due date': Elbow's Guy Garvey, 42, 'overjoyed' to be expecting his first child with Avengers actress Rachael Stirling, 39 Un-fur-gettable! EJ Johnson wears fuzzy jacket over see-through netted top as he hits LA airport with his favorite Chanel purse Fabulous Shake your pants! Ashley Graham sets pulses racing as she seductively wiggles her shapely curves in lacy blue lingerie from her range Golly Miss Holly, how did you make so much lolly! From bed linen to yoghurt and toothpaste, the money-spinning empire of TV's £11million blonde Britney Spears' eight-year-old niece Maddie is 'awake and talking' after tragic ATV accident two days ago Regained consciousness Queens, start your engines! Lady Gaga is set to guest judge season premiere of RuPaul's Drag Race after ace Super Bowl performance Never mind the rain! Nicky Hilton coos over baby daughter Lily as they're caught in a sudden downpour during New York City stroll Take shelter 'Look at who sneaked into this one!': Jimmy Kimmel is outraged that 'enemy' Matt Damon got to sit next to Emma Stone at Oscar lunch Jealous EXCLUSIVE 'He likes me in a tracksuit': Sam Faiers' boyfriend Paul advises her on fashion... as sister Billie says fiancé 'wouldn't dare' tell her what to wear Tallia Storm flashes her flat stomach in skimpy black bralet and denim skirt as she puts in a glamorous appearance at Centrepoint pub quiz Rosamund Pike oozes class in a billowing overcoat and futuristic silver top as she discusses new film A United Kingdom in New York Buxom Pamela Anderson writhes around in skimpy lace lingerie as she performs solo sex act for a VERY raunchy anti-Valentine's Day video Putting her best foot forward! Kylie Jenner flashes hint of toned torso in a pink crop top as she works up a sweat in Puma campaign Sporty Jack's back! Nicholson 'set to star in English language remake of Oscar nominated German film Toni Erdmann' Plays a practical joker 'Hopefully she turns a corner': Tom Brady says prognosis of mom's cancer battle is good... and hopes Super Bowl win provides 'healing energy' EXCLUSIVE PICTURES: Rihanna shows how to make everyone green with envy in a curve-hugging dress as she gets wiggy for colorful photo shoot I'm Joey's girl! Scantily clad Lauren Goodger flashes her well rounded derrière as she treats jailed beau Morrison to another selfie Treat for her man 'She paints her room purple': North West redecorates her bedroom in NAIL POLISH...before helping mother Kim Kardashian clean up 'What the f*** is going on?': Michael Bolton, 63, shows off his comedic side in new trailer for cheesy Big, Sexy Valentine's Day Special Netflix original Bye, bye Trump hair: Katy Perry dyes 'blorange' hair PLATINUM as it's announced she'll perform new music at Grammy Awards Judy Garland's ex-husband Sid Luft claims that Wizard of Oz munchkins molested the 16-year-old star and 'frequently put their hands up her skirt' 'Unfortunately it's come to an end': Jamie O'Hara 'splits from CBB lover Bianca Gascoigne to focus on family'... three days after show's final West Coast vs East Coast! Ashley Tisdale goes makeup free as she hits the gym in Yankees hat and Beverly Hills hoodie Low key Some kind of little monsters! Lady Gaga to duet with Metallica at The Grammys... after highly-praised Super Bowl halftime show Dynamic duet 'Baseless rumors': Nikki Reed posts cosy photo with husband Ian Somerhalder and his ex Nina Dobrev and BLASTS speculation of a feud 'I'm really scared': Pregnant Amy Childs reveals she's hoping for a water birth... as she admits she's having the 'weirdest lemon tart cravings' Just the two of us! Armie Hammer bonds with adorable daughter Harper on rainy outing after welcoming son to family Family fun Hitting the ground running! Cindy Crawford, 50, shows off her wrinkle-free and glowing complexion as she arrives in Australia Travelling in style That's the power of love! Celine Dion left flabbergasted as man proposes in front of her... and photobombs magic moment with funny facial expression Sad to leave? Selena Gomez flashes taut tummy in crop top as she arrives for solo flight looking downcast... just one day after 'cozy' date with The Weeknd Looking divine! Karolina Kurkova looks spellbinding in chic white dress with sexy thigh-high slit as she attends fundraising event Sheridan shines in a grubby tale of a mother's greed and betrayal: CHRISTOPHER STEVENS review's last night's TV Naomi Watts passionately kisses and caresses co-star Sophie Cookson while filming new Netflix series Gypsy Locking lips 'Time flies': Sky Sports presenter Natalie Pinkham shares funny before and after pregnancy snap as she celebrates baby Willow's eight months Jeremy McConnell parties with Marco Pierre White's ex during wild night out in Dublin... as he prepares to tell all about Stephanie Davis and baby on live TV 'Simon Cowell was just like Christian Grey in bed': Alicia Douvall reveals all about her sizzling six month affair with 'sensitive but domineering' TV star Kim Kardashian's huge diamond engagement ring disappears from her video game to reflect her real life after Paris robbery Lady Gaga sees her music sales rocket 1,000% after amazing halftime Super Bowl show Stunning halftime show boosted sales Hidden Figures edges out La La Land to become highest-grossing best picture nominee at the 2017 Academy Awards $120m so far Tie me up! Blonde bombshell Charlotte McKinney sizzles in plunge neck crisscross top on promo tour of New York Casual look 'It was the most terrifying thing': The Apprentice UK star Dillon St Paul is in recovery after undergoing emergency surgery on brain tumour Fifty Shades of sweat! Cheerleader-turned-trainer who whipped Dakota Johnson and Jamie Dornan into shape for their sex scenes tells all Headed to TV: Nicole Kidman buys television rights for bestselling novel The Expatriates and could star in the series New project 'Serves you right for appropriating': Instagram users point out perplexed faces behind Alyssa Milano as she shows off cornrows at Super Bowl Strictly? Archers? Dr Who? No, this gem is the best thing on the BBC: DOMINIC SANDBROOK on why he's a fan of In Our Time as show marks 750th edition Take a Luke at what he's missing! Scarlett Moffatt shows off her slender frame in busty Instagram shot... days after confirming split from long-term love Give Me Love! Female fans breakdown in tears as Ed Sheeran takes selfies with them and causes pandemonium during appearance on Sunrise Dwayne 'The Rock' Johnson to star in wrestling movie Fighting With My Family based on true story of WWE standout Paige Inspired by documentary If the shoe fits! Brooklyn Beckham shows off his skater style in mismatched footwear as he steps out amid dad David's email hacking scandal 'I grew up not loving how I looked': Christie Brinkley's daughters Sailor and Alexa plead for women to accept their bodies after starring in SI Pregnant Alex Gerrard conceals her baby bump in a plaid shirt and chic leather jacket as she treats herself to a pamper day in Liverpool 'You need to be single!': Kelly Ripa and husband Mark Consuelos roast Bachelor star Nick Viall during his Live! appearance Maxima cuts the mustard: Dutch Queen rocks yellow jumpsuit as she joins King Willem-Alexander at Wartburg castle on day one of their German tour Lauren Pope pulls her very best Baywatch pose in tiny red swimsuit as her sensational figure detracts from the blissful Dubai skyline Towie star Cara Kilbey's boyfriend 'was ringleader of multi-million pound drug gang that posed as trainee cabbies while selling cocaine and heroin' 'In five weeks, I've lost 10lb': Chloe Madeley flaunts her rippling muscles in tiny crop top and thong as she posts yet ANOTHER revealing selfie 'They're devaluing the victim': Mackenzie Phillips says exposing incestuous affair with her father ruined her family relationships Discussing abuse He's got a Passenger! Chris Pratt keeps walking as son Jack clings to his leg during fun family outing in Atlanta Cute as can be Her love don't cost a thing! Victoria's Secret Angel Taylor Hill reveals her ideal Valentine's date is a trip to the movies and a $1 slice of PIZZA Amanda Holden flaunts her slender figure in pink leotard as she reveals her beauty transformation for new stage show on Instagram Undercover lady! Jessica Biel wears sunglasses during rainy outing with son... after husband Justin Timberlake makes a splash at Oscar lunch PICTURE EXCLUSIVE: Whole lot slimmer again! Kerry Katona flaunts her fab new figure in nautical bikini as she heads Down Under on tour with Atomic Kitten Tom Brady reveals Gisele Bundchen asked him to retire THREE TIMES the night of Super Bowl win... but quarterback is 'having too much fun' Coleen Rooney reveals pictures of her late sister Rosie were stolen days after the family marked what would have been her 19th birthday 'Trust me... she likes Asians': Half-Pakistani singer Zayn Malik defends girlfriend Gigi Hadid after 'racist' claims following Buddha impersonation Clean sleeping - the latest preachy trend: Gwyneth Paltrow's 'wellness gurus' give their precious advice on how to snooze 'healthily' Hats off! Hilary Duff hits the gym in a casual grey beanie and leggings after returning from girls getaway to Mexico Low-key One for Clarence House? Camilla admires a quirky Salvador Dali sofa as she visits an exhibition celebrating the modern artistic heritage of Sussex Country singer Willie Nelson, 83, cancels three California shows because of illness... but says he will be back on stage next week Health woes Where's mama Mila? Doting dad Ashton Kutcher carries baby boy Dimitri in car seat as he leaves brunch in Los Angeles Daddy duties 'I did it! I'm on the show!': Matt Damon dresses as Tom Brady to get on Jimmy Kimmel Live as he continues running gag Channeled the champ It's on again! Scottie Pippen and Larsa reunite after explosive split... and she has HUGE new diamond ring Back together and she has the bling to prove it Ex On The Beach's Nicole Bass flaunts her incredibly pert posterior in daring olive green bikini in sizzling belfie Saucy Instagram 'Everything goes to my butt': Nina Agdal reveals where she gains weight the most as she poses topless for Health magazine DiCaprio's girl Beaming beauty! Eva Longoria, 41, looks youthful in plaid and lace dress as she talks 'trailblazing women' at Makers Conference in California 'I cried!': Newly-single Scarlett Moffatt recalls the mortifying moment she met Mary Berry whilst wearing her slippers Danielle Lloyd steps out for a pampering session... as it's revealed her ex-Jamie O'Hara has 'split from Bianca Gascoigne to focus on family' James Corden channels his inner playboy in a lavish robe and slippers for magazine shoot as he dismisses Stephen Colbert rumours Military chic! Ruby Rose stuns in red cape coat and frilly designer heels in Marie Claire Mexico but keeps her edgy style for the cover Cover girl 'Brave girl': Katie Price's daughter Princess is hospitalised as she has the pins removed from her broken arm On the mend 'You messed with the wrong b****es!': Amy Schumer points gun as she and Goldie Hawn try to escape their captors in new Snatched trailer Comedy duo How the hopefuls from Katie Price's failed talent show, from Rylan Clark-Neal to Amy Willerton, went on to carve out their own showbiz careers Kim Woodburn is targeted by Twitter hackers as fake profile responds to Phillip Schofield 'phony' row Kim has been the victim of Twitter hackers 'Tonight was a disaster': Chelsea Handler appears worse for wear as she shares Snapchat of herself on the toilet in India Filming Netflix show 'It's not loaded!': Kim Zolciak hits back at critics that slammed her for letting her son, aged four, hold husband Kroy Biermann's gun Set the record straight Taking a stand! Lena Dunham calls out President Trump's treatment of women in new Vogue video as she claims she has NEVER worn a bra in her life Lena Dunham shares details of her 'Trump Diet' of 'veggie dogs and baby food' after revealing she lost weight because she was 'too upset to eat' Did YOU spot them? Eagle-eyed fan highlights details in Lady Gaga's Super Bowl outfit that he believes serve as signs of support for LGBT community 'I'm an emotional wreck, always ready to blow': Braless Nicola McLean bares all in JUST a slashed jumper... as she admits to having 'a lot of issues' Janet Street-Porter reveals moment she was caught having affair by her husband... yet missed the chance of forgiveness after losing track of time SPOILERS: Gina Rodriguez and fellow Jane The Virgin cast members react to shock twist on Monday night's episode New twist She's back! Vanessa Hudgens talks returning to Coachella and wonders how pregnant Beyonce will perform Promoted her new comedy series Getting her kicks! Bella Hadid ditches her pants as she poses up with designer Riccardo Tisci to show off his new Nike creations EXCLUSIVE: 'It's getting bigger every day': Human Ken Doll in despair after giant cyst appears behind his ear as a result of 50th cosmetic procedure My Faiers ladies! Sam looks stylish in a bronze ensemble as she teams up with pregnant sister Billie for launch of their new beauty range Expanding her empire Jennifer Connelly cast as villain in James Cameron's Alita: Battle Angel based on Manga comic Joins all-star cast including Waltz Jerry O'Connell shows off his buff 'army' bod on lunch date with fresh faced wife Rebecca Romijn as he enjoys some much needed family time Iskra Lawrence swaps her underwear for outerwear as she proudly displays her curves at lingerie bash in NYC Brit looked sensational 'Tell David it's time we see what he is': Twitter mob turns on Victoria Beckham as she ignores David's email scandal... but pushes her own brand Quite the catch! Katie Salmon struggles to contain her assets as she bares masses of sideboob from beneath monokini on Spanish beach Yoko Ono, 83, is spotted arriving in New York City in a wheelchair just weeks after joining women's rights march Solo arrival Pammy's back! Pamela Anderson makes a SIXTH visit to 'lover' Julian Assange as she brings vegan cheeseburgers to the Ecuadorian Embassy Lena Dunham gushes about intern Malia Obama and reveals the first daughter was kept off set for graphic sex scenes when she worked on Girls 'I'm not pretty and I don't have hair': Bankrupt Gail Porter blames alopecia for TV work struggles as she admits she has 'no income' Pregnant Binky Felstead reveals baby news has strengthened her relationship with JP... as ex Alex Mytton jokes that HE is the father Fifty Shades' Jamie Dornan agrees to wear neon mankini following Dakota Johnson bet... as saucy Phil Schofield jokes about strapping wife to the ceiling EXCLUSIVE: 'She greeted me wearing a tight tee with cherries on the front' Anna Nicole Smith's trainer/lover breaks silence on 10th anniversary of her death Meet Ed's A Team! Sheeran fans camp out for 20 hours in torrential rain to get a glimpse the UK pop star's Sunrise performance Tina Malone slips her tiny size six frame into a series of wedding dresses as she prepares to renew her vows Pulling out all the stops Ageless Christie Brinkley, 63, poses with daughters Sailor and Alexa for steamy Sports Illustrated Swimsuit Issue... 38 years after first covering the mag Royally pleased to be heading home! The Queen looks cheerful in green as she returns to London following her extended festive break in Sandringham Malawi court allows Madonna to adopt twin girls... days after the singer DENIED she wanted to adopt the four-year-old sisters 'It really f***ing spiralled out of control': Rufus Hound QUIT Celebrity Juice following explosive row with CBB's Kim Woodburn Fiery character Radio 4 presenter Steve Hewlett marries his partner in hospital after being told he has 'just weeks to live' in cancer battle Diagnosed last year Feed My Girl! Gigi Hadid brands beau Zayn Malik's mother's house her 'favourite restaurant in the world'... as she teaches herself to cook Yorkshire pudding Michael Bublé's actress wife Luisana Lopilato 'returning to work'... following news that son Noah, 3, is 'progressing well' during treatment for cancer Youthful Jane Seymour drapes a stylish shawl over her shoulders as she puts in an appearance at star-studded Running Wild premiere They've still got it! Rock legends Guns N' Roses send 40,000 fans into a frenzy as they kick of big Australia tour Eager fans turned out to see the band Got a plan Bey? Coachella organisers 'yet to receive contact from Beyonce following shock twin pregnancy announcement' Will she or won't she? 'You are a bit of a d**k head!' Mel B takes a playful dig at husband Stephen Belafonte in candid social media post as couple celebrate their 10th anniversary 'I'm grateful for my life': Danniella Westbrook looks at peace in Marbella... as she admits to feeling 'amazingly blessed' after relapse sorrows 'I'm bored of telling the story': Twiggy sighs when Susanna Reid asks how she was discovered... but defends presenter over 'frumpy' outfit Determined Vicky Pattison goes super low-key in exercise gear following workout... after sharing constant bikini weight-loss progress snaps 7 questions that need answering after the dramatic finale of Apple Tree Yard, by Jim Shelley Monday saw the four part drama come to a close Lauren Goodger flaunts her hourglass curves in a figure-hugging black jumpsuit... after defending her jailbird beau Joey Morrison and his family Two of a kind! Kellie Maloney shows off a photo of her stunning daughter Sophie just days after sharing her own selfie - and the similarities are striking Princess Eugenie's trendy Pinterest board: Royal's account reveals her love of hipster hangouts and has she hinted where she would like to get MARRIED? MORE DON'T MISS Now THAT's a statement necklace Single Kourtney hits the town after ex Scott's poolside gallivanting... and makes sure he knows where he stands He's still The Boss! Bruce Springsteen, 67, wows 18,000 strong crowd with his hit songs at Sydney stadium concert 'I haven't given myself time': Rio Ferdinand talks about being a single dad after wife's death... amid claims he's 'moved on with TOWIE star Kate Wright' Having a laugh of a time! Eddie Murphy's girlfriend Paige Butcher is all smiles during morning coffee run in LA Looking cheery Britney's niece, 8, 'should not have been in ATV as minimum age to ride is 10' as it's revealed manufacturer 'has faced lawsuits for previous accidents' Chic Charlotte McKinney wraps up in an elegant statement coat... but STILL manages to show off her famous cleavage in plunging top Poppy Delevingne oozes glamour in a sequinned black gown at LA fashion show... following her wild night out with David Beckham He's got Company! Justin Bieber and former rumoured love interest Rita Ora tease a collaboration as they perform together in Snapchat clip They're on the piste again! Geordie Shore's Chloe Ferry takes a tumble on the slopes as she joins co-stars Marnie and Sophie for filming in Tignes Chantelle Houghton ditches the glamour for a more natural look as she steps out in low key leather jacket and tight green dress 'He's plummier than the royals!' Twitter goes wild for Geordie Robson Green's posh new accent as he reveals plans to reunite with Jerome Flynn The heiress and the princess: Tamara Ecclestone's daughter Sophia sports sweet Cinderella dress as she's swung in the air by her adoring parents 'It's easy and comes in lots of flavours': First Dates Hotel's Christian virgin Jordan drives Twitter wild as he compares premarital sex to soup 'It makes me feel magical': FKA Twigs showcases her incredible flexibility in thigh-skimming grey shorts while sharing her 'pole fitness journey' As Beyonce announces her twin pregnancy, experts reveal why so many stars have multiple births (and how it sets a dangerous example) Stars come out for Ed Sheeran as celebrities flock to 'secret' concert and share their joy at seeing musician at the Opera House Jorgie Porter beams while filming Celebs Go Dating with hunky sales exec... after revealing she makes suitors wait SEVEN dates before taking them to bed 'What a wonderful mum you are!' Katie Price's fans shower her with praise as she spends all night awake with disabled son Harvey in hospital 'Early night!' Michelle Heaton brushes off THAT bender by sharing a bevy of wholesome snaps... as she swaps cocktails for juice after boozy vomit incident Kian Egan shows off well-honed surfing skills before packing on PDA with make-up free wife Jodi Albert on sun-drenched Barbados break Emmerdale actress Amy Walsh announces engagement to boyfriend Bradley Jaden... five years after her popstar sister Kimberley set them up Steam team: Leggy Daisy Lowe and Louise Redknapp slip into matching black swimsuits as they sizzle at the spa with Strictly tour crew EXCLUSIVE: 'I've been craving everything naughty': Binky Felstead reveals pregnancy is going 'well' and she's had NO morning sickness 'Have you seen the size of her tips?' Twitter goes wild after viewers mishear love rat Peter Barlow on Coronation Street Say cheese! This year's Oscar nominees pose together for class photo after gathering for annual luncheon celebrating their achievements Luke who? Newly-single Scarlett Moffatt enjoys a dinner date with showbiz pals Ant and Dec days after confirming split from long-term love Sweethearts Gigi Hadid and Zayn Malik share candid snap as they cuddle in bed together Looked like any other couple in the sweet pic 'I don't know if I'll be back next week': Sir Bradley Wiggins may be forced to quit The Jump after tearing his calf muscle during his first race Blooming lovely! Pregnant Natalie Portman shows off her blossoming baby bump in chic black dress as she attends Oscar Nominees luncheon Charlotte McKinney shares a hug with comedian pal Jeff Ross as they join a host of stars cheering on the LA Lakers at basketball game Jessica Chastain cuddles up to hunky boyfriend Gian Luca Passi de Preposulo as they sit courtside at a basketball game Avid Knicks fan PICTURE EXCLUSIVE: Gaga swaps zany costumes for bra-free tee as she jets out of Houston after scoring second most watched Super Bowl show ever Apple Tree Yard viewers are outraged as Yvonne is brought to tears by lawyers over her brutal sex assault - before jury delivers its verdict in murder trial Nothing's going to rain-bow on her parade! Victoria Beckham refuses to hide in the shadows as she uses storm against husband to flaunt her fashion line From a hippy henna artist to a transgender beauty queen: The hopefuls vying to be crowned Britain's Next Top Model 2017 'I didn't even weigh this much when I had Madison': TOWIE star Chloe Sims says she's lacking body confidence as she's 'bigger now than she's ever been' 'I'm just trying to get sex on a regular basis': Former Pussycat Doll Melody Thornton reveals her racy reason behind joining Celebs Go Dating Looks of an angel! Heidi Klum shows off her incredible physique in photoshoot for own lingerie label One of the world's most beautiful women Britney Spears asks for 'prayers' for niece Maddie who got trapped for several minutes underwater despite Jamie Lynn's desperate attempts to free her Zoe Ball sports a broad smile as she joins new boyfriend Billy Yates for cosy pub lunch in London Split with Norman Cook in September 'A packet of honey roast ham has more depth than her!': Corrie viewers mock Rosie Webster's return as Twitter sparks debate over Helen's Flanagan's acting A manipulative mum, her brutish lover and a jury that got it right: CHRISTOPHER STEVENS reviews last night's TV 'She was being a big f***ing diva!' Kate Upton's 'extravagant demands may have cost her a Sports Illustrated cover this year' Girls night! Kim Kardashian rocks all black outfit and beige trench coat as she takes Kourtney to dinner in LA Looking chic Kiss, kiss! Helen Mirren plants a smacker on Morgan Freeman as she presents her Red co-star with Career Achievement Award Natalie Portman, Michelle Williams Emma Stone and Nicole Kidman lead the pack as Oscars nominees gather for annual luncheon PICTURED: Nicolas Cage's son Weston, 26, arrested for DUI after crashing car into tree following police chase Naomie Harris is picture perfect in beige dress at Nominees' Night ahead of the Academy Awards Stunned in a frilly and pleated number 'Our sex life is so hot': Tracy Morgan opens up about his recovery and role playing in the bedroom as he tries for baby number two Got his groove back Yummy mummy! Sharon Stone showcases her feminine form in semi-sheer bandage dress at Movies For Grownups Awards show Debra Messing has a fangirl moment as she snaps a selfie with Oscar winner Octavia Spencer at Makers conference Her little helper! Makeup-free Jennifer Garner gets a hand from son Samuel while fetching groceries in LA Busy mum of three enjoys time with her boy Red-y to go! Bella Thorne models bright leather motorcycle jacket as she strolls in Santa Monica with a female friend 'She is hot right?' Scheana Marie admits kissing Vanderpump Rules co-star Ariana Madix on Bravo's WWHL Wild night out in Las Vegas. 'I might fancy you': Lisa Vanderpump swoons over Tom Sandoval cross-dressing in pink on Vanderpump Rules 'She's Dreamy!' Blac Chyna posts cute video of her adorable little girl with Rob Kardashian laughing on Snapchat Proud mum of two got snap happy on Monday Going hell for leather! Amber Rose rocks chic motorcycle jacket while chilling with boyfriend Val Chmerkovskiy and a pal 'People will never understand': Lauren Goodger shows off her lighter locks as she slams those criticising her relationship with jailbird Joey Morrison CBB star Heidi Montag looks buxom in a white and pink bikini as in her London hotel... while husband Spencer Pratt jokes about returning to LA 20lbs heavier Kristen Stewart takes 'girlfriend' Stella Maxwell on a shopping spree in New York You can't buy love. But you certainly can treat your loved one Just popping out! Amanda Seyfried displays pregnancy bump in hooded top as she walks the dog with fiance Thomas Sadoski Revealed: How Lady Gaga faked her jump from stadium roof and tricked TV audience into thinking she plummeted 260ft for Super Bowl show Ruth Negga stuns in heart patterned gown as she accepts best picture award for Loving at AARP Movies for Grownups event The Help reunion! Emma Stone poses with castmates from 2011 film Viola Davis and Octavia Spencer at Oscars luncheon . Heidi Klum looks gorgeous in a puffy winter jacket as she touches down in LA Looked like she had just got off the runway Sparkling in silver! Lion star Nicole Kidman stuns in metallic belted Chanel dress as she steps out for the Oscar Nominees Luncheon She's going to Roar! Katy Perry confirms she'll perform at Grammys... joining Adele and Beyonce for music's biggest night Wardrobe change! Rihanna wears huge camouflage jacket then changes into bizarre red coat as she heads to music video shoot in NYC Eva Longoria and Olivia Culpo go braless beneath their Rachel Zoe pantsuits at FW/17 presentation Suited up at Sunset Tower Hotel Flapper girl! Nicole Richie showcases model thin figure in silver tasseled dress as she supports pal Rachel Zoe at fashion show She's a big teaser! Fergie flaunts flamboyantly floppy fringe as she turns heads in all-leather outfit at airport Making a statement 'I feel terrified': Nick Viall worries about finding love on The Bachelor after sending six more women home Veteran tearfully said goodbye to three women Elisabeth Moss sports painful-looking forehead gash on the Toronto set of The Handmaid's Tale Likely all for the cameras as she filmed 'The Game' who infamously claimed he slept with all three Kardashian sisters, is sentenced to three years probation for threatening to kill an off-duty LAPD officer Real Housewives star Joe Giudice lands job in prison gym earning $100 a month while serving 41-month sentence on fraud charges 'We are not missing out': Jinger Duggar and Jeremy Vuolo enjoy pre-wedding parties on Counting On Joint bachelor and bachelorette weekend 'Coldplay wanted lobster and didn't even eat it!' Sunrise name the artists with the most OUTRAGEOUS concert riders... as Ed Sheeran asks for just soft drink, honey and fruit Perrie Edwards vamps up in a racy black corset for smouldering snap... after confirming relationship with Alex Oxlade Chamberlain with romantic kiss photo 'I'm an old-school guy who doesn't want my private life out there': Vin Diesel wants to maintain 'a sense of mystery' with 100 million Facebook fans PICTURE EXCLUSIVE: Michelle Heaton's drinking session during New Zealand tour ends in tears as she VOMITS on the street... while bandmates watch From boardroom to Baywatch? Apprentice star Jessica Cunningham flaunts her pert behind in VERY high-cut red swimsuit after CBB stint 'I'm looking to keep my skin as young as it can be': As Nicole Kidman opens up on her beauty routine, FEMAIL revisits the star's most memorable looks Balancing act! Kim Kardashian works out with Kourtney... as she details book club with Chrissy Teigen and plugs her products on social media SPOILER ALERT: Ex On The Beach's Zaralena and Zahida come to blows over Aaron... as a cheating ex arrives to shake things up in the villa Bronzed bombshell! Justin Bieber's 'former fling' Sahara Ray flashes underboob and flat tummy in a VERY skimpy top and matching hot pants 'You're a PHONEY!' Kim Woodburn threatens to 'crucify biased' Phillip Schofield and brands her CBB housemates 'nasty pigs' in heated interview Rochelle Humes leads the way with fellow mum-to-be Amy Childs and glam Ola Jordan as the official National Television Awards portraits are unveiled Gigi Hadid comes under fire on Instagram after her sister Bella posted a candid clip of the model squinting her eyes to imitate the Buddha David Beckham puts on a brave face as he resurfaces in sportswear to pick up shakes in London following his leaked email shame 'I've lost 65lbs!' Southern Charm's Jennifer Snowden shows off dramatic weight loss four months after birth of her son Ascher 'Some people think I'm mad': Kris Marshall reveals the reason why he's leaving Death In Paradise as he admits friends urged him not to 'quit a hit' 'He can afford the hit': Tom Hardy's 'firm loses £2million in 12 months... as the actor's finances take another hit after his BBC series Taboo fails to break even' PICTURE EXCLUSIVE: Alicia Vikander springs into action with a series of slick stunts as she's seen for the first time as Lara Croft on the set of Tomb Raider reboot 'I haven't lost any weight yet!': Pink reveals six weeks after welcoming son she's still the same size so she's hitting the gym with a trainer 'It might be a lot of pressure for her': Cindy Crawford reveals worries about her daughter Kaia Gerber, 15, entering the modelling world SPOILER ALERT: In trouble already? Coronation Street's comeback queen Rosie Webster lets her bad reputation rub off on little sister Sophie 'Josh loves my new bigger boobs!': Pregnant Binky Felstead talks about feeling sexy while expecting as she hints at romance with baby daddy JP Supermodel Karlie Kloss says she beats jetlag by working out... and reveals her favourite chocolate is gluten-free The Night Manager's Elizabeth Debicki concedes that co-star Tom Hiddleston is 'basically perfect'... as she admits she DIDN'T watch Broadchurch Coleen Nolan says she hasn't spoken to husband Ray since CBB win... as she reveals suspected HEART ATTACK after 32 days of drinking Animal attraction! Vanessa Hudgens wears leopard print coat as she steps out for coffee in LA Pretty in pink! Kate Bosworth looks lovely in winter sweater as she visits vegan hot spot in West Hollywood Newly-engaged Pixie Lott looks chic in a white fringed coat and sexy slashed leather trousers as she steps out for dinner in London Jessica Simpson's dad Joe has cameo on Vanderpump Rules... and the 'Two Toms' freak out about it Following her supermodel kids! Yolanda Hadid is 'listing LA bachelorette pad for $5m to move to NYC for Bella and Gigi' PICTURED: Kylie Minogue goes incognito as she's seen out in public for the first time since confirming her shock split from fiancé Joshua Sasse Modern girl! Ariel Winter, 19, goes underwear and bra-free in skimpy dress as she plants kiss on 'man crush Monday' beau Levi Meaden, 29 PICTURE EXCLUSIVE: Furious Victoria Beckham returns to work in New York and David is spotted out in London Dangling Daniel! Actor Craig returns to his 007 roots as he hangs from a LAMPPOST while shooting gripping stunt scenes for LA riots drama Kings EXCLUSIVE: Surf's up! Hailey Baldwin makes a splash in black bathing suit during Hawaiian getaway The 20-year-old model looked carefree as she soaked up the sun 'The girls were screaming': TOWIE's Chloe Sims and Georgia Kousoulou 'left badly shaken' after attack in fast food chain following filming in Tenerife Ed Sheeran confirms he's ready for marriage... amid rumours he is 'set to propose to girlfriend Cherry Seaborn while touring in Australia' Heaven on earth! Jasmine Tookes flashes ample cleavage in sheer top as she leads the Victoria's Secret Angels in beach photo shoot Rosamund Pike looks every inch the English rose in a floral minidress as she giggles with her co-star David Oyelowo A United Kingdom premiere Kit for a king! Proud parents Wayne and Coleen Rooney celebrate their youngest son's first birthday with a cute blue-themed photoshoot Like two peas in a pod! Helena Bonham Carter and mum Elena Propper de Callejon wrap up warm in matching quirky outfits during stroll in New York Helen Flanagan reveals she had to defeat 'mum guilt' for her Corrie return as she looks to have more children with boyfriend Scott Sinclair Goodger gone bad? Lauren makes a surprise appearance in controversial music video of jailbird boyfriend's rapper brother . Beanie babe! Make-up free Vanessa Paradis, 44, goes incognito as she touches down in Los Angeles Athletic chic! Rita Ora mixes gym-wear with a glam cream coat as she leaves a work out session in New York after her stint as guest host on Live With Kelly Mila Kunis braves rain in turtleneck sweatshirt... as Ashton Kutcher praises Audi's feminist Super Bowl spot He's back in business! Mel Gibson's career comeback continues as the actor attends Oscars luncheon to celebrate Best Director nomination This jailbird is free! Orange Is The New Black star Jackie Cruz trades in her bulky prison uniform for a flirty bikini in Miami Life in the fast lane! EOTB's Charlotte Dawson rocks a quirky biker jacket and metallic miniskirt as she enjoys a spot of pampering in Birmingham Back to work! Malia Obama enjoys a weekend coffee break before heading back in for a second week of work at the Weinstein Co. He's a doting dad! Kelsey Grammer, 61, treats wife Kayte Walsh, 35, and two kids to lunch but leaves baby at home Plum perfection! Duchess of Cambridge opts for a stylish peplum two-piece as she steps out for a mental health conference in London Paramount pulls Brad Pitt's World War Z sequel from its lineup as long-in-the-works zombie thriller hits the skids What a view! Victoria's Secret model Jasmine Tookes shows off her perky bottom and flat stomach during birthday getaway to Mexico Single Jorgie Porter flaunts her toned legs in beaded minidress at fashion show... as she admits she wants to find a 'hairy man to throw her around' 'Straight outta mumma': Pink shares adorable snap of month-old son Jameson Moon... as he sports onesie with cheeky message Frill seeker! Donna Air showcases her slender physique in a gold silk embroidered dress as she attends BFC Fashion Trust talk She's known for her stylish displays. Lady in red! Queen Maxima of the Netherlands puts on a stunning display in a £3,600 Valentino kaftan at a glittering reception in The Hague Borrowing her older sister's clothes! Bella Hadid steps out in same tummy-exposing look as sibling Gigi during NYC sighting Mane In Chelsea! Georgia Toffolo wraps up in an ultra lavish fur hood as she steps out for dinner in London She looks divine! Julianne Hough reveals her luminous porcelain skin as she heads to church with no make-up Naomie Harris is the darling of the Oscars luncheon in pleats and lace as she revels in Supporting Actress nod Kim Kardashian skips Super Bowl fun to shop for 'Valentine's Day books for Northie' in deserted store Mother-of-two gushed on Sunday via Snapchat 'Pot bellies are sexy!' Lady Gaga's fans hit back at Super Bowl bodyshamers as they celebrate her for flaunting natural figure during epic set 'My dad lets me hold his real gun': Kim Zolciak shares 4-year-old son Kash's school Q&A about Kroy Biermann EastEnders avoids Ofcom investigation after viewers deemed harrowing bus crash storyline insensitive in light of Berlin terror attack 'B***h, what?': Kim Zolciak snaps after fellow guest at $1800-per-night exclusive resort complains about her rowdy children on the beach 'She killed it!': Pink compliments Lady Gaga's Super Bowl halftime show and insists the Poker Face singer did NOT copy her acrobatics PICTURED: Lady Gaga breaks down in tears as she hugs her family backstage after triumphant Super Bowl show Rita Ora oozes glamour in a pink lace gown and chic cream cocoon coat as she steps out in Soho She's always possessed a killer sense of style Queen of the belfie! Skye Wheatley shares racy snaps of herself on holiday in Bali flaunting her famous curves in both lace lingerie and a skimpy bikini 'Magic was an area I could not go down': Debbie McGee reveals she has finally felt able to perform magic again for the first time since husband Paul Daniels' death Beach day! Makeup-free Katie Holmes says she feels 'gratitude' as she takes daughter Suri to Santa Monica to hang out with her two cousins 'It's genetics': Kim Zolciak tells fans how she stays 'fit' while sharing more bikini snaps from luxury trip EXCLUSIVE: 'I'm happy fully-clothed!' The Voice's Lucy Kane on why she won't follow famous mum Linda Lusardi's topless modelling past Day off from being a movie star! Matt Damon, 46, looks like an average dad as he takes in step-daughter Alexia's soccer game Dreary day: Natalie Portman nearly bursts out of raincoat as she gets caught in drizzle before Oscars nominees' luncheon 'Right girl, wrong time': Stephen Bear refuses to confirm he's dating Charlotte Crosby despite pictures of them kissing... as he jokes that they're expecting a BABY Make-up free Diane Kruger bundles up in plush winter coat and sweater as she lugs along huge bag of laundry In no mood to smile! Naomi Watts looks downcast as she shoots Gypsy in NYC...after being nominated WORST actress by the Razzies Ed Sheeran, 25, jokes about getting an Elton John, 69, tattoo on his bum because the crooner is always 'asking him to sit on his face' Kanye West DELETES his tweets about Donald Trump 'because he's unhappy with the President's choices'... after strongly supporting him She's the cat's whiskers! Sarah Hyland prowls around in latex mini-dress for Pussycat Dolls performance on Lip Sync Battle Style never sleeps: Model Suki Waterhouse sashays through New York late at night in a baby blue trench coat as she shoots city campaign She's in demand! Dakota Fanning can't take her eyes off her phone as she steps out in leggings and jacket Yes, he was there! Lady Gaga's ex Taylor Kinney is spotted cheering the singer on at the Super Bowl as she delivers sizzling halftime show She's on fire! Kylie Jenner models black sweat outfit with flames on the sleeves that's part of her new THICK! clothing collection Stranger Things kids jump up and down and embrace as the trailer for season 2 debuts during Super Bowl... and each share upside-down snaps Holly Willoughby is left speechless as This Morning's soap reporter Sharon Marshall flirts up a storm with Emmerdale bad boy Michael Praed Flip or Flop star Tarek El Moussa leaves dinner date with mystery blonde in his Lamborghini... just days after ex Christina steps out with new boyfriend The Trump effect: Lena Dunham steps out after revealing she lost weight because she was 'too upset to eat' following 'soul-crushing' Presidential election No time to gussy up! Pharrell Williams is unshaven and underdressed for Oscars luncheon after welcoming triplets weeks ago Go(ne) girl! Rosamund Pike power-dresses in chic checked trousers and a crisp white shirt as she appears on Good Morning America Moss have lost her clothes! Kate's sister Lottie poses in her lingerie for sexy bedroom snap after sharing a saucy picture of her pert behind Sealed with an 'H'? Meghan Markle makes a bold declaration of her love for Prince Harry wearing a ring with his initial as she shops for flowers in London Is this how Meghan would redecorate Kensington Palace? Suits star's Toronto home reveals her love of fine art, white furnishings and candles 'Such a cozy space!' Kourtney Kardashian opens up Reign's bedroom... complete with a family bed and hand-me-downs from Mason Busty move! Sofia Vergara gives Ellen a belated birthday present... that she wrapped in her boobs Victoria Beckham is flanked by security as she jets out of London after it's claimed David 'was victim of £1m blackmail plot over his emails to advisers' Quirky FKA twigs enjoys a romantic dinner with fiancé Robert Pattinson in London... as his ex Kristen Stewart reveals she is gay Howe short can you go? Playboy bunny Carla makes the most of her incredibly perky posterior in perilous mini paired with racy thigh-highs Female DJ aims to boost her popularity with a racy video showcasing her VERY shapely body (but her curves are not all they seem) Diddy make a new friend? Former Coronation Street star Ryan Thomas shares a shot of himself hanging out with Sean Combs at Super Bowl bash 'It's liquid gold!' Scarlett Johansson smuggled her breast pump into the Oscars... but it ended up at a party with Kelly Ripa Doesn't fit in a clutch Bronzed Gareth Gates cuddles up to glamorous girlfriend Faye Brookes as they enjoy a cosy date night More of a natural glow Chloe Khan flaunts her eye-popping bust and peachy posterior in VERY steamy fashion photoshoot She's well established in the world of modelling ",
                              "label": 0,
                              "dataset": "grafn",
                              "distance": 0.5812259138192728
                        },
                        {
                              "text": "5 Sources of Extra Energy for Entrepreneurs Image credit: Shutterstock --- Shares July 21, 2016 \nI decided to get serious about my health and fitness at the end of last year , which involved starting a very strict workout regimen, beginning at 5 a.m. every morning. I also switched to a standing desk -- another move designed to improve my health. \nI did this to get into great shape, but also to improve my overall energy. Being an entrepreneur involves long hours -- it’s a constant grind that doesn’t shut off after 5 p.m. or on the weekends. 1. Caffeinated beverages. \nI feel like caffeine gets a bad wrap sometimes. There are going to be drawbacks and cons for almost everything, but there are several health benefits of including caffeine in your diet. The key is to limit your caffeine intake -- according to the Mayo Clinic , 400 milligrams per day is perfectly fine for a healthy adult. For reference, there is 80 mg of caffeine in an 8.4 oz can of Red Bull, which is similar to the average cup of coffee. \nRelated: 5 All-Natural Ways to Boost Energy, Fast \nStart your day with a coffee and keep a few energy drinks in the office for those times that you need a bit of energy to power through your tasks. You don’t want to rely entirely on caffeine, but you don’t have to avoid it like the plaque, either. There is nothing wrong with using it in moderation. 2. Frequent smaller meals. \nIt's better to eat small meals and snacks every few hours than three large meals a day, if you want to increase your energy, according to Harvard Medical School . Eating frequent smaller meals reduces your perception of fatigue because the brain requires a steady supply of nutrients and has very few energy reserves. \nMost individuals will start to feel sluggish after a few hours without eating. You don’t need a huge meal to fuel your brain -- a piece of fruit or a small snack, such as almonds, will do the trick. I eat six smaller meals a day, opposed to the standard three meals. While it was difficult to adjust to at first, it has definitely improved my energy levels. Prepping your meals in advance is a huge advantage and will help you stay on the six-per-day schedule. 3. Kratom. \nI incorporate supplementation into my diet, and recently started looking into Kratom , or Mitragyna Speciosa, an herb used to help people stay alert. A plant native to Southeast Asia in the coffee family, many claim it helps to increase concentration and energy levels. After trying it, I would compare it to a very powerful caffeine pill or a very strong pre-workout supplement. \nRelated: How to Build the Stamina You Need As An Entrepreneur \nKratom is a supplement that, since around 2012, has really caused quite the buzz online. In higher doses, it has been said to be used as a pain killer, and because of this, a few states have banned the plant-derived supplement, with Alabama being the latest . If you have tried this supplement, tweet me , as I am interested in hearing about your experience. 4. NAD+ booster. \nNicotinamide adenine dinucleotide (NAD+) is an essential metabolite in all human cells and it plays a key role in cellular metabolism. Many use this supplement for its anti-aging and metabolism benefits, but it has also been shown to offer several other health benefits. These include increased endurance, improved mental focus and memory, and increasing muscle endurance. \nI was first turned onto this product as part of my training supplementation and I quickly experienced the mental focus benefits, which contributed to a much more energetic state. There are many benefits aside from increased energy and I encourage you to explore them. 5. Sleep. \nLast, but not least, is good old fashion sleep. Adequate sleep is necessary for healthy functioning . There is no denying we all need sleep; it regulates mood and is a critical factor in your energy level. I think it’s important to find out what works best for you personally, rather than just going along with the perceived notion that eight hours a night is ideal. For me, I am good on just four hours, yet I know individuals that can’t function on anything less than 10 hours. \nRelated: 18 Unusual Habits That Boost Your Energy More Than Coffee \nSleep will help you restore your energy levels, but did you also know that getting adequate sleep the first night after learning a new skill is important for improving memory and performance ? As entrepreneurs, we are constantly absorbing new information and skills, which is another reason to make sure you get a solid sleep every night. Jonathan Long Jonathan Long is the founder of Market Domination Media®, a performance-based online marketing agency, blerrp™, an influencer marketing agency and co-founder of consumer product Sexy Smile Kit&trade... ",
                              "label": 0,
                              "dataset": "grafn",
                              "distance": 0.5812259138192728
                        },
                        {
                              "text": "DON'T MISS 'She's manipulated the public against me' Jeremy McConnell slams 'toxic' Steph Davis amid paternity battle as he takes a DNA test live on TV Gigi Hadid and Zayn Malik head out on a low-key outing as they surface for first time since supermodel became embroiled in 'racism row' 'You still look like a child!' Youthful Louisa Lytton gets a backhanded compliment from Lorraine Kelly as she discusses new role in musical Grease 'I felt drained, heavy and alienated': Fearne Cotton bravely reveals her dark battle with depression... as she credits partner Jesse Wood for being her rock The bisexual artist and the socialite who parties with DiCaprio - but can you guess which of Britain's Next Top Model's new hopefuls was born a BOY? 'Karma has come full circle': Bianca Gascoigne's ex CJ Meeks mocks the model following her split from CBB beau Jamie O'Hara More drama Lorraine Kelly hits back after eagle-eyed viewers spot her dress is on back to front... as she insists the floral number is 'incredibly versatile' As Blind Date returns to TV, FEMAIL reveals the famous faces that went on the show looking for love (and the couples that are still together 20 years later) What's your secret? Bella Hadid and a host of models board the Air Tommy jet ahead of the Hilfiger show... but does it remind you of something? Letting loose! 'Pregnant' Irina Shayk covers up in a baggy black top and leather jacket as she heads out for casual shopping trip 'He's back in London!' Fans go wild as Liam Payne is reunited with pregnant Cheryl after recording debut solo album in Los Angeles Melissa McCarthy undergoes another amazing transformation on set of new film with Richard E. Grant... after THAT Sean Spicer parody on SNL 'A sweet I wouldn't mind unwrapping': Susanna Reid labels shiny purple stilettos her 'Quality Street heels' after Twitter goes wild for her bold new look Yummy mummies! Heavily pregnant Billie Faiers flaunts her bump in clingy jumpsuit as she heads out in Essex with glamorous sister Sam and their cute children 'Channelling my inner Kardashian': Busty Vicky Pattison rips off selfie-queen Kim as she flaunts her incredible curves in raunchy swimsuit TOWIE's Chloe Lewis beams as she throws herself into horseriding session with co-stars during filming... after ignoring ex Jake Hall's engagement hints It's the Meghan effect! Now it's Harry's girlfriend whose fashion choices are driving sales (and her tastes are a lot more frugal than Kate Middleton's) BREAKING NEWS: Alan Simpson, half of Steptoe and Son comedy writing legends Galton and Simpson, dies aged 87 Her fur-vourite man: Vanessa Feltz and her partner Ben Ofoedu go for complementing winter coats as they enjoy a romantic stroll 'She'll be taking it easier than normal': Pregnant Beyonce will tone down her performance at the Grammys Expecting twins Don't look now, Chantelle! Jemma Lucy enjoys a night out with mystery beauty... after lewd revelations over sex life with Geordie Shore star 'girlfriend' Piste off! Aaron Chalmers nurses his wounded arm in a sling as he parties with Geordie Shore pals after 'snowboarding accident' in France 'I'm proud of my body': Lady Gaga hits back at body shamers... while thanking fans for support after Super Bowl gig How sweet! Busty Kim Kardashian treats Kanye West to a spa day and even makes a stop at ice cream shop so her husband can get a cone 'Yes, they occasionally bite you!' Red-faced Martin Clunes cops an unfortunate nip from his 'naughty' pet horse live on Lorraine Real Housewife of Chest-hire! Missé Beqiri goes braless in plunging top as she oozes sex appeal in new fashion campaign WATCH as Kristen Stewart plays the vulnerable and brittle heroine in the new unnerving full-length trailer for Personal Shopper Madonna's Instagram post about 'beauties' Stella and Esther showed Malawian twins cuddling up to Lourdes six months BEFORE adoption An unlikely duo! Justin Bieber appears in a VERY bizarre Japanese phone commercial with eccentric comic Piko Taro What's he up to? 'I've had to get comfortable with being naked': Braless Kate Moss talks nudity and fancying Johnny Depp... as she turns up the heat in W magazine shoot 'He moved into her hotel... on purpose': Joshua Sasse's co-star suggests opportunist actor 'set his sights on Kylie from the start'... despite remarking that he 'hadn't heard of her' 'I can't apologise enough': Kerry Katona pulls out of Atomic Kitten reunion gig in Perth as she's struck down with mystery illness Make-up free Alessandra Ambrosio shows off her slender frame in tight Victoria's Secret gym gear as she heads for gruelling workout 'She's parading him around': Jeremy McConnell accuses Stephanie of living off baby son... but insists he WANTS to be the father as he breaks silence 'It stressed her greatly': Carol McGiffin slams NHS as she claims her sister was pressured into leaving hospital just days before her death from cancer Coronation Street's Brooke Vincent SNUBS her on-screen lesbian storylines as she reveals 'there's more to people than their sexuality' 'Now is the right time': Adele 'is planning for baby number two' with partner Simon Konecki ahead of summer hiatus Keen to extend her family 'I am not overwhelmed, but I am definitely whelmed': Blazing Saddles legend Mel Brooks, 90, to receive BAFTA Fellowship at glitzy prizegiving Chrissy Teigen 'left unhurt after being involved in a hit and run car accident... with an unnamed suspect driver arrested in connection with the crash' Scottie Pippen and estranged wife Larsa 'halt divorce proceedings as they begin working on their marriage' Reconciliation rumours Turning the street into a catwalk! Supermodel Cindy Crawford, 50, struts her stuff in tight white jeans on first visit to Australia in ten years 'I have to learn to shrug it off': Lisa Riley was tormented by vile trolls who claimed she 'looks like a cancer victim' after shedding a whopping 11 STONE Girls' night out! Fergie steps out at the exclusive Arts Club in Mayfair as Amanda Holden also joins pals for an evening at the high-profile haunt Make SNL Great Again! Alec Baldwin's Trump impersonation propels sketch comedy show to its highest ratings in 22 years A Tignes-y bit cold? Geordie Shore newbie Zahida Allen shuns the cold to show off her curves in dazzling two-piece while filming at French ski resort Pitter patter of little feet? Newlyweds Margot Robbie and Tom Ackerley start their family as they ADOPT a gorgeous rescue puppy named Boo Radley She has good jeans! Sophie Turner shows off her super-slim legs in skintight denim as she steps out in LA Game of Thrones beauty Chip off the old block! Reese Witherspoon brings her lookalike daughter Ava to premiere of Big Little Lies Mother-daughter duo So in love! Nicole Kidman flashes flesh in plunging split gown as she packs on PDA with Keith Urban at Big Little Lies premiere Dev Patel jets out of LAX as he heads to London for the BAFTAs... after being tipped for Best Supporting Actor award glory for role in Lion Emily Ratajkowski packs on the PDA with musician boyfriend Jeff Magid as they share rare insight into their romance on saucy Snapchat Make-up free Jennifer Garner looks effortlessly chic in a cosy grey jumper and skinny jeans on shopping trip 'Rest with the galactic stars!' George Takei and Dirk Benedict lead tributes to Battlestar Galactica's Richard Hatch who has died from cancer at 71 'Be mine, marry me' New Fifty Shades Darker trailer teases Christian's dreamy proposal... and more steamy moments from the film Careful there! Kylie Jenner busts out of a bustier as she gives fans more than just a sneak peek of new collection from hers and sister Kendall's line Tyga sued by process server who was 'attacked by rapper's entourage' while handing him summons for another case 'It's an unfair and unwinnable game': Lena Dunham defends Taylor Swift's dating history as she brands criticism as sexist Long list of ex lovers 'I just single white femaled my friend!' Olivia Wilde debuts new platinum bob at Tiffany bash only to find it looks EXACTLY like Kate Mara's Hanging with his second Bourne! Matt Damon keeps it casual as he spends quality time with daughter Gia in LA Quality time Living like a celebrity in the City of Angels' most heavenly hotels: Inside Kim Kardashian's favourite LA lodgings and the plush star of Pretty Woman Ayda Field looks sartorially savvy in chic coat and wide-leg trousers as she cosies up to husband Robbie Williams for date night at art exhibition Amanda Holden supports Simon Cowell's girlfriend Lauren Silverman after claims about the music mogul's sex life Gal pals Pregnant Binky Felstead teases a glimpse of her thighs in a pink shirt dress... as she reveals she and JP are 'the happiest they've been in a long time' Human Ken Doll Rodrigo Alves steps out in two-piece metallic blazer and VERY skinny jeans during night out in London... after denying he's addicted to surgery 'She sounds like she's from Carlisle!' Viewers mock Sheridan Smith's attempt at a Yorkshire accent in BBC's Shannon Matthews drama Newly-single Bianca Gascoigne puts on a leggy display as she hits the town after being DUMPED over the internet by her CBB lover Jamie O'Hara 'I was 12 when it all started': Poppy Delevingne reveals how she supported sisters Cara and Chloe through their mother's heroin addiction 'Get a life!': Sharon Osbourne SHAMES David Beckham over 'shallow' calls to get a knighthood in furious rant over his leaked email scandal The scarves! Catherine Zeta-Jones gives tour of her cavernous closet loaded with luxury items and designer wares Envy-inducing 'When it just ain't happening!' Jesy Nelson leaves Little Mix bandmates in hysterics as she drops the F-bomb mid-song on stage during US Tour Shades of boob! Jennifer Lopez shares VERY energetic rehearsal for Vegas show... and narrowly escapes wardrobe malfunction 'He loves getting drunk and I love getting drunk': Ed Sheeran, 25, reveals his big boozy nights out with 52-year-old actor Russell Crowe PICTURE EXCLUSIVE: Flaunting it! Hailey Baldwin shows off her toned figure in a colourful bikini as she splashes around in the water in Hawaii g on the island. Shailene Woodley teams up with Zoe Kravitz as they reveal some decolletage at premiere for HBO's Big Little Lies in Hollywood Beau my word! Ellen DeGeneres' former lover Anne Heche smooches boyfriend at Big Little Lies premiere Red carpet PDA with her handsome beau 'I'm disgusted when I look at her': Javi Marroquin slams Teen Mom ex Kailyn Lowry following bitter Twitter spat Still feuding Top of the crops! Bella Hadid bares her toned tummy in behind-the-scenes footage for latest modeling gig with Nike Flurry of sexy images Britney Spears' eight-year-old niece Maddie 'doing better and better' after tragic ATV accident two days ago that left her submerged underwater for minutes Ouch! Kate Winslet appears bruised and battered on set of The Mountain Between Us in British Columbia That looks like it must have hurt Gabrielle Union shows stylish side in green overcoat while arriving for Jimmy Kimmel Live show in Hollywood Arrived in style Fifty Shades of sexy! Dakota Johnson sizzles in a backless glitter-encrusted gown as she attends the Berlin Film première with Jamie Dornan Lena Dunham wears orange silk dress as she joins business partner Jenni Konner for a talk about anxiety and OCD Growing Up With Anxiety event Brad Goreski of Fashion Police deems Tamra Judge as Housewives star 'most in need of a makeover' on WWHL Ffashion authority In the bag! Lily-Rose Depp shows off new Chanel purse and model looks while arriving at studio in Los Angeles 17-year-old model Mischa Barton looks in good spirits as she emerges make-up free in LA following shocking 'meltdown' Actress was hospitalised last week Selena Gomez puckers up for selfie in white halter dress... after hot date with The Weeknd The 24-year-old pop diva had just caught a flight Full of youthful exuberance! Sarah Silverman grins with glee at airport... after being mistaken for Kate Beckinsale's daughter Eva Mendes looks fresh faced and happy as she visits celeb hot spot Epione in Beverly Hills One of the most beautiful actresses in Hollywood Olivia Palermo is stylish in black coat and faux fur scarf at NYC launch event for Ashley Biden's hoodie collection Just like Kim! Kourtney Kardashian shows off her bare legs as she wears a hoodie as a dress when taking Mason out in LA Casual yet chic Peep show! Kelly Rutherford flashes her bra in semi-sheer jumpsuit at the Epson Digital Couture Made quite the appearance Miley Cyrus dresses down for lunch date with fiancé Liam Hemsworth at Malibu bistro Ollo The 24-year-old pop diva was ready for the gym 'Lost my pops, he's still alive': Marquise Jackson denies new track is a diss at father 50 Cent... but won't collaborate because 'his music sucks' Hats off! Princess Mary steps out in her favourite purple pillbox... appearing to take style inspiration from the late Jackie Kennedy at exhibition opening Ed Sheeran worries that Sunrise playing a viral video of Donald Trump 'singing' his hit Shape Of You has 'ruined his chances' at Number One 'My Everything!': Stephanie Davis shares a super cute picture of her newborn Caben-Albi... as her ex Jeremy McConnell claims the baby looks like him Keeping it hot! Kyle Richards shares a steamy lip-lock with husband Mauricio on vacation in Cabo This couple keeps it hot on vacation Ivanka shares sweet snap of her and 'personal assistant' baby Theodore at the White House as four more retailers dump her fashion line Putting her best face forward! Melanie Griffith, 59, shows off slim figure in tight black leggings after leaving skincare salon Beyoncé 'being sued by estate of New Orleans rapper Messy Mya for sampling the artist's work without permission in Formation' Bethenny Frankel wears kinky knee-high boots as she steps out for a night on the town...after ex was arrested for stalking Comedian Irwin Corey known as The World's Foremost Authority dies in New York aged 102 Enjoyed a comedic career spanning almost eight decades Seeking frills! Braless Pamela Anderson teases her famous cleavage in nothing but high-waisted knickers and a sheer lace frock Pin-up perfection 'I've got two words for you my friend - the gym!': Denzel Washington pokes fun at Mel Gibson's weight at the Oscar nominees luncheon Rita Ora forgoes a bra in a very low-cut wrap dress and matching trousers as she slips into something 'fifty shades lighter' for third outfit change of day Charlotte Dawson flashes the flesh in a nude corset, TINY mini-skirt and white thigh-high boots as she hits Birmingham for a night out Blind Date set for 'young and sexy' reboot with Vicky Pattison tipped to step into Cilla Black's shoes Hot on the heels of First Dates and Take Me Out 'It would have been more respectful to hear it from him': Bianca Gascoigne claims Jamie O'Hara didn't TELL her that he 'wanted to split to focus on his family' 'Who's this cruel f**k?': Ed Sheeran forced to make rude remarks in VERY awkward interview with Australian radio hosts Hughesy and Kate A vision in white: Keke Palmer shows cleavage at the Young Hollywood studio as she promotes her new book I Don't Belong To You Black-clad Selma Blair strolls in Beverly Hills and mourns the death of her beloved dog Wink It's been an emotional week for the 44-year-old Katy Perry asks 'why are we all so chained?' as she teases new song Chained To The Rhythm written by pop princess Sia New music More to love! Paris Hilton displays bigger chest in plunging dress during Vegas trip... even though she insists she's never had a boob job Taking the plunge Taking it hard? Amy Adams looks downcast leaving grocery store after being snubbed for an Oscar nomination for Arrival She's Taken again! Action flick heroine Maggie Grace shares snap of herself with fiance Brent Bushnell after getting engaged No longer Liam's little girl 'She sends me videos of our cats': Ed Sheeran describes his 'chill' relationship with Cherry Seaborn and says 'everything is a lot easier' with her 'Heaven!': Jennifer Lopez posts sweet throwback photo of herself hugging her son Maximilian when he was just a baby Flashback 'Don't call ME ignorant!' Zayn Malik lashes out at trolls who call him a TERRORIST... after defending girlfriend Gigi Hadid in 'racism' row Adele brought in $80.5m in 2016 making her the highest-paid Grammy nominee with Beyonce and Justin Bieber trailing behind Forbes figures 'My little Poosh!' Kourtney Kardashian plants a tender kiss on her daughter Penelope in sweet Instagram snap as she enjoys some quality family time Downcast Victoria Beckham fails to crack a smile as she departs NYC hotel amid husband David's leaked email scandal Focusing on work Jemma Lucy shocks fans as she reveals lurid details about sex act she's performed with new girlfriend Chantelle Connelly Too much information Queen Letizia of Spain cuts a chic figure in simple black dress and elegant braided updo as she attends press event in Madrid Elegant 'Because it's nearly Valentine's!': MIC's Frankie Gaff flaunts her enviably toned figure in red lace lingerie as she poses seductively on her bed Her little merman! Kim Kardashian shares heartwarming snaps of a sweet mother and son moment with baby Saint taken on exotic family holiday Braless Rita Ora comes dangerously close to a nip-slip in a backless top as she slips into a sexier second outfit of the day in NYC What a doll! Gigi Hadid is transformed into a Barbie doll for new Tommy Hilfiger capsule collection Life in plastic, it's fantastic 'He's eating like a little pig': Father of nine Mel Gibson, 61, says newborn son Lars is 'doing great' Welcomed son with Rosalind Ross, 26 Pascal Craymer puts on a very busty display in two equally eye-popping dresses as she party hops around London Centre of attention 'He had his hand in her lap!' Blac Chyna 'seen cosying up with a mystery man who was not her partner Rob Kardashian' Trouble in paradise? 'If I lived in Bristol, he'd be alive today': Anne Diamond reduces Stacey Solomon to tears on Loose Women as she discusses loss of baby Sebastian from SIDS Beyonce, 35, and Jay Z, 47, 'tried for YEARS' to expand their family and now that she is pregnant with twins they are 'very happy' Baby joy Chloe Lewis puts on a classy display in black jumpsuit as she attends fashion event in London amid rumours her ex Jake Hall has proposed to girlfriend Missé Beqiri Bottoms up! Jimmy Fallon flaunts his delightful derriere as Joe Jonas gives him underwear modelling lesson Brief encounter 'My son was getting a little chubby': Model Natalia Vodianova admits being 'military' about her five children's diets... as she discusses future marriage plans 'We're touring right until the due date': Elbow's Guy Garvey, 42, 'overjoyed' to be expecting his first child with Avengers actress Rachael Stirling, 39 Un-fur-gettable! EJ Johnson wears fuzzy jacket over see-through netted top as he hits LA airport with his favorite Chanel purse Fabulous Shake your pants! Ashley Graham sets pulses racing as she seductively wiggles her shapely curves in lacy blue lingerie from her range Golly Miss Holly, how did you make so much lolly! From bed linen to yoghurt and toothpaste, the money-spinning empire of TV's £11million blonde Queens, start your engines! Lady Gaga is set to guest judge season premiere of RuPaul's Drag Race after ace Super Bowl performance Never mind the rain! Nicky Hilton coos over baby daughter Lily as they're caught in a sudden downpour during New York City stroll Take shelter 'Look at who sneaked into this one!': Jimmy Kimmel is outraged that 'enemy' Matt Damon got to sit next to Emma Stone at Oscar lunch Jealous EXCLUSIVE 'He likes me in a tracksuit': Sam Faiers' boyfriend Paul advises her on fashion... as sister Billie says fiancé 'wouldn't dare' tell her what to wear Tallia Storm flashes her flat stomach in skimpy black bralet and denim skirt as she puts in a glamorous appearance at Centrepoint pub quiz Rosamund Pike oozes class in a billowing overcoat and futuristic silver top as she discusses new film A United Kingdom in New York Buxom Pamela Anderson writhes around in skimpy lace lingerie as she performs solo sex act for a VERY raunchy anti-Valentine's Day video Putting her best foot forward! Kylie Jenner flashes hint of toned torso in a pink crop top as she works up a sweat in Puma campaign Sporty Jack's back! Nicholson 'set to star in English language remake of Oscar nominated German film Toni Erdmann' Plays a practical joker 'Hopefully she turns a corner': Tom Brady says prognosis of mom's cancer battle is good... and hopes Super Bowl win provides 'healing energy' EXCLUSIVE PICTURES: Rihanna shows how to make everyone green with envy in a curve-hugging dress as she gets wiggy for colorful photo shoot I'm Joey's girl! Scantily clad Lauren Goodger flashes her well rounded derrière as she treats jailed beau Morrison to another selfie Treat for her man 'She paints her room purple': North West redecorates her bedroom in NAIL POLISH...before helping mother Kim Kardashian clean up 'What the f*** is going on?': Michael Bolton, 63, shows off his comedic side in new trailer for cheesy Big, Sexy Valentine's Day Special Netflix original Bye, bye Trump hair: Katy Perry dyes 'blorange' hair PLATINUM as it's announced she'll perform new music at Grammy Awards Judy Garland's ex-husband Sid Luft claims that Wizard of Oz munchkins molested the 16-year-old star and 'frequently put their hands up her skirt' 'Unfortunately it's come to an end': Jamie O'Hara 'splits from CBB lover Bianca Gascoigne to focus on family'... three days after show's final West Coast vs East Coast! Ashley Tisdale goes makeup free as she hits the gym in Yankees hat and Beverly Hills hoodie Low key Some kind of little monsters! Lady Gaga to duet with Metallica at The Grammys... after highly-praised Super Bowl halftime show Dynamic duet 'Baseless rumors': Nikki Reed posts cosy photo with husband Ian Somerhalder and his ex Nina Dobrev and BLASTS speculation of a feud 'I'm really scared': Pregnant Amy Childs reveals she's hoping for a water birth... as she admits she's having the 'weirdest lemon tart cravings' Just the two of us! Armie Hammer bonds with adorable daughter Harper on rainy outing after welcoming son to family Family fun Hitting the ground running! Cindy Crawford, 50, shows off her wrinkle-free and glowing complexion as she arrives in Australia Travelling in style That's the power of love! Celine Dion left flabbergasted as man proposes in front of her... and photobombs magic moment with funny facial expression Sad to leave? Selena Gomez flashes taut tummy in crop top as she arrives for solo flight looking downcast... just one day after 'cozy' date with The Weeknd Looking divine! Karolina Kurkova looks spellbinding in chic white dress with sexy thigh-high slit as she attends fundraising event Sheridan shines in a grubby tale of a mother's greed and betrayal: CHRISTOPHER STEVENS review's last night's TV Naomi Watts passionately kisses and caresses co-star Sophie Cookson while filming new Netflix series Gypsy Locking lips 'Time flies': Sky Sports presenter Natalie Pinkham shares funny before and after pregnancy snap as she celebrates baby Willow's eight months Jeremy McConnell parties with Marco Pierre White's ex during wild night out in Dublin... as he prepares to tell all about Stephanie Davis and baby on live TV 'Simon Cowell was just like Christian Grey in bed': Alicia Douvall reveals all about her sizzling six month affair with 'sensitive but domineering' TV star Kim Kardashian's huge diamond engagement ring disappears from her video game to reflect her real life after Paris robbery Lady Gaga sees her music sales rocket 1,000% after amazing halftime Super Bowl show Stunning halftime show boosted sales Hidden Figures edges out La La Land to become highest-grossing best picture nominee at the 2017 Academy Awards $120m so far Tie me up! Blonde bombshell Charlotte McKinney sizzles in plunge neck crisscross top on promo tour of New York Casual look 'It was the most terrifying thing': The Apprentice UK star Dillon St Paul is in recovery after undergoing emergency surgery on brain tumour Fifty Shades of sweat! Cheerleader-turned-trainer who whipped Dakota Johnson and Jamie Dornan into shape for their sex scenes tells all Headed to TV: Nicole Kidman buys television rights for bestselling novel The Expatriates and could star in the series New project 'Serves you right for appropriating': Instagram users point out perplexed faces behind Alyssa Milano as she shows off cornrows at Super Bowl Strictly? Archers? Dr Who? No, this gem is the best thing on the BBC: DOMINIC SANDBROOK on why he's a fan of In Our Time as show marks 750th edition Take a Luke at what he's missing! Scarlett Moffatt shows off her slender frame in busty Instagram shot... days after confirming split from long-term love Give Me Love! Female fans breakdown in tears as Ed Sheeran takes selfies with them and causes pandemonium during appearance on Sunrise Dwayne 'The Rock' Johnson to star in wrestling movie Fighting With My Family based on true story of WWE standout Paige Inspired by documentary If the shoe fits! Brooklyn Beckham shows off his skater style in mismatched footwear as he steps out amid dad David's email hacking scandal 'I grew up not loving how I looked': Christie Brinkley's daughters Sailor and Alexa plead for women to accept their bodies after starring in SI MORE DON'T MISS 'You need to be single!': Kelly Ripa and husband Mark Consuelos roast Bachelor star Nick Viall during his Live! appearance Pregnant Alex Gerrard conceals her baby bump in a plaid shirt and chic leather jacket as she treats herself to a pamper day in Liverpool Maxima cuts the mustard: Dutch Queen rocks yellow jumpsuit as she joins King Willem-Alexander at Wartburg castle on day one of their German tour Lauren Pope pulls her very best Baywatch pose in tiny red swimsuit as her sensational figure detracts from the blissful Dubai skyline Towie star Cara Kilbey's boyfriend 'was ringleader of multi-million pound drug gang that posed as trainee cabbies while selling cocaine and heroin' 'In five weeks, I've lost 10lb': Chloe Madeley flaunts her rippling muscles in tiny crop top and thong as she posts yet ANOTHER revealing selfie 'They're devaluing the victim': Mackenzie Phillips says exposing incestuous affair with her father ruined her family relationships Discussing abuse He's got a Passenger! Chris Pratt keeps walking as son Jack clings to his leg during fun family outing in Atlanta Cute as can be Her love don't cost a thing! Victoria's Secret Angel Taylor Hill reveals her ideal Valentine's date is a trip to the movies and a $1 slice of PIZZA Amanda Holden flaunts her slender figure in pink leotard as she reveals her beauty transformation for new stage show on Instagram Undercover lady! Jessica Biel wears sunglasses during rainy outing with son... after husband Justin Timberlake makes a splash at Oscar lunch PICTURE EXCLUSIVE: Whole lot slimmer again! Kerry Katona flaunts her fab new figure in nautical bikini as she heads Down Under on tour with Atomic Kitten Tom Brady reveals Gisele Bundchen asked him to retire THREE TIMES the night of Super Bowl win... but quarterback is 'having too much fun' Coleen Rooney reveals pictures of her late sister Rosie were stolen days after the family marked what would have been her 19th birthday 'Trust me... she likes Asians': Half-Pakistani singer Zayn Malik defends girlfriend Gigi Hadid after 'racist' claims following Buddha impersonation Clean sleeping - the latest preachy trend: Gwyneth Paltrow's 'wellness gurus' give their precious advice on how to snooze 'healthily' Hats off! Hilary Duff hits the gym in a casual grey beanie and leggings after returning from girls getaway to Mexico Low-key One for Clarence House? Camilla admires a quirky Salvador Dali sofa as she visits an exhibition celebrating the modern artistic heritage of Sussex Country singer Willie Nelson, 83, cancels three California shows because of illness... but says he will be back on stage next week Health woes Where's mama Mila? Doting dad Ashton Kutcher carries baby boy Dimitri in car seat as he leaves brunch in Los Angeles Daddy duties 'I did it! I'm on the show!': Matt Damon dresses as Tom Brady to get on Jimmy Kimmel Live as he continues running gag Channeled the champ It's on again! Scottie Pippen and Larsa reunite after explosive split... and she has HUGE new diamond ring Back together and she has the bling to prove it Ex On The Beach's Nicole Bass flaunts her incredibly pert posterior in daring olive green bikini in sizzling belfie Saucy Instagram 'Everything goes to my butt': Nina Agdal reveals where she gains weight the most as she poses topless for Health magazine DiCaprio's girl Beaming beauty! Eva Longoria, 41, looks youthful in plaid and lace dress as she talks 'trailblazing women' at Makers Conference in California Danielle Lloyd steps out for a pampering session... as it's revealed her ex-Jamie O'Hara has 'split from Bianca Gascoigne to focus on family' 'I cried!': Newly-single Scarlett Moffatt recalls the mortifying moment she met Mary Berry whilst wearing her slippers James Corden channels his inner playboy in a lavish robe and slippers for magazine shoot as he dismisses Stephen Colbert rumours Military chic! Ruby Rose stuns in red cape coat and frilly designer heels in Marie Claire Mexico but keeps her edgy style for the cover Cover girl 'Brave girl': Katie Price's daughter Princess is hospitalised as she has the pins removed from her broken arm On the mend How the hopefuls from Katie Price's failed talent show, from Rylan Clark-Neal to Amy Willerton, went on to carve out their own showbiz careers 'You messed with the wrong b****es!': Amy Schumer points gun as she and Goldie Hawn try to escape their captors in new Snatched trailer Comedy duo Kim Woodburn is targeted by Twitter hackers as fake profile is used to respond to Phil Schofield 'phony' row 'Tonight was a disaster': Chelsea Handler appears worse for wear as she shares Snapchat of herself on the toilet in India Filming Netflix show 'It's not loaded!': Kim Zolciak hits back at critics that slammed her for letting her son, aged four, hold husband Kroy Biermann's gun Set the record straight Taking a stand! Lena Dunham calls out President Trump's treatment of women in new Vogue video as she claims she has NEVER worn a bra in her life Lena Dunham shares details of her 'Trump Diet' of 'veggie dogs and baby food' after revealing she lost weight because she was 'too upset to eat' 'I'm an emotional wreck, always ready to blow': Braless Nicola McLean bares all in JUST a slashed jumper... as she admits to having 'a lot of issues' Did YOU spot them? Eagle-eyed fan highlights details in Lady Gaga's Super Bowl outfit that he believes serve as signs of support for LGBT community Janet Street-Porter reveals moment she was caught having affair by her husband... yet missed the chance of forgiveness after losing track of time SPOILERS: Gina Rodriguez and fellow Jane The Virgin cast members react to shock twist on Monday night's episode New twist She's back! Vanessa Hudgens talks returning to Coachella and wonders how pregnant Beyonce will perform Promoted her new comedy series Getting her kicks! Bella Hadid ditches her pants as she poses up with designer Riccardo Tisci to show off his new Nike creations EXCLUSIVE: 'It's getting bigger every day': Human Ken Doll in despair after giant cyst appears behind his ear as a result of 50th cosmetic procedure My Faiers ladies! Sam looks stylish in a bronze ensemble as she teams up with pregnant sister Billie for launch of their new beauty range Expanding her empire Jennifer Connelly cast as villain in James Cameron's Alita: Battle Angel based on Manga comic Joins all-star cast including Waltz Jerry O'Connell shows off his buff 'army' bod on lunch date with fresh faced wife Rebecca Romijn as he enjoys some much needed family time 'Tell David it's time we see what he is': Twitter mob turns on Victoria Beckham as she ignores David's email scandal... but pushes her own brand Iskra Lawrence swaps her underwear for outerwear as she proudly displays her curves at lingerie bash in NYC Brit looked sensational Quite the catch! Katie Salmon struggles to contain her assets as she bares masses of sideboob from beneath monokini on Spanish beach Yoko Ono, 83, is spotted arriving in New York City in a wheelchair just weeks after joining women's rights march Solo arrival Pammy's back! Pamela Anderson makes a SIXTH visit to 'lover' Julian Assange as she brings vegan cheeseburgers to the Ecuadorian Embassy Lena Dunham gushes about intern Malia Obama and reveals the first daughter was kept off set for graphic sex scenes when she worked on Girls 'I'm not pretty and I don't have hair': Bankrupt Gail Porter blames alopecia for TV work struggles as she admits she has 'no income' Pregnant Binky Felstead reveals baby news has strengthened her relationship with JP... as ex Alex Mytton jokes that HE is the father Fifty Shades' Jamie Dornan agrees to wear neon mankini following Dakota Johnson bet... as saucy Phil Schofield jokes about strapping wife to the ceiling EXCLUSIVE: 'She greeted me wearing a tight tee with cherries on the front' Anna Nicole Smith's trainer/lover breaks silence on 10th anniversary of her death Meet Ed's A Team! Sheeran fans camp out for 20 hours in torrential rain to get a glimpse the UK pop star's Sunrise performance Tina Malone slips her tiny size six frame into a series of wedding dresses as she prepares to renew her vows Pulling out all the stops Ageless Christie Brinkley, 63, poses with daughters Sailor and Alexa for steamy Sports Illustrated Swimsuit Issue... 38 years after first covering the mag Royally pleased to be heading home! The Queen looks cheerful in green as she returns to London following her extended festive break in Sandringham Malawi court allows Madonna to adopt twin girls... days after the singer DENIED she wanted to adopt the four-year-old sisters Feed My Girl! Gigi Hadid brands beau Zayn Malik's mother's house her 'favourite restaurant in the world'... as she teaches herself to cook Yorkshire pudding 'It really f***ing spiralled out of control': Rufus Hound QUIT Celebrity Juice following explosive row with CBB's Kim Woodburn Fiery character Radio 4 presenter Steve Hewlett marries his partner in hospital after being told he has 'just weeks to live' in cancer battle Diagnosed last year Michael Bublé's actress wife Luisana Lopilato 'returning to work'... following news that son Noah, 3, is 'progressing well' during treatment for cancer Youthful Jane Seymour drapes a stylish shawl over her shoulders as she puts in an appearance at star-studded Running Wild premiere They've still got it! Rock legends Guns N' Roses send 40,000 fans into a frenzy as they kick of big Australia tour Eager fans turned out to see the band Got a plan Bey? Coachella organisers 'yet to receive contact from Beyonce following shock twin pregnancy announcement' Will she or won't she? 'You are a bit of a d**k head!' Mel B takes a playful dig at husband Stephen Belafonte in candid social media post as couple celebrate their 10th anniversary 'I'm grateful for my life': Danniella Westbrook looks at peace in Marbella... as she admits to feeling 'amazingly blessed' after relapse sorrows 'I'm bored of telling the story': Twiggy sighs when Susanna Reid asks how she was discovered... but defends presenter over 'frumpy' outfit Determined Vicky Pattison goes super low-key in exercise gear following workout... after sharing constant bikini weight-loss progress snaps 7 questions that need answering after the dramatic finale of Apple Tree Yard, by Jim Shelley Monday saw the four part drama come to a close Lauren Goodger flaunts her hourglass curves in a figure-hugging black jumpsuit... after defending her jailbird beau Joey Morrison and his family Two of a kind! Kellie Maloney shows off a photo of her stunning daughter Sophie just days after sharing her own selfie - and the similarities are striking Princess Eugenie's trendy Pinterest board: Royal's account reveals her love of hipster hangouts and has she hinted where she would like to get MARRIED? Now THAT's a statement necklace Single Kourtney hits the town after ex Scott's poolside gallivanting... and makes sure he knows where he stands He's still The Boss! Bruce Springsteen, 67, wows 18,000 strong crowd with his hit songs at Sydney stadium concert 'I haven't given myself time': Rio Ferdinand talks about being a single dad after wife's death... amid claims he's 'moved on with TOWIE star Kate Wright' Having a laugh of a time! Eddie Murphy's girlfriend Paige Butcher is all smiles during morning coffee run in LA Looking cheery Britney's niece, 8, 'should not have been in ATV as minimum age to ride is 10' as it's revealed manufacturer 'has faced lawsuits for previous accidents' Chic Charlotte McKinney wraps up in an elegant statement coat... but STILL manages to show off her famous cleavage in plunging top Poppy Delevingne oozes glamour in a sequinned black gown at LA fashion show... following her wild night out with David Beckham He's got Company! Justin Bieber and former rumoured love interest Rita Ora tease a collaboration as they perform together in Snapchat clip They're on the piste again! Geordie Shore's Chloe Ferry takes a tumble on the slopes as she joins co-stars Marnie and Sophie for filming in Tignes Chantelle Houghton ditches the glamour for a more natural look as she steps out in low key leather jacket and tight green dress 'He's plummier than the royals!' Twitter goes wild for Geordie Robson Green's posh new accent as he reveals plans to reunite with Jerome Flynn The heiress and the princess: Tamara Ecclestone's daughter Sophia sports sweet Cinderella dress as she's swung in the air by her adoring parents 'It's easy and comes in lots of flavours': First Dates Hotel's Christian virgin Jordan drives Twitter wild as he compares premarital sex to soup 'It makes me feel magical': FKA Twigs showcases her incredible flexibility in thigh-skimming grey shorts while sharing her 'pole fitness journey' As Beyonce announces her twin pregnancy, experts reveal why so many stars have multiple births (and how it sets a dangerous example) Stars come out for Ed Sheeran as celebrities flock to 'secret' concert and share their joy at seeing musician at the Opera House Jorgie Porter beams while filming Celebs Go Dating with hunky sales exec... after revealing she makes suitors wait SEVEN dates before taking them to bed 'What a wonderful mum you are!' Katie Price's fans shower her with praise as she spends all night awake with disabled son Harvey in hospital 'Early night!' Michelle Heaton brushes off THAT bender by sharing a bevy of wholesome snaps... as she swaps cocktails for juice after boozy vomit incident Kian Egan shows off well-honed surfing skills before packing on PDA with make-up free wife Jodi Albert on sun-drenched Barbados break Emmerdale actress Amy Walsh announces engagement to boyfriend Bradley Jaden... five years after her popstar sister Kimberley set them up Steam team: Leggy Daisy Lowe and Louise Redknapp slip into matching black swimsuits as they sizzle at the spa with Strictly tour crew EXCLUSIVE: 'I've been craving everything naughty': Binky Felstead reveals pregnancy is going 'well' and she's had NO morning sickness 'Have you seen the size of her tips?' Twitter goes wild after viewers mishear love rat Peter Barlow on Coronation Street Say cheese! This year's Oscar nominees pose together for class photo after gathering for annual luncheon celebrating their achievements Luke who? Newly-single Scarlett Moffatt enjoys a dinner date with showbiz pals Ant and Dec days after confirming split from long-term love Sweethearts Gigi Hadid and Zayn Malik share candid snap as they cuddle in bed together Looked like any other couple in the sweet pic 'I don't know if I'll be back next week': Sir Bradley Wiggins may be forced to quit The Jump after tearing his calf muscle during his first race Blooming lovely! Pregnant Natalie Portman shows off her blossoming baby bump in chic black dress as she attends Oscar Nominees luncheon Charlotte McKinney shares a hug with comedian pal Jeff Ross as they join a host of stars cheering on the LA Lakers at basketball game Jessica Chastain cuddles up to hunky boyfriend Gian Luca Passi de Preposulo as they sit courtside at a basketball game Avid Knicks fan PICTURE EXCLUSIVE: Gaga swaps zany costumes for bra-free tee as she jets out of Houston after scoring second most watched Super Bowl show ever Apple Tree Yard viewers are outraged as Yvonne is brought to tears by lawyers over her brutal sex assault - before jury delivers its verdict in murder trial Nothing's going to rain-bow on her parade! Victoria Beckham refuses to hide in the shadows as she uses storm against husband to flaunt her fashion line From a hippy henna artist to a transgender beauty queen: The hopefuls vying to be crowned Britain's Next Top Model 2017 'I didn't even weigh this much when I had Madison': TOWIE star Chloe Sims says she's lacking body confidence as she's 'bigger now than she's ever been' 'I'm just trying to get sex on a regular basis': Former Pussycat Doll Melody Thornton reveals her racy reason behind joining Celebs Go Dating Looks of an angel! Heidi Klum shows off her incredible physique in photoshoot for own lingerie label One of the world's most beautiful women Britney Spears asks for 'prayers' for niece Maddie who got trapped for several minutes underwater despite Jamie Lynn's desperate attempts to free her Zoe Ball sports a broad smile as she joins new boyfriend Billy Yates for cosy pub lunch in London Split with Norman Cook in September 'A packet of honey roast ham has more depth than her!': Corrie viewers mock Rosie Webster's return as Twitter sparks debate over Helen's Flanagan's acting A manipulative mum, her brutish lover and a jury that got it right: CHRISTOPHER STEVENS reviews last night's TV 'She was being a big f***ing diva!' Kate Upton's 'extravagant demands may have cost her a Sports Illustrated cover this year' Girls night! Kim Kardashian rocks all black outfit and beige trench coat as she takes Kourtney to dinner in LA Looking chic Kiss, kiss! Helen Mirren plants a smacker on Morgan Freeman as she presents her Red co-star with Career Achievement Award Natalie Portman, Michelle Williams Emma Stone and Nicole Kidman lead the pack as Oscars nominees gather for annual luncheon PICTURED: Nicolas Cage's son Weston, 26, arrested for DUI after crashing car into tree following police chase Naomie Harris is picture perfect in beige dress at Nominees' Night ahead of the Academy Awards Stunned in a frilly and pleated number 'Our sex life is so hot': Tracy Morgan opens up about his recovery and role playing in the bedroom as he tries for baby number two Got his groove back Yummy mummy! Sharon Stone showcases her feminine form in semi-sheer bandage dress at Movies For Grownups Awards show Debra Messing has a fangirl moment as she snaps a selfie with Oscar winner Octavia Spencer at Makers conference Her little helper! Makeup-free Jennifer Garner gets a hand from son Samuel while fetching groceries in LA Busy mum of three enjoys time with her boy Red-y to go! Bella Thorne models bright leather motorcycle jacket as she strolls in Santa Monica with a female friend 'She is hot right?' Scheana Marie admits kissing Vanderpump Rules co-star Ariana Madix on Bravo's WWHL Wild night out in Las Vegas. 'I might fancy you': Lisa Vanderpump swoons over Tom Sandoval cross-dressing in pink on Vanderpump Rules 'She's Dreamy!' Blac Chyna posts cute video of her adorable little girl with Rob Kardashian laughing on Snapchat Proud mum of two got snap happy on Monday Going hell for leather! Amber Rose rocks chic motorcycle jacket while chilling with boyfriend Val Chmerkovskiy and a pal 'People will never understand': Lauren Goodger shows off her lighter locks as she slams those criticising her relationship with jailbird Joey Morrison CBB star Heidi Montag looks buxom in a white and pink bikini as in her London hotel... while husband Spencer Pratt jokes about returning to LA 20lbs heavier Kristen Stewart takes 'girlfriend' Stella Maxwell on a shopping spree in New York You can't buy love. But you certainly can treat your loved one Just popping out! Amanda Seyfried displays pregnancy bump in hooded top as she walks the dog with fiance Thomas Sadoski Revealed: How Lady Gaga faked her jump from stadium roof and tricked TV audience into thinking she plummeted 260ft for Super Bowl show Ruth Negga stuns in heart patterned gown as she accepts best picture award for Loving at AARP Movies for Grownups event The Help reunion! Emma Stone poses with castmates from 2011 film Viola Davis and Octavia Spencer at Oscars luncheon . Heidi Klum looks gorgeous in a puffy winter jacket as she touches down in LA Looked like she had just got off the runway Sparkling in silver! Lion star Nicole Kidman stuns in metallic belted Chanel dress as she steps out for the Oscar Nominees Luncheon She's going to Roar! Katy Perry confirms she'll perform at Grammys... joining Adele and Beyonce for music's biggest night Wardrobe change! Rihanna wears huge camouflage jacket then changes into bizarre red coat as she heads to music video shoot in NYC Eva Longoria and Olivia Culpo go braless beneath their Rachel Zoe pantsuits at FW/17 presentation Suited up at Sunset Tower Hotel Flapper girl! Nicole Richie showcases model thin figure in silver tasseled dress as she supports pal Rachel Zoe at fashion show She's a big teaser! Fergie flaunts flamboyantly floppy fringe as she turns heads in all-leather outfit at airport Making a statement 'I feel terrified': Nick Viall worries about finding love on The Bachelor after sending six more women home Veteran tearfully said goodbye to three women Elisabeth Moss sports painful-looking forehead gash on the Toronto set of The Handmaid's Tale Likely all for the cameras as she filmed 'The Game' who infamously claimed he slept with all three Kardashian sisters, is sentenced to three years probation for threatening to kill an off-duty LAPD officer Real Housewives star Joe Giudice lands job in prison gym earning $100 a month while serving 41-month sentence on fraud charges 'We are not missing out': Jinger Duggar and Jeremy Vuolo enjoy pre-wedding parties on Counting On Joint bachelor and bachelorette weekend 'Coldplay wanted lobster and didn't even eat it!' Sunrise name the artists with the most OUTRAGEOUS concert riders... as Ed Sheeran asks for just soft drink, honey and fruit Perrie Edwards vamps up in a racy black corset for smouldering snap... after confirming relationship with Alex Oxlade Chamberlain with romantic kiss photo 'I'm an old-school guy who doesn't want my private life out there': Vin Diesel wants to maintain 'a sense of mystery' with 100 million Facebook fans PICTURE EXCLUSIVE: Michelle Heaton's drinking session during New Zealand tour ends in tears as she VOMITS on the street... while bandmates watch From boardroom to Baywatch? Apprentice star Jessica Cunningham flaunts her pert behind in VERY high-cut red swimsuit after CBB stint 'I'm looking to keep my skin as young as it can be': As Nicole Kidman opens up on her beauty routine, FEMAIL revisits the star's most memorable looks Balancing act! Kim Kardashian works out with Kourtney... as she details book club with Chrissy Teigen and plugs her products on social media SPOILER ALERT: Ex On The Beach's Zaralena and Zahida come to blows over Aaron... as a cheating ex arrives to shake things up in the villa Bronzed bombshell! Justin Bieber's 'former fling' Sahara Ray flashes underboob and flat tummy in a VERY skimpy top and matching hot pants 'You're a PHONEY!' Kim Woodburn threatens to 'crucify biased' Phillip Schofield and brands her CBB housemates 'nasty pigs' in heated interview Rochelle Humes leads the way with fellow mum-to-be Amy Childs and glam Ola Jordan as the official National Television Awards portraits are unveiled Gigi Hadid comes under fire on Instagram after her sister Bella posted a candid clip of the model squinting her eyes to imitate the Buddha David Beckham puts on a brave face as he resurfaces in sportswear to pick up shakes in London following his leaked email shame 'I've lost 65lbs!' Southern Charm's Jennifer Snowden shows off dramatic weight loss four months after birth of her son Ascher 'Some people think I'm mad': Kris Marshall reveals the reason why he's leaving Death In Paradise as he admits friends urged him not to 'quit a hit' 'He can afford the hit': Tom Hardy's 'firm loses £2million in 12 months... as the actor's finances take another hit after his BBC series Taboo fails to break even' PICTURE EXCLUSIVE: Alicia Vikander springs into action with a series of slick stunts as she's seen for the first time as Lara Croft on the set of Tomb Raider reboot 'I haven't lost any weight yet!': Pink reveals six weeks after welcoming son she's still the same size so she's hitting the gym with a trainer 'It might be a lot of pressure for her': Cindy Crawford reveals worries about her daughter Kaia Gerber, 15, entering the modelling world SPOILER ALERT: In trouble already? Coronation Street's comeback queen Rosie Webster lets her bad reputation rub off on little sister Sophie 'Josh loves my new bigger boobs!': Pregnant Binky Felstead talks about feeling sexy while expecting as she hints at romance with baby daddy JP Supermodel Karlie Kloss says she beats jetlag by working out... and reveals her favourite chocolate is gluten-free The Night Manager's Elizabeth Debicki concedes that co-star Tom Hiddleston is 'basically perfect'... as she admits she DIDN'T watch Broadchurch Coleen Nolan says she hasn't spoken to husband Ray since CBB win... as she reveals suspected HEART ATTACK after 32 days of drinking Animal attraction! Vanessa Hudgens wears leopard print coat as she steps out for coffee in LA Pretty in pink! Kate Bosworth looks lovely in winter sweater as she visits vegan hot spot in West Hollywood Newly-engaged Pixie Lott looks chic in a white fringed coat and sexy slashed leather trousers as she steps out for dinner in London Jessica Simpson's dad Joe has cameo on Vanderpump Rules... and the 'Two Toms' freak out about it ",
                              "label": 0,
                              "dataset": "grafn",
                              "distance": 0.5812259138192728
                        },
                        {
                              "text": "Print Claire Coffee, who plays the witchy Adalind on the fantasy TV drama “Grimm,” has been managing migraine symptoms since childhood. Now she shares how she reduces their frequency... On the TV show “Grimm,” Claire Coffee’s character is a sorceress whose outer beauty is frequently uglified by her inner darkness. In real life, she’s also occasionally taken over by something unpleasant: painful migraine symptoms. Coffee, 36, openly shares the fact that she suffers from the severe headaches. She even joked on Twitter that her character’s nasty disposition could be caused by migraine pain. “If only Adalind had [an eletriptan],” said @ClaireCoffee in an Oct. 14, 2014, post, referring to a prescription migraine medication. The actress is one of 36 million Americans who suffer from migraines, according to the Migraine Research Foundation, a nonprofit that funds research into the condition. Not only do more women – 27 million – have migraines, they also have them more often than men. Migraine symptoms frequently last longer in women too, the MRF reports. In addition to debilitating pain, migraines symptoms include: Aura (visual disturbances) Sensitivity to sound and light Dizziness Nausea Potential triggers include certain foods – chocolate, for example – or skipping meals, alcohol, bright lights, loud noises, strong odors, caffeine, stress and hormonal changes. For some women, pregnancy makes migraines worse. Not for Coffee. In fact, she found relief from her condition when she was pregnant with her son Calvin. (Coffee and husband musician Chris Thile of the Punch Brothers and Nickel Creek announced the birth of their son in May 2015.) In this exclusive Lifescript interview, Coffee talks about her lifelong journey to manage migraines. When were you first diagnosed with migraines? I’ve experienced migraines since elementary school, around 3rd or 4th grade. As a teenager, they became especially bad, which I attributed to hormones and puberty. [But] I saw a couple of neurologists before I was diagnosed with migraines. [ Editor’s note: Migraines can be harder to diagnose in children because their symptoms may differ from those of adults, according to the National Institutes of Health. Kids can have migraine pain on both sides of their head; adults usually have it only on one side. Sometimes, a child’s only symptom is vomiting.] Did other members of your family have them? My dad has always had migraines too. I know there’s some evidence that migraine headaches run in families. What triggers your migraines? I’ve also found that stress, changes in my sleep patterns, eating too many sweets and going for more than four hours without eating food can all trigger migraines. What have you found helps you to manage your migraines? I take [eletriptan], a prescription medication that blocks migraine headaches in progress. [ Editor’s note: Triptan medications help ease migraine symptoms by acting on chemical receptors and constricting blood vessels in the brain.] I also started doing acupuncture the last several years and have found it really helps a lot. [ Editor’s note: Migraine patients who underwent acupuncture had less intense migraines and fewer episodes per month, according to a 2012 study published in the Canadian Medical Association Journal.] I used to get 4 to 6 migraines a month, but I’ve learned to manage them pretty well. I typically only get one migraine a month now. Have you tried other natural treatments? I have an herbalist who has blended together a mixture of herbs, such as butterbur, [along with] peppermint oil, that help with my migraines. [ Editor’s note: There’s some evidence that butterbur extract may reduce the frequency of migraines, but not much research has been done, according to the Migraine Trust, a British health and research charity that supports people with migraines. Menthol, the active ingredient of peppermint oil, was effective at helping stop migraine pain and easing nausea when applied to the forehead and temples, according to a 2010 study published in the International Journal of Clinical Practice.] Did being pregnant make your migraines worse? I was really worried about what effect my pregnancy would have on my migraines. I had heard some women say they were more prone to migraines during their pregnancy. But I actually had a reduction in the number of migraine headaches that I experienced. I had a few flare-ups, but chose to manage them naturally through exercise or using a cold compress. See Pregnancy and Migraine Headaches: What Women Need to Know Did you make any dietary changes after you were diagnosed with migraines? I did a food-elimination diet to see if certain foods were triggering my migraines . But after eliminating foods and then adding them back in, I found the only trigger for me was sugar. Eating too much sugar can cause me to have a migraine, and so can low blood sugar caused by skipping meals. I’m a big snacker, so I try to snack on lean proteins and vegetables that keep my [blood] glucose levels steady in between meals. When I’m on set, I might snack on yogurt or nuts, and then have a salad with lean meats such as fish or chicken for lunch. How do you handle the stress of performing? “Grimm” is filmed in Portland, Ore., and I love hiking on the beautiful trails with my husband. Just being outdoors really calms me, and hiking – or even walking – is a great form of exercise. If I’m indoors, I’ve learned that deep breathing is one of the best ways to lower stress in the body. On your blog , Full Disclothesure, you write about health and beauty advice you’ve acquired during your career. What tips can you share? I was lucky in that I had a great pregnancy – with no morning sickness or heartburn. But the one thing I had was a red, blotchy skin rash. My pregnancy hormones had made my skin incredibly sensitive to dryness. Any amount of parched air sent it into a fit of rage, and my [usual] coconut oil regimen just wasn't replenishing the moisture loss. I knew that a lot of active skin care ingredients are off-limits to pregnant women – and I tend to be a natural skin-care junkie. So I began working with my skin-care guru to find products that would prevent moisture loss while also creating a barrier from the elements. While this solution might not work for everyone, I found that rinsing in the morning with an essential cleansing oil, followed by a serum containing hyaluronic acid and vitamin B5 – and a few drops of pure Jojoba oil – really helped. In the evening, I repeated this, but also added a daily moisturizer. For more information and expert advice, visit Lifescript’s Migraine Health Center . How Much Do You Know About Migraine Headaches? In the U.S. alone, 35 million people suffer from migraine headaches, and the condition is three times more common in women than in men. However, surveys show that fewer than half of sufferers have received a diagnosis from their health-care providers. Do you or someone you know get migraine headaches? Test your knowledge with our migraine quiz . Connect   The information contained on www.lifescript.com (the \"Site\") is provided for informational purposes only and is not meant to substitute for advice from your doctor or health-care professional. This information should not be used for diagnosing or treating a health problem or disease, or prescribing any medication. Always seek the advice of a qualified health-care professional regarding any medical condition. Information and statements provided by the site about dietary supplements have not been evaluated by the Food and Drug Administration and are not intended to diagnose, treat, cure, or prevent any disease. Lifescript does not recommend or endorse any specific tests, physicians, third-party products, procedures, opinions, or other information mentioned on the Site. Reliance on any information provided by Lifescript is solely at your own risk. Rate This Article",
                              "label": 0,
                              "dataset": "grafn",
                              "distance": 0.5812259138192728
                        },
                        {
                              "text": "Developer Antony Gough promises October opening for The Terrace LIZ MCDONALD Last updated 19:36, February 23 2017 IAIN MCGREGOR/FAIRFAX NZ \nBuilding activity is back under way at The Terrace. \nConstruction of Christchurch's The Terrace development is at full tilt again, and owner Antony Gough says this time there will be no stopping him. \nGough began building his $140 million hospitality and office precinct in 2013, but stopped and restarted several times over funding and leasing troubles. \nTwo cranes and construction workers are now on the site and Gough said the central city precinct would open in spring. JOSEPH JOHNSON/FAIRFAX NZ \nThere was a long construction hiatus at The Terrace in 2015. \n\"We've got enough leases signed, we've got bank funding in place and it's all go,\" he said. \"I expect to be enjoying a beer there in October.\" READ MORE: * Westpac pulls back on commitment to Gough development \nThe double-storey riverfront hospitality precinct was almost fully leased with 12 out of 14 premises taken, he said. Tenants in the three large ground floor premises facing Oxford Tce will be Richard Sinke, owner of Dux Central, and Tony Astle's Stealth Hospitality Group, plus restaurant Bangalore Polo Club. \nAstle said he was looking forward to getting in and the precinct would be \"wonderful\". KIRK HARGREAVES/FAIRFAX NZ \nAntony Gough is confident The Terrace development will be ready to open in spring. \nUpstairs and facing interior laneways will be Japanese restaurant Zenbu, two Cook Brothers hospitality businesses, a restaurant from the operators of Queenstown restaurant Bungalow, and a new business from former Coyote owner Clive Weston. Velvet Burger, a juice bar and coffee outlets will open on the Hereford St side of the development. \nThe buildings will be linked by laneways and first-floor air bridges, while balconies will overlook the river and internal spaces. Hospitality tenants will start fitting out their premises in June or July. \nA five-storey office building on Hereford St will also be finished by October, while the six-storey office building on the corner of Oxford Tce and Cashel St would be finished in December for tenants Westpac and KPMG to move in by March, Gough said. \nAn artist's impression of The Terrace precinct facing Oxford Tce between Cashel and Hereford streets, in Christchurch. \nNext year, a car parking building will be added on Hereford St next to the neighbouring BNZ Centre. Ad Feedback \nGough said when Westpac reduced the space it wanted it \"threw us into a bit of a tizz\", but KPMG had filled the gap, satisfying the bank's lending department. Other tenants had also been holding back. \nBNZ is funding the development's hospitality buildings and the Hereford St office building. Gough and other members of the family, including his older brothers Tracy and Harcourt, have put about $70m into the project. \nAn impression of the finished Westpac building and courtyard at The Terrace development. \nGough said meeting the banks' lending requirements had proven tough. \n\"They are overly cautious, but they can afford to be. But once the banks start paying money out on a project like this, they see it through to the end.\" \nThe upcoming openings of the justice and emergency services precinct and the Ngai Tahu office buildings nearby had boosted tenants' confidence, he said. Progress on car parking buildings had also helped. \n\"We are seeing all these developments finish and I can't wait for that parking to open.\" \nSLOW PROGRESS \n2011: Antony Gough hopes to repair and reopen The Strip. \nMarch 2013: Joins forces with brother Tracy to announce a replacement called The Terrace. \nSept 2013: Gough goes it alone and starts construction with a late-2014 finish forecast. Gerry Brownlee hails Gough as the CBD's greatest champion. \nApril 2014: Construction stops as bankers demand more equity. \nJuly 2015: Work re-starts with Gough brothers Harcourt and Tracy as co-investors. \nDecember 2015: Tenant Westpac reduces space requirement, construction stops. \nFebruary 2016: Finish date revised to February 2017. \nSeptember 2016: KPMG signs on as tenant. \nDecember 2016: Bankers approve loans based on tenant commitments. \nFebruary 2017: Two cranes and construction workers busy on site. Gough announces an October opening. - Stuff",
                              "label": 0,
                              "dataset": "grafn",
                              "distance": 0.5812259138192728
                        }
                  ]
            },
            "title": "coffee reduces COVID-19",
            "body": "coffee reduces COVID-19",
            "time": "2022-11-26T19:56:43.933165"
      },
      {
            "cls": {
                  "result": 1,
                  "result_proba": [
                        0.2518564541768997,
                        0.7481435458231003
                  ],
                  "domain": 0,
                  "domain_proba": [
                        0.9644771679463011,
                        0.03372513251627816,
                        2.4219484428309874e-10,
                        2.238935180398343e-05,
                        9.547870679009017e-06,
                        0.0017657620727431012
                  ],
                  "similar_articles": [
                        {
                              "text": "Italy “went against the WHO's ‘law’” against COVID-19 autopsies and “discovered covid is not a virus, but a bacterium” that “clots the blood and reduces the oxygen saturation.”",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.44253023284651083
                        },
                        {
                              "text": "Italy “went against the WHO’s ‘law’” against COVID-19 autopsies and “discovered covid is not a virus, but a bacterium” that “clots the blood and reduces the oxygen saturation.”",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.44253023284651083
                        },
                        {
                              "text": "Prolonged use of face masks reduces the circulation of oxygen in the blood and can lead to death.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.44253023284651083
                        },
                        {
                              "text": "Israelâ€™s ambassador in Colombia says there is already an antibody that neutralizes COVID-19 and reduces the contagion index.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.44253023284651083
                        },
                        {
                              "text": "Physical exercise reduces the infection risk by 50%.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.44253023284651083
                        },
                        {
                              "text": "The measles-mumps-rubella vaccine reduces the severity of COVID-19.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.44253023284651083
                        },
                        {
                              "text": "Some food with low pH reduces the coronavirus.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.44253023284651083
                        },
                        {
                              "text": "Gargling with Betadine kills germs or reduces their numbers in the throat before they go down to the lungs, and a statement by Eleni Jamarely, professor of infectious diseases, claims that HIV is transmitted more easily from the new coronavirus through the spoon at communion.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.44253023284651083
                        },
                        {
                              "text": "By Robert Preidt HealthDay Reporter THURSDAY, April 9, 2020 (HealthDay News) -- Doctors at the University of Alabama at Birmingham (UAB) are enrolling patients in an international clinical trial to find out if inhaled nitric oxide benefits those with COVID-19 who have severely damaged lungs. Right now, there are no approved treatments for the illness caused by the new coronavirus. A severe form of lung failure called acute respiratory distress syndrome is the leading cause of death in COVID-19. When lungs are failing, air is received by some parts of them but not others. Nitric oxide is a gas that improves blood flow in areas of the lungs that are getting air, increasing the amount of oxygen in the blood stream. Nitric oxide also reduces the workload of the right side of the heart, which is under extreme stress during lung failure. Along with being used to treat failing lungs, nitric oxide has been found to have antiviral properties against coronaviruses. That was shown during the 2002-2003 SARS outbreak, which was caused by a coronavirus similar to the one that causes COVID-19. Any COVID-19 patient in UAB's intensive care unit who is using a ventilator to breathe may qualify for the study. \"This trial will allow the sickest COVID-19 patients at UAB access to a rescue therapy that may have antiviral benefits in addition to improving the status of lungs,\" Dr. Vibhu Parcha said in a university news release. He's a research fellow in the Division of Cardiovascular Disease. \"In humans, nitric oxide is generated within the blood vessels and regulates blood pressure, and prevents the formation of clots and also destroys potential toxins,\" said Dr. Pankaj Arora, an assistant professor of cardiovascular disease. His team plans to study the cardiovascular effects of high-dose inhaled nitric oxide as part of the primary clinical trial.",
                              "label": 0,
                              "dataset": "mmcovid_en",
                              "distance": 0.44253023284651083
                        },
                        {
                              "text": "Coronavirus: Is Your Workforce At Risk? February 19, 2020 • By Rebecca Batisto Employee Risks If you watch or listen to the news, then you’ve heard about coronavirus, the new viral (both figuratively and literally) outbreak in China, that’s spreading worldwide. There are a lot of misconceptions about the virus, including a meme that’s currently circulating throughout social media that says, “Before you start popping that bubble wrap, that air came from China.” But, the virus is spreading and causing companies to shut down offices in China. So, as an employer or an insurance agent, you may be concerned about the risks to employees. We, at Normandy Insurance, are staying on top of the story as it unfolds, and here’s a synopsis of the things you need to know thus far. What Is Coronavirus? The 2019 Novel Coronavirus (officially “COVID-19”) is a respiratory virus first identified in Wuhan, Hubei Province, China. It is part of a large family of coronaviruses, of which SARS is an infamous member. COVID-19 likely was initially contracted from an animal and is now being spread person-to-person. It produces symptoms of mild to severe respiratory illness with fever, cough, and difficulty breathing. The spread from person-to-person occurs in close contact via respiratory droplets produced when an infected person coughs or sneezes, according to the CDC’s website. These droplets can land on others and be ingested or inhaled, or land on surfaces where people touch and then touch their mouth, nose, or eyes. There have been several documented cases in the U.S. in the last few weeks, and the U.S. is taking aggressive actions to stem the spread of COVID-19 in this country, including the use of quarantine measures as appropriate. Travel bans are currently in place, with some airlines voluntarily canceling flights in a proactive move to halt the spread of the coronavirus and protect airline employees and passengers from exposure. Cruise ships with confirmed cases of the virus are currently under quarantine, some of them for upwards of two weeks. Yet shipments from China continue to our shores via shipping containers and air transport. Should that be a concern? What About Products Shipped From China? While researchers are continuing to study how 2019-nCoV is spread, they are using two other coronaviruses (MERS and SARS) as guidelines. In general, COVID-19 does not survive long on surfaces, and so there is a low risk of spread from products or packaging, according to the CDC. Further, the extended time, plus temperatures of shipments, again reduces the likelihood of spread. To date, there are no cases associated with imported goods or packaging from China or anywhere else in the world. Shipments of animals and food undergo more rigorous testing, and again, no cases have been reported to date. The entire world is closely monitoring the COVID-19 spread since China is such an economic powerhouse with exports across the globe. What Precautions Should You Take? Because of the travel bans imposed by many countries, travel to China is not advised. Thankfully communication technology allows us to communicate effectively without needing to board a plane. Chinese citizens understand the severity and seriousness of the outbreak and its impact on travel and business during this time, so it’s unlikely your employees will be pressured to head to the airport. Employees returning from China may be subject to monitoring or quarantine, depending on where they visited. If any employee returns from China and shows any flu-like symptoms, they should go to the hospital at once. Employees who handle products imported from China should be educated about COVID-19 and how it is spread, including the fact that it is not believed to be able to survive on a surface through transport. Your insurance provider may offer an expert to come and speak to your workforce if you deem this necessary. If you are a Normandy customer with concerns, contact us to discuss risks and options: call 866-688-6442 What’s Next? Based on the similar coronavirus outbreaks of MERS and SARS, it is hoped that researchers and health professionals will soon be able to curtail the spread of the deadly COVID-19. The on-going risk will depend upon what is learned about the characteristics of the virus, including how exactly it spreads, and available measures to treat the virus. What is known so far is that the risk of infection is related to exposure; therefore, most of the U.S. public is unlikely to be exposed to the virus. The CDC considers the health risk to be low for Americans at this time. That said, the federal government is closely monitoring this pandemic and is urging people to visit the CDC’s website for the latest information regarding COVID-19. If you have questions about how this coronavirus could impact your workforce, please contact us. Normandy prides itself on staying up to speed with the latest issues impacting your workforce safety. Share",
                              "label": 1,
                              "dataset": "mmcovid_en",
                              "distance": 0.44253023284651083
                        }
                  ]
            },
            "title": "coffee reduces COVID-19",
            "body": "coffee reduces COVID-19",
            "time": "2022-11-26T20:00:50.574917"
      },
      {
            "cls": {
                  "result": 1,
                  "result_proba": [
                        0.004410850471962102,
                        0.9955891495280379
                  ],
                  "domain": 1,
                  "domain_proba": [
                        0.13402052835453604,
                        0.812941263086098,
                        2.952030088952453e-09,
                        0.0013494133134089562,
                        0.02091381388812936,
                        0.030774978405797425
                  ],
                  "similar_articles": [
                        {
                              "text": "Coffee cures the coronavirus.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.10555991063575498
                        },
                        {
                              "text": "A message claims that ingredients in coffee can cure COVID-19 and that the deceased whistleblower Li Wenliang found its cure",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.10555991063575498
                        },
                        {
                              "text": "Drinking coffee can be beneficial against the coronavirus.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.10555991063575498
                        },
                        {
                              "text": "A WhatsApp chain claims that drinking coffee helps fight the coronavirus because it contains the compounds Methylxanthine, Theobromine and Theophylline.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.10555991063575498
                        },
                        {
                              "text": "Coffee cures coronavirus disease.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.10555991063575498
                        },
                        {
                              "text": "Coffee can cure COVID-19.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.10555991063575498
                        },
                        {
                              "text": "Drinking coffee â€œdecreases the voracityâ€\u009d of the coronavirus",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.10555991063575498
                        },
                        {
                              "text": "Drinking coffee â€œdecreases the voracityâ€\u009d of the coronavirus.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.10555991063575498
                        },
                        {
                              "text": "Coffee cures coronavirus.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.10555991063575498
                        },
                        {
                              "text": "Drinking three cups of tea or coffee a day does cures COVID-19.",
                              "label": 1,
                              "dataset": "covid_fake_news",
                              "distance": 0.10555991063575498
                        }
                  ]
            },
            "title": "coffee and covid-19",
            "body": "coffee and covid-19",
            "time": "2022-11-26T20:02:22.457670"
      }
]