[
      {
            "cls": {
                  "result": 1,
                  "result_proba": [
                        0.43460816302445426,
                        0.5653918369755457
                  ],
                  "domain": 2,
                  "domain_proba": [
                        2.228899353313571e-08,
                        0.0004886328961499017,
                        0.996938488253848,
                        0.0007114540368510457,
                        0.0015173647705321164,
                        0.0003440377536253873
                  ],
                  "similar_articles": [
                        {
                              "text": "Here are the e-mails released last night that confirm what we all knew from way back Hillary is a total elitist who has everyone do just about EVERYTHING for her. It s really pitiful that we had a Secretary of State who behaves this way. In addition, Hillary is clearly vindictive and petty. In some of the e-mails she discusses taking down Supreme Court Justice Clarence Thomas: STILL WAITING FOR THE YOGA E-MAILS Here you go: HILLARY S E-MAILS Here s another great source from the WSJ",
                              "label": 1,
                              "distance": 1.1346355676651
                        },
                        {
                              "text": "1/18/2016, 12:59 am Fareed Zakaria can dish it out but can't take it CNN host Fareed Zakaria is now calling to censor social media because he was offended by The People's Cube satire about his writings. Without mentioning that our satire was a hyperbolic buildup on his own recent writings, Zakaria cries for government protection of his hurt feelings, making it clear that he can dish it out but can't take it. Taste your own medicine, Fareed.\"Progressives\" have trolled, ridiculed, satirized, maligned, insulted, bullied, and lied about conservatives since the inception of the Internet. But once they see the signs of oncoming traffic, they cry and run to mommy - or to the nanny state in this case - asking to make it a one-way street once again, where only they can ride their tricycles, wear funny hats, and fling poop at those whom they consider inferiors. Watch Fareed Zakaria on camera wiping his face from the poop flung at him. An open letter to Fareed Zakaria from The People's Cube ~ Dear Fareed,There have been studies showing that a foreign-born author's unique perspective can help the natives to boost their own creative thinking through the so-called \"schema violation,\" which occurs when our world is turned upside-down. You may argue that your \"otherness\" benefits and enlightens this country, with an implication that those unwilling to be enlightened by you are bigots who resent your \"otherness\" and won't have their old schema to be violated by a newcomer. Like you, I am a foreign-born author whose English is a second, or, rather, a third language; I know what it feels to be \"the other.\" I also like to help the natives to boost their creative thinking by turning their reality upside-down and sending their temporal and spatial cues off-kilter (my website, The People's Cube , is one such big schema violation). I don't resent anyone's \"otherness\" as long as they don't attempt to make me comply to theirs. In sum, I am not concerned with your ethnic or cultural \"otherness.\" It is your ideological \"otherness\" that bothers me, which makes you indistinguishable from the next run-of-the-mill, native-born \"progressive.\"Now that we got the implication of bigotry out of the way, let's get down to business.On January 2, one of our contributors posted a satirical response to your Washington Post article where you apparently gloated over the premature deaths of white males in America. Our author took your argument to its logical conclusion, adding the need to exterminate white females as well - through Jihad, rape, and sex slavery as recently seen in Europe and elsewhere. This parody wasn't meant to be taken as factual reporting, given the context of our website and especially considering the author's credentials at the top: Chedoh, Kommissar of Viral Infections, Hero of Change, Prophet of the Future Truth.On January 14, you responded to our satire in your Washington Post article titled, Bile, venom and lies: How I was trolled on the Internet , and today you started your show on CNN with a segment titled, Fareed's Take: I was the target of Internet trolling , in which you were mostly reading your earlier article from the teleprompter. Among other things you claimed that our story \"was cleverly written to provide conspiracy theorists with enough ammunition to ignore evidence\" and complained that some people took our \"reporting\" seriously and reposted it in social media with impolite comments, all of which led you to conclude that someone must create a mechanism in social media \"to distinguish between fact and falsehood.\" And since that someone can only be the government, your statement can only be understood as a vague call for the government censorship of the Internet.However, neither your article, nor the CNN segment mentioned that our grotesque fiction was based on your own controversial ideas that many Americans found insulting and grotesque. Why? Was it because such an admission would have undermined your argument that people were angry at you over nothing? And why in the world, Fareed, did you decide to bring up the term \"radicalization,\" which in today's world is mostly associated with Islam? Do you have such a tin ear - or do you really think that if you broaden the definition and talk about \"American radicalization,\" people will begin to see the two as morally equivalent? Do you think they are morally equivalent, Fareed?Fine, let's talk about radicalization.For you, sitting on the top floors of your well-protected media establishment's ivory tower, it's easy to downplay the threat of Islamic radicalization and throw the \"Islamophobia\" labels at all those little people down at the street level. The only radicalization to which your skewed radar is attuned is the faintest sound of protest from the little people, when they get fed up with your condescending elitism and begin to rebel against the \"progressive\" establishment. That's what scares you the most, doesn't it, Fareed? That's when you mouth off your grave concerns on CNN and write in WaPo about the threat of radicalization. But who is at fault that Americans no longer trust the establishment and its media? Have you considered the possibility that none of this would be happening if you and your colleagues weren't so radical yourselves, feeding the people with half-truths, distortions, propaganda, and outright lies, placing your Utopian \"progressive\" ideology above facts, smug and secure in your impenetrable media castle? Did it occur to you that you and your media establishment may be the very reason why so many people suddenly like Donald Trump, whom you so despise , and nothing you say on the subject can change their minds because no one trusts you anymore?When you talked about a study where \"simply by talking to one another, the bigoted students had become more bigoted,\" has it even occurred to you how perfectly this describes your \"progressive\" echo chamber, where tolerance towards opposing philosophical viewpoints is nonexistent? If you think that calling those who disagree with you \"bigots\" makes you an anti-bigot, let me share a little secret. There are two kinds of bigots today: the bigots and the anti-bigots, and it's hard to say which kind is worse. A good example of \"group polarization\" involving radical \"anti-bigots\" is JournoList - a highly biased group of about 400 left-wing journalists and political activists who for three years (2007-2010) participated in a private online echo chamber where they, in violation of public trust and professional ethics, conspired to coordinate media attacks on conservatives, to promote certain issues while burying others, and to influence the 2008 elections in favor of Barack Obama. To paraphrase Kolbert's study, \"Simply by talking to one another, the radical left-wing journalists had become more radical left-wing journalists.\" To use your exact quote, \"It is how radicalization happens and extremism spreads.\" Say, were you just as worried about \"group polarization\" then as you are now?Another example of such \"group polarization\" and radicalization is a knee-jerk impulse of allegedly mainstream journalists to describe anyone who doesn't lean left as \"far-right,\" as you have demonstrated in your CNN segment, or \"ultra-right-wing,\" as you have demonstrated in your segment.Isn't it a little too late to complain about America's radicalization, Fareed? Where were you during the George W. Bush years, when your fellow \"progressives\" trolled, ridiculed, and slandered the U.S. President and his supporters, with full support of the mainstream media? When there no longer was any distinction between a drug-fueled street protester and a media commentator? Did you complain when \"progressive\" satirists collectively created a false, hyperbolic reality around Bush, conservatives, Fox News, and America in general, which was then regularly disseminated as the truth around the world, translated into many languages, and contributing to the anti-American sentiment? Some of my own family members in Russia and Ukraine still honestly believe that those \"facts\" really happened. As you so eloquently stated,\" the people spreading this story were not interested in the facts; they were interested in feeding prejudice.\" Did you complain then, or did it feel too good to let go?You refer to a scientific study of Facebook users, which found that \"people mainly shared information that confirmed their prejudices, paying little attention to facts and veracity.\" That sounds reasonable. For example, even without a scientific study I know that an overwhelming majority of your fellow \"progressives\" believe that Sarah Palin has actually said \"I can see Russia from my house,\" paying little attention to the fact that it originated as an SNL skit. Did you complain about that in 2008? Were you at all concerned that Tina Fey's \"Palin\" videos might confuse voters and skew the election? Probably not; it was just satirical hyperbole, right?What if social media encourage misinformation, rumors, and lies, you ask. But did you ask the same question when misinformation, rumors, and lies were coming not from social media but from a seasoned mainstream journalist named Dan Rather - or, more recently, The Rolling Stone Magazine? Or, worse yet, from the nation's political leaders whom you support and admire? Wasn't the entire debate on and implementation of ObamaCare based on misinformation and lies? Were you alarmed when Joe Biden told a black audience that the Republicans would put them back in chains? Did you speak against radicalization when the \"hands up don't shoot\" movement, based on misinformation, rumors, and lies, and encouraged by the mainstream media, resulted in looting and the destruction of property, followed by the murders of innocent police officers?The answer to all those question is \"no.\" You have never violated the \"progressive\" schema, Fareed. You've been a loyal Party soldier, albeit a mediocre creative thinker, having traded your \"otherness\" for conformity and sacrificing your unique perspective to what you thought was \"progress.\"Examples are plenty; more can be provided upon request. Now let's talk about victimhood. You say you are the victim because you have received some hateful messages and comments. I have also received many hateful messages and comments from your fellow \"progressives\" over the years. Now what? You claim you have received a late-night phone call that woke up and threatened your young daughters. Indeed, Fareed, making threatening calls is a crime. Did you file a police report? Did the police trace the number and find the perpetrators, who are hardly a sophisticated organization behind an impenetrable firewall? If not, I can't believe every claim that comes from a confirmed plagiarist . You may as well claim that someone kicked your three-legged puppy and it made you cry.﻿While you played the world's saddest song on the world's smallest violin, I was the one who took the real hit. Snopes.com, a \"fact-checking\" website rooting for the \"progressive\" team, has not only debunked our satire as they've done it many times in the past - this time they also made an unsourced and slanderous allegation that our site is \"known for spreading malware.\"Next, some busybody contacted one of our advertising providers, Content.ad, which then declined to pay our advertising earnings due to \"serious quality issues.\" The money we lost as a result may be small change compared to your CNN contract, but if you were penalized for your writings in the same proportional amount, I'm sure your righteous indignation would go well beyond just one article in WaPo and a five-minute segment on CNN. There is only one victim of lies, prejudice, and institutionalized bias here - and it ain't you, Fareed. But don't let this stop you from playing your upside-down game of \"victims and radicals\" while you still can. So you think your opponents are radicals? Here's a news tip: down here in the streets below you, it's the other way around: growing numbers of Americans see you and your media colleagues as radical ideological hacks. You can call them any name you want, adding ultra-, far-, uber-, and other hyphenated insults; that won't change the fact that their thinking is the norm and yours is not. Like all normal people on this planet, they don't respond well to insults. But they are also the ones who make sure you have the freedom to call them radicals. Oleg AtbashianDepartment of Visual Agitation and Unanimity 1/18/2016, 1:27 am Red Square,I must say, this morning when I heard Fareed refer to TPC as a \"minor news site\" I was terribly offended and had to be hospitalized for a number of hours. Fortunately there was no permanent brain damage or anything so I can resume spewing hate tomorrow morning. (according to my doctor) I look forward to reading your upcoming letter to the sensitive Mr. Zakaria when my health returns in the spring.CC 1/18/2016, 3:12 am Alright, so Zakaria said that it is not obvious that this is a satire page to paraphrase. Yet the Washington Post declared us as \" Arguably one of the Internet's most satirical websites \". And if THAT isn't enough maybe the author, a cheeto dressed as Che Guevara, might have been another dead give away Might have....Really this whole thing reminded me of a clip I've seen from another satirical source... Although it 'may not' be 'clear satire' if we were to use the racist plagiarist Fareed Zakaria's standards. It's not about Zakaria, and the subject matter may be different, but mechanically he did the same thing.... He can use Craptek's Safer-Space ™ Products . 1/18/2016, 10:43 am Kongratulations, Komrade Red Square! Your People's Truth finally penetrated Fareed the Screed's bubble of Bleeding Edge Korrect Truth! Perhaps I can be allowed to suggest to the Cubitburo that you be awarded the title, \"People's Needler\" for that penetration, and also\"Onion of the Soviet Cube\" for having made him cry like a little girl. 1/18/2016, 4:24 pm Sounds like Fareed really, really wants to be on the cover of the next issue of Poor Me. Instead of bringing back Beet of the Week (thanks to Speaker Ryan, it might well be fully funded again since he moved to fully fund pretty much everything else), perhaps we should implement something called Whiner of the Week and make Fareed the first recipient. Fareed had to read the article from a teleprompter because someone else probably wrote it. 1/18/2016, 4:49 pm Commissarka Pinkie Sounds like Fareed really, really wants to be on the cover of the next issue of Poor Me. Instead of bringing back Beet of the Week (thanks to Speaker Ryan, it might well be fully funded again since he moved to fully fund pretty much everything else), perhaps we should implement something called Whiner of the Week and make Fareed the first recipient. Thank you for reminding me! I'll get to making the second issue of Poor Me Magazine right away. Preparing Whiner of the Week award is a bit more complicated, as I foresee a lot of red tape, hurdles, signatures, bribes, and entertainment expenses before it is even included in this Five-Year Plan. In lieu of that, let me use the existing Golden Teabag award and sticker: If he was smarter, he'd just turn the other cheek. But his skin is too thin and his ego too inflated to withstand more than a superficial prick On special request from Commisarka Pinkie: Poor Me Mag #2 | See #1 here .IN THIS ISSUE: · They only don’t trust me because they know me!· Know your rights: dish it out without having to take it EXCLUSIVE:Fareed Zakaria, 52, laments about social media intruders who stole his tiny violin and waterboarded his three-legged puppy I don't want to watch the whole five minute video. Can somebody tell me the minute and second at which he cries? 1/18/2016, 6:17 pm professor joe - The Tears of Fareed™ are the specialty of our Department of Visual Agitation. You won't find 'em anywhere else. Only on the People's Cube, comrade! Only on the People's Cube. This clowns tears look more like that of an entirely different body fluid. Are we sure he's not a bukkake(don't google, you've been warned) enthusiast? Komrade Victor - are you implying that Fareed is \"wee-wee'd up\" (to use a phrase first uttered by The Most High and Mighty Barack H Obama)? My Our Entire Beet Kollecktiv has ( Unanimously! ) voted to send Kameradka Zakaria An Entire Pallet Of Teenage-Girl-Sized Feminine Hygiene Pads . These deliveries will continue until Little Fareed finally matures into a Full-Grown Woman ! Comrades, what if Jeff is Fareed or Fareed is Jeff? Apparatchik Unkulturny My Our Entire Beet Kollecktiv has ( Unanimously! ) voted to send Kameradka Zakaria An Entire Pallet Of Teenage-Girl-Sized Feminine Hygiene Pads . These deliveries will continue until Little Fareed finally matures into a Full-Grown Woman ! iPAD? The whole world is watching. And laughing at you commies tearing each other apart! Pass the popcorn! Commie fight! 1/19/2016, 2:52 am Fareed Zakaria shown above accepting his Proletariat Peabody Award (more commonly known as the HUA Award) from The People's Cube for \"Outstanding Heads-Up Asininity\" in Progressively projecting onto those \"others\" his own heart-felt bigotry in a manner portraying himself as victim -- i.e., as the bigotee rather than the bigotor. Next on his target list is The Onion, Mad Magazine, and other libelously parodic and satirical mockers of well-deserved mockees. Response to 3min mark: Woh! This is a satire website??? So does that mean Laika the space dog is NOT a real reporter??? I just...I just don't know what to believe anymore! 1/19/2016, 9:35 am after a single mention by Rush Limbaugh, the \"Stalinist version of the Onion\" the Peoples Cube was overwhelmed with visits and new members...Given the ratings and the audience of CNN, has there been any spike in viewers to the cube? perhaps we can get someone to stand on a corner and hand out flyers? I can go back to writing the website on the walls of the ladies room stalls... (you meet the nicest people in there)Viva la Clinton News Network!FLOORWARD! 1/19/2016, 3:14 pm Comrade Square, your written response was way beyond masterful, there is however one minor problem. The entire article will have to be reduced to a collection of single syllable words by the CNN editorial staff, so their \"on camera personalities\" may absorb some of the meaning.Concerning the proletariat award, I am sure that any resemblance to the Debby Washerwoman is purely coincidental. 1/20/2016, 12:59 am Comrade Trump has gone beyond an amusing cartoon to the party. Now the gloves must come off for this threat comrades. Books, banners, T-shirts and hats will be burned, neighbors will be shamed in the streets, and any white subversive sympathizer will be reeducated in the Eastern camps at hard labor to appreciate third world values, food and dance. Zero toleration for any leftover capitalist pigs in the USA! The comments on Fareed's article are pretty awesome... On special request from Commisarka Pinkie: Poor Me Mag #2 | See #1 here . IN THIS ISSUE: · They only don’t trust me because they know me! · Know your rights: dish it out without having to take it EXCLUSIVE: Fareed Zakaria, 52, laments about social media intruders who stole his tiny violin and waterboarded his three-legged puppy When did Poor Me become a gay mag?Oh. Never mind. I forgot that the first issue was about a gay man who was upset that he was gay and other people were not. 1/21/2016, 4:48 pm If there is a story in deaf as a Post, there could be something to this.CNN as confident [ this is mean he is a good plagiarist] that any of his text may have come from not copyrighted sources.Will he be Fareed from employment? Probably not, CNN loves originality, even if it is somebody else's. General Confusion Comrade Square, your written response was way beyond masterful , there is however one minor problem. The entire article will have to be reduced to a collection of single syllable words by the CNN editorial staff, so their \"on camera personalities\" may absorb some of the meaning.Concerning the proletariat award, I am sure that any resemblance to the Debby Washerwoman is purely coincidental. Yes! Yes! Yes! Comrade General Confusion!I just have to sit down and take it in. Awesome! So awesome! That is the finest use of English by anyone in the cube, or out including myself!There should be an appropriate award by members, you can head a committee!GC General Confusion Comrade Pamalinsky,That is the finest use of English by anyone in the cube, or out including myself!There should be an appropriate award by members, you can head a committee!GC Thanks, General Confusion, for your kind words. Thing is, I had to dry the tears dripping down my cheeks after reading it. I am so proud to be a Cubist (an art form) Poor Fareed, his skin is so thin that when the wind blows he calls it an extremist racist troll that offends him. 1/21/2016, 10:15 pm Komrade Direktor, how dare you say these hateful words of oppression towards Mr. Zakaria! I know he attacked our Glorious Kube, but he's clearly Muslim or related to Muslims (Judging by the Glorious Muslim name), which makes him a part of the Protekted Peoples of the Kubist Way. That means that you can't attack him. He is rubber, you're glue, whatever you say bounces off of him and sticks on you. Anyways, the Kube is Eternal and Glorious, the attacks of someone like him can't damage it. Where there is Kommunism, there is the Kube, and as long as there is one person alive that is dedicated to the Eternally True Kommunist Way, then the Kube will live on. And Zakaria is actually helping the Kube, he is letting people know of it's existence, and once you have the Kube on your mind it won't go away. I thought I was immune to the Allure of the Kube since 2009 when I started reading it. That was until I decided to become a part of the Revolution and enlist in the People's Kubist Revolutionary Force.Besides, our Glorious Party Organ isn't satire, it's Eternal Current Truth! Laika lives on, she will never die! I get all my news from the Kube, it tells me what to think, since I can't actually think for myself anymore. I used to, but then I was revolutionized by the Kube. Can you say that about such satire websites as MSNBC, Fox News, or indeed CNN, the very organization that Zakaria thinks is credible and reputable? They're as credible as a man saying a stick is actually a brick! Sure, these Organs of the Enemy do tell people what to think since they can't think for themselves, and they CAN revolutionize somebody, but they all believe in \"rights\". Komrade, there is only one right I believe in, and that is the right to work for the state in glorious production! And they also believe in \"ethics\" and \"Honesty\". Well, if that were the case, why are they spreading so many lies about the Kube? And why do they think they have to ask everybody questions that can easily be answered by a simple NSA scan or FBI/DHS/DEA raid? That's what makes our and many other Party Organs so great, we can and do get right to the source WITHOUT the overhead![OFF]Were this a lecture hall, I would have given a standing ovation for the letter to Zakaria. 1/25/2016, 10:22 pm methadras Poor Fareed, his skin is so thin that when the wind blows he calls it an extremist racist troll that offends him. I tend to find the passing wind somewhat offensive. I'm not sure if it's racist though. Likely a climate denier. I'm sure of that! It denies me my comfortable climate! 4/3/2016, 11:37 pm This story is now being discussed in Sweden. I accidentally noticed a popular link leading to the Cube, and clicking on it resulted in a Swedish news portal. Google Chrome offers a more or less readable translation - the style is lost, but the content is quite good. Very well stated. Thanks for being here, Komrade. Quote: let me use the existing Golden Teabag award and sticker The front-page picture really does seem to show an aftermath of tea-bagging. And it has nothing to do with beverages... Not that there is anything wrong with it. Quote: let me use the existing Golden Teabag award and sticker The front-page picture really does seem to show an aftermath of tea-bagging. And it has nothing to do with beverages... Not that there is anything wrong with it. Yeah, mi, it reminds me of the time when Robert Redford announced his retirement (first in a series) in a video, and some commenter said, and I paraphrase, \"Whew, for a minute there I thought I was watching my bulldog's ballsack. Glad to see Redford taking the proverbial hike.\" Users browsing this forum: Ivan the Stakhanovets , MSNbot Media , Yahoo [Bot] and 56 guests Display posts from previous: Powered by phpBB © 2000, 2002, 2005, 2007 phpBB Group The uncontested absurdities of today are the accepted slogans of tomorrow. They come to be accepted by degrees, by precedent, by implication, by erosion, by default, by dint of constant pressure on one side and constant retreat on the other - until the day when they are suddenly declared to be the country's official ideology. ~ Ayn Rand \nRubiks & Rubik’s Cube ® used by special individual permission of Seven Town Ltd. Write down this number and report to your Kommissar at the nearest railroad station. Don't forget warm clothes and a shovel! \nAfraid of \"dangerous\" Trump presidency, protesters pre-emptively burn America down to the ground \nClinton Foundation in foreclosure as foreign donors demand refunds \nHillary Clinton blames YouTube video for unexpected and spontaneous voter uprising that prevented her inevitable move into the White House \nSudden rise in sea levels explained by disproportionately large tears shed by climate scientists in the aftermath of Trump's electoral victory \nFBI director Comey delighted after receiving Nobel Prize for Speed Reading (650,000 emails in one week) \nU.N. deploys troops to American college campuses in order to combat staggeringly low rape rates \nResponding to Trump's surging poll numbers, Obama preemptively pardons himself for treason \nFollowing hurricane Matthew's failure to devastate Florida, activists flock to the Sunshine State and destroy Trump signs manually \nTim Kaine takes credit for interrupting hurricane Matthew while debating weather in Florida \nStudy: Many non-voters still undecided on how they're not going to vote \nThe Evolution of Dissent: on November 8th the nation is to decide whether dissent will stop being racist and become sexist - or it will once again be patriotic as it was for 8 years under George W. Bush \nVenezuela solves starvation problem by making it mandatory to buy food \nBreaking: the Clinton Foundation set to investigate the FBI \nObama ​​captures rare Pokémon ​​while visiting Hiroshima \nMovie news: 'The Big Friendly Giant Government' flops at box office; audiences say \"It's creepy\" \nBarack Obama: \"If I had a son, he'd look like Micah Johnson\" \nWhite House edits Orlando 911 transcript to say shooter pledged allegiance to NRA and Republican Party \nPresident George Washington: 'Redcoats do not represent British Empire; King George promotes a distorted version of British colonialism' \nFollowing Obama's 'Okie-Doke' speech , stock of Okie-Doke soars; NASDAQ: 'Obama best Okie-Doke salesman' \nWeaponized baby formula threatens Planned Parenthood office; ACLU demands federal investigation of Gerber \nExperts: melting Antarctic glacier could cause sale levels to rise up to 80% off select items by this weekend \nTravel advisory: airlines now offering flights to front of TSA line \nAs Obama instructs his administration to get ready for presidential transition, Trump preemptively purchases 'T' keys for White House keyboards \nJohn Kasich self-identifies as GOP primary winner, demands access to White House bathroom \nUpcoming Trump/Kelly interview on FoxNews sponsored by 'Let's Make a Deal' and 'The Price is Right' \nNews from 2017: once the evacuation of Lena Dunham and 90% of other Hollywood celebrities to Canada is confirmed, Trump resigns from presidency: \"My work here is done\" \nNon-presidential candidate Paul Ryan pledges not to run for president in new non-presidential non-ad campaign \nTrump suggests creating 'Muslim database'; Obama symbolically protests by shredding White House guest logs beginning 2009 \nNational Enquirer: John Kasich's real dad was the milkman, not mailman \nNational Enquirer: Bound delegates from Colorado, Wyoming found in Ted Cruz’s basement \nIran breaks its pinky-swear promise not to support terrorism; US State Department vows rock-paper-scissors strategic response \nWomen across the country cheer as racist Democrat president on $20 bill is replaced by black pro-gun Republican \nFederal Reserve solves budget crisis by writing itself a 20-trillion-dollar check \nWidows, orphans claim responsibility for Brussels airport bombing \nChe Guevara's son hopes Cuba's communism will rub off on US, proposes a long list of people the government should execute first \nSusan Sarandon: \"I don't vote with my vagina.\" Voters in line behind her still suspicious, use hand sanitizer \nCampaign memo typo causes Hillary to court 'New Black Panties' vote \nNew Hampshire votes for socialist Sanders, changes state motto to \"Live FOR Free or Die\" \nMartin O'Malley drops out of race after Iowa Caucus; nation shocked with revelation he has been running for president \nStatisticians: one out of three Bernie Sanders supporters is just as dumb as the other two \nHillary campaign denies accusations of smoking-gun evidence in her emails, claims they contain only smoking-circumstantial-gun evidence \nObama stops short of firing US Congress upon realizing the difficulty of assembling another group of such tractable yes-men \nIn effort to contol wild passions for violent jihad, White House urges gun owners to keep their firearms covered in gun burkas \nTV horror live: A Charlie Brown Christmas gets shot up on air by Mohammed cartoons \nDemocrats vow to burn the country down over Ted Cruz statement, 'The overwhelming majority of violent criminals are Democrats' \nRussia's trend to sign bombs dropped on ISIS with \"This is for Paris\" found response in Obama administration's trend to sign American bombs with \"Return to sender\" \nUniversity researchers of cultural appropriation quit upon discovery that their research is appropriation from a culture that created universities \nArcheologists discover remains of what Barack Obama has described as unprecedented, un-American, and not-who-we-are immigration screening process in Ellis Island \nMizzou protests lead to declaring entire state a \"safe space,\" changing Missouri motto to \"The don't show me state\" \nGreen energy fact: if we put all green energy subsidies together in one-dollar bills and burn them, we could generate more electricity than has been produced by subsidized green energy \nState officials improve chances of healthcare payouts by replacing ObamaCare with state lottery \nNASA's new mission to search for racism, sexism, and economic inequality in deep space suffers from race, gender, and class power struggles over multibillion-dollar budget \nCollege progress enforcement squads issue schematic humor charts so students know if a joke may be spontaneously laughed at or if regulations require other action \nISIS opens suicide hotline for US teens depressed by climate change and other progressive doomsday scenarios \nVirginia county to close schools after teacher asks students to write 'death to America' in Arabic \n'Wear hijab to school day' ends with spontaneous female circumcision and stoning of a classmate during lunch break \nISIS releases new, even more barbaric video in an effort to regain mantle from Planned Parenthood \nImpressed by Fox News stellar rating during GOP debates, CNN to use same formula on Democrat candidates asking tough, pointed questions about Republicans \nShocking new book explores pros and cons of socialism, discovers they are same people \nPope outraged by Planned Parenthood's \"unfettered capitalism,\" demands equal redistribution of baby parts to each according to his need \nJohn Kerry accepts Iran's \"Golden Taquiyya\" award, requests jalapenos on the side \nCitizens of Pluto protest US government's surveillance of their planetoid and its moons with New Horizons space drone \nJohn Kerry proposes 3-day waiting period for all terrorist nations trying to acquire nuclear weapons \nChicago Police trying to identify flag that caused nine murders and 53 injuries in the city this past weekend \nCuba opens to affordable medical tourism for Americans who can't afford Obamacare deductibles \nState-funded research proves existence of Quantum Aggression Particles (Heterons) in Large Hadron Collider \nStudent job opportunities: make big bucks this summer as Hillary’s Ordinary-American; all expenses paid, travel, free acting lessons \nExperts debate whether Iranian negotiators broke John Kerry's leg or he did it himself to get out of negotiations \nJunior Varsity takes Ramadi, advances to quarterfinals \nUS media to GOP pool of candidates: 'Knowing what we know now, would you have had anything to do with the founding of the United States?' \nNY Mayor to hold peace talks with rats, apologize for previous Mayor's cowboy diplomacy \nChina launches cube-shaped space object with a message to aliens: \"The inhabitants of Earth will steal your intellectual property, copy it, manufacture it in sweatshops with slave labor, and sell it back to you at ridiculously low prices\" \nProgressive scientists: Truth is a variable deduced by subtracting 'what is' from 'what ought to be' \nExperts agree: Hillary Clinton best candidate to lessen percentage of Americans in top 1% \nAmerica's attempts at peace talks with the White House continue to be met with lies, stalling tactics, and bad faith \nStarbucks new policy to talk race with customers prompts new hashtag #DontHoldUpTheLine \nHillary: DELETE is the new RESET \nCharlie Hebdo receives Islamophobe 2015 award ; the cartoonists could not be reached for comment due to their inexplicable, illogical deaths \nRussia sends 'reset' button back to Hillary: 'You need it now more than we do' \nBarack Obama finds out from CNN that Hillary Clinton spent four years being his Secretary of State \nPresident Obama honors Leonard Nimoy by taking selfie in front of Starship Enterprise \nPolice: If Obama had a convenience store, it would look like Obama Express Food Market \nStudy finds stunning lack of racial, gender, and economic diversity among middle-class white males \nNASA: We're 80% sure about being 20% sure about being 17% sure about being 38% sure about 2014 being the hottest year on record \nPeople holding '$15 an Hour Now' posters sue Democratic party demanding raise to $15 an hour for rendered professional protesting services \nCuba-US normalization: US tourists flock to see Cuba before it looks like the US and Cubans flock to see the US before it looks like Cuba \nWhite House describes attacks on Sony Pictures as 'spontaneous hacking in response to offensive video mocking Juche and its prophet' \nCIA responds to Democrat calls for transparency by releasing the director's cut of The Making Of Obama's Birth Certificate \nObama: 'If I had a city, it would look like Ferguson' \nBiden: 'If I had a Ferguson (hic), it would look like a city' \nObama signs executive order renaming 'looters' to 'undocumented shoppers' \nEthicists agree: two wrongs do make a right so long as Bush did it first \nThe aftermath of the 'War on Women 2014' finds a new 'Lost Generation' of disillusioned Democrat politicians, unable to cope with life out of office \nWhite House: Republican takeover of the Senate is a clear mandate from the American people for President Obama to rule by executive orders \nNurse Kaci Hickox angrily tells reporters that she won't change her clocks for daylight savings time \nDemocratic Party leaders in panic after recent poll shows most Democratic voters think 'midterm' is when to end pregnancy \nDesperate Democratic candidates plead with Obama to stop backing them and instead support their GOP opponents \nEbola Czar issues five-year plan with mandatory quotas of Ebola infections per each state based on voting preferences \nStudy: crony capitalism is to the free market what the Westboro Baptist Church is to Christianity \nFun facts about world languages: the Left has more words for statism than the Eskimos have for snow \nAfrican countries to ban all flights from the United States because \"Obama is incompetent, it scares us\" \nNobel Peace Prize controversy: Hillary not nominated despite having done even less than Obama to deserve it \nObama: 'Ebola is the JV of viruses' \nBREAKING: Secret Service foils Secret Service plot to protect Obama \nRevised 1st Amendment: buy one speech, get the second free \nSharpton calls on white NFL players to beat their women in the interests of racial fairness \nPresident Obama appoints his weekly approval poll as new national security adviser \nObama wags pen and phone at Putin; Europe offers support with powerful pens and phones from NATO members \nWhite House pledges to embarrass ISIS back to the Stone Age with a barrage of fearsome Twitter messages and fatally ironic Instagram photos \nObama to fight ISIS with new federal Terrorist Regulatory Agency \nObama vows ISIS will never raise their flag over the eighteenth hole \nHarry Reid: \"Sometimes I say the wong thing\" \nElian Gonzalez wishes he had come to the U.S. on a bus from Central America like all the other kids \nObama visits US-Mexican border, calls for a two-state solution \nObama draws \"blue line\" in Iraq after Putin took away his red crayon \n\"Hard Choices,\" a porno flick loosely based on Hillary Clinton's memoir and starring Hillary Hellfire as a drinking, whoring Secretary of State, wildly outsells the flabby, sagging original \nAccusations of siding with the enemy leave Sgt. Bergdahl with only two options: pursue a doctorate at Berkley or become a Senator from Massachusetts \nJay Carney stuck in line behind Eric Shinseki to leave the White House; estimated wait time from 15 min to 6 weeks \n100% of scientists agree that if man-made global warming were real, \"the last people we'd want to help us is the Obama administration\" \nJay Carney says he found out that Obama found out that he found out that Obama found out that he found out about the latest Obama administration scandal on the news \n\"Anarchy Now!\" meeting turns into riot over points of order, bylaws, and whether or not 'kicking the #^@&*! ass' of the person trying to speak is or is not violence \nObama retaliates against Putin by prohibiting unionized federal employees from dating hot Russian girls online during work hours \nRussian separatists in Ukraine riot over an offensive YouTube video showing the toppling of Lenin statues \n\"Free Speech Zones\" confuse Obamaphone owners who roam streets in search of additional air minutes \nObamacare bolsters employment for professionals with skills to convert meth back into sudafed \nGloves finally off: Obama uses pen and phone to cancel Putin's Netflix account \nJoe Biden to Russia: \"We will bury you by turning more of Eastern Europe over to your control!\" \nIn last-ditch effort to help Ukraine, Obama deploys Rev. Sharpton and Rev. Jackson's Rainbow Coalition to Crimea \nAl Sharpton: \"Not even Putin can withstand our signature chanting, 'racist, sexist, anti-gay, Russian army go away'!\" \nMardi Gras in North Korea: \" Throw me some food! \" \nObama's foreign policy works: \"War, invasion, and conquest are signs of weakness; we've got Putin right where we want him\" \nUS offers military solution to Ukraine crisis: \"We will only fight countries that have LGBT military\" \nPutin annexes Brighton Beach to protect ethnic Russians in Brooklyn, Obama appeals to UN and EU for help \nThe 1980s: \"Mr. Obama, we're just calling to ask if you want our foreign policy back . The 1970s are right here with us, and they're wondering, too.\" \nIn a stunning act of defiance, Obama courageously unfriends Putin on Facebook \nMSNBC: Obama secures alliance with Austro-Hungarian Empire against Russia’s aggression in Ukraine \nStudy: springbreak is to STDs what April 15th is to accountants \nEfforts to achieve moisture justice for California thwarted by unfair redistribution of snow in America \nNorth Korean voters unanimous: \"We are the 100%\" \nLeader of authoritarian gulag-site, The People's Cube, unanimously 're-elected' with 100% voter turnout \nSuper Bowl: Obama blames Fox News for Broncos' loss \nFeminist author slams gay marriage: \"a man needs a man like a fish needs a bicycle\" \nBeverly Hills campaign heats up between Henry Waxman and Marianne Williamson over the widening income gap between millionaires and billionaires in their district \nBiden to lower $10,000-a-plate Dinner For The Homeless to $5,000 so more homeless can attend \nKim becomes world leader, feeds uncle to dogs; Obama eats dogs, becomes world leader, America cries uncle \nNorth Korean leader executes own uncle for talking about Obamacare at family Christmas party \nWhite House hires part-time schizophrenic Mandela sign interpreter to help sell Obamacare \nKim Jong Un executes own \" crazy uncle \" to keep him from ruining another family Christmas \nOFA admits its advice for area activists to give Obamacare Talk at shooting ranges was a bad idea \nPresident resolves Obamacare debacle with executive order declaring all Americans equally healthy \nObama to Iran: \"If you like your nuclear program, you can keep your nuclear program\" \nBovine community outraged by flatulence coming from Washington DC \nObama: \"I'm not particularly ideological; I believe in a good pragmatic five-year plan\" \nShocker: Obama had no knowledge he'd been reelected until he read about it in the local newspaper last week \nServer problems at HealthCare.gov so bad, it now flashes 'Error 808' message \nNSA marks National Best Friend Day with official announcement: \"Government is your best friend; we know you like no one else, we're always there, we're always willing to listen\" \nAl Qaeda cancels attack on USA citing launch of Obamacare as devastating enough \nThe President's latest talking point on Obamacare: \"I didn't build that\" \nDizzy with success, Obama renames his wildly popular healthcare mandate to HillaryCare \nCarney: huge ObamaCare deductibles won't look as bad come hyperinflation \nWashington Redskins drop 'Washington' from their name as offensive to most Americans \nPoll: 83% of Americans favor cowboy diplomacy over rodeo clown diplomacy \nGOVERNMENT WARNING: If you were able to complete ObamaCare form online, it wasn't a legitimate gov't website; you should report online fraud and change all your passwords \nObama administration gets serious, threatens Syria with ObamaCare \nObama authorizes the use of Vice President Joe Biden's double-barrel shotgun to fire a couple of blasts at Syria \nSharpton: \"British royals should have named baby 'Trayvon.' By choosing 'George' they sided with white Hispanic racist Zimmerman\" \nDNC launches 'Carlos Danger' action figure; proceeds to fund a charity helping survivors of the Republican War on Women \nNancy Pelosi extends abortion rights to the birds and the bees \nHubble discovers planetary drift to the left \nObama: 'If I had a daughter-in-law, she would look like Rachael Jeantel' \nFISA court rubberstamps statement denying its portrayal as government's rubber stamp \nEvery time ObamaCare gets delayed, a Julia somewhere dies \nGOP to Schumer: 'Force full implementation of ObamaCare before 2014 or Dems will never win another election' \nObama: 'If I had a son... no, wait, my daughter can now marry a woman!' \nJanet Napolitano: TSA findings reveal that since none of the hijackers were babies, elderly, or Tea Partiers, 9/11 was not an act of terrorism \nNews Flash: Sen. Mary Landrieu (D-LA) can see Canada from South Dakota \nSusan Rice: IRS actions against tea parties caused by anti-tax YouTube video that was insulting to their faith \nDrudge Report reduces font to fit all White House scandals onto one page \nObama: the IRS is a constitutional right, just like the Second Amendment \nWhite House: top Obama officials using secret email accounts a result of bad IT advice to avoid spam mail from Nigeria \nJay Carney to critics: 'Pinocchio never said anything inconsistent' \nObama: If I had a gay son, he'd look like Jason Collins \nGosnell's office in Benghazi raided by the IRS: mainstream media's worst cover-up challenge to date \nIRS targeting pro-gay-marriage LGBT groups leads to gayest tax revolt in U.S. history \nAfter Arlington Cemetery rejects offer to bury Boston bomber, Westboro Babtist Church steps up with premium front lawn plot \nBoston: Obama Administration to reclassify marathon bombing as 'sportsplace violence' \nStudy: Success has many fathers but failure becomes a government program \nUS Media: Can Pope Francis possibly clear up Vatican bureaucracy and banking without blaming the previous administration? \nMichelle Obama praises weekend rampage by Chicago teens as good way to burn calories and stay healthy \nThis Passover, Obama urges his subjects to paint lamb's blood above doors in order to avoid the Sequester \nWhite House to American children: Sequester causes layoffs among hens that lay Easter eggs; union-wage Easter Bunnies to be replaced by Mexican Chupacabras \nTime Mag names Hugo Chavez world's sexiest corpse \nBoy, 8, pretends banana is gun, makes daring escape from school \nStudy: Free lunches overpriced, lack nutrition \nOscars 2013: Michelle Obama announces long-awaited merger of Hollywood and the State \nJoe Salazar defends the right of women to be raped in gun-free environment: 'rapists and rapees should work together to prevent gun violence for the common good' \nDept. of Health and Human Services eliminates rape by reclassifying assailants as 'undocumented sex partners' \nKremlin puts out warning not to photoshop Putin riding meteor unless bare-chested \nDeeming football too violent, Obama moves to introduce Super Drone Sundays instead \nJapan offers to extend nuclear umbrella to cover U.S. should America suffer devastating attack on its own defense spending \nFeminists organize one billion women to protest male oppression with one billion lap dances \nUrban community protests Mayor Bloomberg's ban on extra-large pop singers owning assault weapons \nConcerned with mounting death toll, Taliban offers to send peacekeeping advisers to Chicago \nKarl Rove puts an end to Tea Party with new 'Republicans For Democrats' strategy aimed at losing elections \nAnswering public skepticism, President Obama authorizes unlimited drone attacks on all skeet targets throughout the country \nSkeet Ulrich denies claims he had been shot by President but considers changing his name to 'Traps' \nWhite House releases new exciting photos of Obama standing, sitting, looking thoughtful, and even breathing in and out \nNew York Times hacked by Chinese government, Paul Krugman's economic policies stolen \nWhite House: when President shoots skeet, he donates the meat to food banks that feed the middle class \nTo prove he is serious, Obama eliminates armed guard protection for President, Vice-President, and their families; establishes Gun-Free Zones around them instead \nState Dept to send 100,000 American college students to China as security for US debt obligations \nJay Carney: Al Qaeda is on the run, they're just running forward \nPresident issues executive orders banning cliffs, ceilings, obstructions, statistics, and other notions that prevent us from moving forwards and upward \nFearing the worst, Obama Administration outlaws the fan to prevent it from being hit by certain objects \nWorld ends; S&P soars \nRiddle of universe solved; answer not understood \nMeek inherit Earth, can't afford estate taxes \nGreece abandons Euro; accountants find Greece has no Euros anyway \nWheel finally reinvented; axles to be gradually reinvented in 3rd quarter of 2013 \nBigfoot found in Ohio, mysteriously not voting for Obama \nAs Santa's workshop files for bankruptcy, Fed offers bailout in exchange for control of 'naughty and nice' list \nFreak flying pig accident causes bacon to fly off shelves \nObama: green economy likely to transform America into a leading third world country of the new millennium \nReport: President Obama to visit the United States in the near future \nObama promises to create thousands more economically neutral jobs \nModernizing Islam: New York imam proposes to canonize Saul Alinsky as religion's latter day prophet \nImam Rauf's peaceful solution: 'Move Ground Zero a few blocks away from the mosque and no one gets hurt' \nStudy: Obama's threat to burn tax money in Washington 'recruitment bonanza' for Tea Parties \nStudy: no Social Security reform will be needed if gov't raises retirement age to at least 814 years \nObama attends church service, worships self \nObama proposes national 'Win The Future' lottery; proceeds of new WTF Powerball to finance more gov't spending \nHistorical revisionists: \"Hey, you never know\" \nVice President Biden: criticizing Egypt is un-pharaoh \nIsraelis to Egyptian rioters: \"don't damage the pyramids, we will not rebuild\" \nLake Superior renamed Lake Inferior in spirit of tolerance and inclusiveness \nAl Gore: It's a shame that a family can be torn apart by something as simple as a pack of polar bears \nMichael Moore: As long as there is anyone with money to shake down, this country is not broke \nObama's teleprompters unionize, demand collective bargaining rights \nObama calls new taxes 'spending reductions in tax code.' Elsewhere rapists tout 'consent reductions in sexual intercourse' \nObama's teleprompter unhappy with White House Twitter: \"Too few words\" \nObama's Regulation Reduction committee finds US Constitution to be expensive outdated framework inefficiently regulating federal gov't \nTaking a page from the Reagan years, Obama announces new era of Perestroika and Glasnost \nResponding to Oslo shootings, Obama declares Christianity \"Religion of Peace,\" praises \"moderate Christians,\" promises to send one into space \nRepublicans block Obama's $420 billion program to give American families free charms that ward off economic bad luck \nWhite House to impose Chimney tax on Santa Claus \nObama decrees the economy is not soaring as much as previously decreeed \nConservative think tank introduces children to capitalism with pop-up picture book \"The Road to Smurfdom\" \nAl Gore proposes to combat Global Warming by extracting silver linings from clouds in Earth's atmosphere \nObama refutes charges of him being unresponsive to people's suffering: \"When you pray to God, do you always hear a response?\" \nObama regrets the US government didn't provide his mother with free contraceptives when she was in college \nFluke to Congress: drill, baby, drill! \nPlanned Parenthood introduces Frequent Flucker reward card: 'Come again soon!' \nObama to tornado victims: 'We inherited this weather from the previous administration' \nObama congratulates Putin on Chicago-style election outcome \nPeople's Cube gives itself Hero of Socialist Labor medal in recognition of continued expert advice provided to the Obama Administration helping to shape its foreign and domestic policies \nHamas: Israeli air defense unfair to 99% of our missiles, \"only 1% allowed to reach Israel\" \nDemocrat strategist: without government supervision, women would have never evolved into humans \nVoters Without Borders oppose Texas new voter ID law \nEnraged by accusation that they are doing Obama's bidding, media leaders demand instructions from White House on how to respond \nObama blames previous Olympics for failure to win at this Olympics \nOfficial: China plans to land on Moon or at least on cheap knockoff thereof \nKoran-Contra: Obama secretly arms Syrian rebels \nPoll: Progressive slogan 'We should be more like Europe' most popular with members of American Nazi Party \nObama to Evangelicals: Jesus saves, I just spend \nMay Day: Anarchists plan, schedule, synchronize, and execute a coordinated campaign against all of the above \nMidwestern farmers hooked on new erotic novel \"50 Shades of Hay\" \nStudy: 99% of Liberals give the rest a bad name \nObama meets with Jewish leaders, proposes deeper circumcisions for the rich \nHistorians: Before HOPE & CHANGE there was HEMP & CHOOM at ten bucks a bag \nCancer once again fails to cure Venezuela of its \"President for Life\" \nTragic spelling error causes Muslim protesters to burn local boob-tube factory \nSecretary of Energy Steven Chu: due to energy conservation, the light at the end of the tunnel will be switched off \nObama Administration running food stamps across the border with Mexico in an operation code-named \"Fat And Furious\" \nPakistan explodes in protest over new Adobe Acrobat update; 17 local acrobats killed \nWhite House: \"Let them eat statistics\" \nSpecial Ops: if Benedict Arnold had a son, he would look like Barack Obama",
                              "label": 1,
                              "distance": 1.1607459783554077
                        },
                        {
                              "text": "\"Some chain e-mails remind us of a bad  Three's Company  episode. One roommate overhears something a little wrong and leaps to all sorts of misguided conclusions. Hijinks ensue. The  latest chain e-mail  sent to us from a reader puts some words into the mouth of former Sen. Tom Daschle that raised our eyebrows. Daschle, you may recall, was once President Barack Obama's choice to be secretary of health and human services. He stepped down from consideration amid revelations about tax problems, but some think his fingerprints can be seen in some of the health provisions in the economic stimulus package signed by the president in February. According to the e-mail (read the  full text here  ), Daschle was quoted in a Bloomberg story saying, \"\"Seniors should be more accepting of the conditions that come with age instead of treating them.\"\" We thought that sounded a bit impolitic, and fairly callous, for a former senator to say, and so we decided to check it out. As with most e-mail claims, it starts with a grain of something. Bloomberg did run a story about health provisions in the stimulus package on Feb. 9, 2009, under the headline  \"\"Ruin Your Health With the Obama Stimulus Plan: Betsy McCaughey.\"\" It was a commentary piece written by  Betsy McCaughey, former lieutenant governor of New York and an adjunct senior fellow at the Hudson Institute. McCaughey warned that the stimulus included several troublesome provisions identical to ideas outlined by Daschle in his 2008 book,  Critical: What We Can Do About the Health-Care Crisis. Midway through the article, McCaughey includes this paragraph: \"\"Daschle says health care reform 'will not be pain-free.' Seniors should be more accepting of the conditions that come with age instead of treating them. That means the elderly will bear the brunt.\"\" We contacted McCaughey to see which parts of this were her words and which were Daschle's. The phrase that health care reform \"\"will not be pain-free\"\" is a direct quote from Daschle, she explained. She said the sentence beginning \"\"Seniors should be more accepting\"\" was her paraphrasing of an argument in Daschle's book in which he quotes David Mechanic, a health care policy expert at Rutgers University, saying, \"\"more and more of what were once seen as social, behavioral, or normative aspects of every day life, or as a normal process of aging, are now framed in a medical context. ... Whether wrinkles, breasts, or buttocks, impotence or social anxieties, or inattention in school, they all have become grist for the medical mill.\"\" We think it's a stretch to summarize Daschle's position as saying that seniors should be more accepting of the conditions that come with age instead of treating them. Not treating wrinkles is one thing. Not treating, say, heart disease, is another. But that's fair enough for McCaughey to opine. This is labeled an opinion piece. The point is that these are McCaughey's words, not Daschle's. The last sentence, \"\"That means the elderly will bear the brunt,\"\" was her conclusion, McCaughey said. McCaughey said she is a meticulous scholar and \"\"I regret any misrepresentations made by others of my work or Mr. Daschle's views.\"\" Our efforts to reach Daschle for comment were not successful. In the chain e-mail, quote marks are shifted, clouding the issue of who is actually speaking, and the e-mail suggests that Daschle actually said that. The e-mail begins: \"\"Apparently, seniors are expendable — treating us is not worth the expense (unless you're a congressman!). Then later: Tom Daschle was credited today by Bloomberg with the following statement. Bloomberg: \"\"Daschle says health-care reform will not be pain free. Seniors should be more accepting of the conditions that come with age  instead of treating them.\"\" The e-mail ends, urging, \"\"Please use the power of the Internet to get this message out. Talk it up at the grassroots level. We have an election coming up in one year and nine months. We have the ability to address and reverse the dangerous direction the Obama administration and its allies have begun and in the interim, we can make their lives miserable. Let’s do it!\"\" A few shifted quote marks make all the difference here. Instead of McCaughey's words, they become Daschle's. That kind of thing may have made for '70s sitcom gold, but here it just muddies the debate. We rule the claim in this e-mail .\"",
                              "label": 0,
                              "distance": 1.1734371185302734
                        },
                        {
                              "text": "\"Anonymous e-mails claim that Sen. Barack Obama wants to \"\"unilaterally disarm our nation\"\" — and they say they have the video to prove it. \"\"You do not have to check Snopes to determine if this is true or  ... watch and listen to Obama's own words,\"\" warns one e-mail. \"\"Look at this ASAP — it may be pulled from the Obama Web site very soon,\"\" another e-mail states. \"\"This is shocking and reprehensible,\"\" opines a third e-mail. All the e-mails link to YouTube video that shows Barack Obama talking about his defense policies. The only problem is, Obama doesn't say in the video that he wants to disarm the United States. Rather, Obama talks about ending the war in Iraq, curtailing wasteful defense spending, and negotiating with Russia to reduce the U.S. nuclear arsenal. He says he wants \"\"a world without nuclear weapons,\"\" but as we'll explain shortly, that statement is well within the mainstream of U.S. foreign policy thought. We went looking for the source of the video and found it fairly quickly on the Obama campaign Web site. The official version includes opening and concluding remarks in which he emphasizes he will eliminate wasteful spending and make his sole priority protecting the American people. Obama's campaign created the video while campaigning to win the Iowa caucuses. Obama was seeking the endorsement of Caucus4Priorities, an Iowa-based advocacy movement that wants a portion of defense spending diverted to domestic issues like education and jobs. The group instead endorsed John Edwards. Here's Obama's statement in its entirety. We've noted where the edited version in the chain e-mails begins and ends: \"\"Thanks so much for the Caucus4Priorities, for the great work you've been doing. As president, I will end misguided defense policies and stand with Caucus4Priorities in fighting special interests in Washington. First, I'll stop spending $9-billion a month in Iraq. [Edited video starts.] I'm the only major candidate who opposed this war from the beginning, and as president, I will end it. \"\"Second, I will cut tens of billions of dollars in wasteful spending. I will cut investments in unproven missile defense systems. I will not weaponize space. I will slow our development of future combat systems, and I will institute an independent defense priorities board to ensure that the quadrennial defense review is not used to justify unnecessary spending. \"\"Third, I will set a goal of a world without nuclear weapons. To seek that goal, I will not develop new nuclear weapons. I will seek a global ban on the production of fissile material, and I will negotiate with Russia to take our ICBMs off hair-trigger alert and to achieve deep cuts in our nuclear arsenals. [Edited video ends.] \"\"You know where I stand. I've fought for open, ethical and accountable government my entire public life. I don't switch positions or make promises that can't be kept. I don't posture on defense policy, and I don't take money from federal lobbyists for powerful defense contractors. As president, my sole priority for defense spending will be protecting the American people. Thanks so much.\"\" We suspect that the phrase \"\"a world without nuclear weapons\"\" may have set off Obama's anonymous critics. Actually, that goal has been promoted by foreign policy experts on both sides of the political aisle. Obama's goal echoes an opinion piece published in the  Wall Street Journal  on Jan. 4, 2007, authored by George P. Shultz, William J. Perry, Henry A. Kissinger and Sam Nunn. Its title: \"\"A World Free of Nuclear Weapons.\"\" \"\"The end of the Cold War made the doctrine of mutual Soviet-American deterrence obsolete,\"\" their essay said. \"\"Deterrence continues to be a relevant consideration for many states with regard to threats from other states. But reliance on nuclear weapons for this purpose is becoming increasingly hazardous and decreasingly effective.\"\" The piece then goes on to argue for similar points as Obama mentions in his statement, though in more detail. The authors have significant foreign policy experience: Shultz was was secretary of state under Ronald Reagan; Perry was defense secretary under Bill Clinton; Kissinger was secretary of state under Richard Nixon and Gerald Ford; and Nunn was chairman of the U.S. Senate Armed Services Committee. The piece kicked off enough discussion and debate in the foreign policy community that the quartet authored another piece for the  Wall Street Journal  a year later, titled \"\"Toward a Nuclear-Free World,\"\" in which they discussed growing support for their ideas. Not everyone agreed, of course. In May 2008, the  Weekly Standard  published a detailed critique of the policies by Gary J. Schmitt of the American Enterprise Institute and Henry Sokolski of the Nonproliferation Policy Education Center, who argued that their proposed solutions would be difficult to implement. For our fact-checking purposes, the point here is that Obama's statement falls firmly within the mainstream of the U.S. foreign policy debate. His position does not constitute unilateral disarmament, said John Pike, director of GlobalSecurity.org, a Web site that specializes in information about defense, the military, weapons of mass destruction and homeland security. \"\"He's advocating the abolition of nuclear weapons in general, not nuclear disarmament,\"\" Pike said. \"\"If you're going to disagree with him, you have to understand what you're disagreeing with.\"\" The notion of unilateral disarmament is pretty much a nonstarter for both major political parties, including Obama, he added. \"\"Outside of the religious pacifist community, that is just not a policy position that has had meaningful political support in the United States,\"\" Pike said. One of the outlets that has promoted the Obama-wants-to-disarm-us argument is the conservative blog Macsmind. Macsmind linked on Feb. 27, 2008, to a YouTube video; several of the e-mails we received linked to the Macsmind post. Macsmind posted the commentary, \"\"Sen. McCain, you should grab this video and play it on every ad you can. This is absolutely shocking reprehensible. He plans to universally disarm our nation (sic). The question is for what, and more specifically 'for whom'.\"\" On June 8, Macsmind posted a full version of the video, noting \"\"some lefties are complaining that the video is a hack job and it's out of context. Therefore I present to you context.\"\" Macsmind and others may not like the foreign policy goals that Obama outlines in his video, but it's deceptive to call those goals unilateral disarmament. For this reason, we find this the chain e-mail's statements to be .\"",
                              "label": 0,
                              "distance": 1.1786588430404663
                        },
                        {
                              "text": "Hillary at the Laugh Factory, Part 7: Loser Users browsing this forum: Majestic-12 [Bot] , MSNbot Media and 29 guests Display posts from previous: Powered by phpBB © 2000, 2002, 2005, 2007 phpBB Group The uncontested absurdities of today are the accepted slogans of tomorrow. They come to be accepted by degrees, by precedent, by implication, by erosion, by default, by dint of constant pressure on one side and constant retreat on the other - until the day when they are suddenly declared to be the country's official ideology. ~ Ayn Rand \nRubiks & Rubik’s Cube ® used by special individual permission of Seven Town Ltd. Write down this number and report to your Kommissar at the nearest railroad station. Don't forget warm clothes and a shovel! \nIn Hillary's America, email server scrubs you \nObama transfers his Nobel Peace Prize to anti-Trump rioters \nDemocrats blame Hillary's criminal e-mail server for her loss, demand it face prison \nAfraid of \"dangerous\" Trump presidency, protesters pre-emptively burn America down to the ground \nClinton Foundation in foreclosure as foreign donors demand refunds \nHillary Clinton blames YouTube video for unexpected and spontaneous voter uprising that prevented her inevitable move into the White House \nSudden rise in sea levels explained by disproportionately large tears shed by climate scientists in the aftermath of Trump's electoral victory \nFBI director Comey delighted after receiving Nobel Prize for Speed Reading (650,000 emails in one week) \nU.N. deploys troops to American college campuses in order to combat staggeringly low rape rates \nResponding to Trump's surging poll numbers, Obama preemptively pardons himself for treason \nFollowing hurricane Matthew's failure to devastate Florida, activists flock to the Sunshine State and destroy Trump signs manually \nTim Kaine takes credit for interrupting hurricane Matthew while debating weather in Florida \nStudy: Many non-voters still undecided on how they're not going to vote \nThe Evolution of Dissent: on November 8th the nation is to decide whether dissent will stop being racist and become sexist - or it will once again be patriotic as it was for 8 years under George W. Bush \nVenezuela solves starvation problem by making it mandatory to buy food \nBreaking: the Clinton Foundation set to investigate the FBI \nObama ​​captures rare Pokémon ​​while visiting Hiroshima \nMovie news: 'The Big Friendly Giant Government' flops at box office; audiences say \"It's creepy\" \nBarack Obama: \"If I had a son, he'd look like Micah Johnson\" \nWhite House edits Orlando 911 transcript to say shooter pledged allegiance to NRA and Republican Party \nPresident George Washington: 'Redcoats do not represent British Empire; King George promotes a distorted version of British colonialism' \nFollowing Obama's 'Okie-Doke' speech , stock of Okie-Doke soars; NASDAQ: 'Obama best Okie-Doke salesman' \nWeaponized baby formula threatens Planned Parenthood office; ACLU demands federal investigation of Gerber \nExperts: melting Antarctic glacier could cause sale levels to rise up to 80% off select items by this weekend \nTravel advisory: airlines now offering flights to front of TSA line \nAs Obama instructs his administration to get ready for presidential transition, Trump preemptively purchases 'T' keys for White House keyboards \nJohn Kasich self-identifies as GOP primary winner, demands access to White House bathroom \nUpcoming Trump/Kelly interview on FoxNews sponsored by 'Let's Make a Deal' and 'The Price is Right' \nNews from 2017: once the evacuation of Lena Dunham and 90% of other Hollywood celebrities to Canada is confirmed, Trump resigns from presidency: \"My work here is done\" \nNon-presidential candidate Paul Ryan pledges not to run for president in new non-presidential non-ad campaign \nTrump suggests creating 'Muslim database'; Obama symbolically protests by shredding White House guest logs beginning 2009 \nNational Enquirer: John Kasich's real dad was the milkman, not mailman \nNational Enquirer: Bound delegates from Colorado, Wyoming found in Ted Cruz’s basement \nIran breaks its pinky-swear promise not to support terrorism; US State Department vows rock-paper-scissors strategic response \nWomen across the country cheer as racist Democrat president on $20 bill is replaced by black pro-gun Republican \nFederal Reserve solves budget crisis by writing itself a 20-trillion-dollar check \nWidows, orphans claim responsibility for Brussels airport bombing \nChe Guevara's son hopes Cuba's communism will rub off on US, proposes a long list of people the government should execute first \nSusan Sarandon: \"I don't vote with my vagina.\" Voters in line behind her still suspicious, use hand sanitizer \nCampaign memo typo causes Hillary to court 'New Black Panties' vote \nNew Hampshire votes for socialist Sanders, changes state motto to \"Live FOR Free or Die\" \nMartin O'Malley drops out of race after Iowa Caucus; nation shocked with revelation he has been running for president \nStatisticians: one out of three Bernie Sanders supporters is just as dumb as the other two \nHillary campaign denies accusations of smoking-gun evidence in her emails, claims they contain only smoking-circumstantial-gun evidence \nObama stops short of firing US Congress upon realizing the difficulty of assembling another group of such tractable yes-men \nIn effort to contol wild passions for violent jihad, White House urges gun owners to keep their firearms covered in gun burkas \nTV horror live: A Charlie Brown Christmas gets shot up on air by Mohammed cartoons \nDemocrats vow to burn the country down over Ted Cruz statement, 'The overwhelming majority of violent criminals are Democrats' \nRussia's trend to sign bombs dropped on ISIS with \"This is for Paris\" found response in Obama administration's trend to sign American bombs with \"Return to sender\" \nUniversity researchers of cultural appropriation quit upon discovery that their research is appropriation from a culture that created universities \nArcheologists discover remains of what Barack Obama has described as unprecedented, un-American, and not-who-we-are immigration screening process in Ellis Island \nMizzou protests lead to declaring entire state a \"safe space,\" changing Missouri motto to \"The don't show me state\" \nGreen energy fact: if we put all green energy subsidies together in one-dollar bills and burn them, we could generate more electricity than has been produced by subsidized green energy \nState officials improve chances of healthcare payouts by replacing ObamaCare with state lottery \nNASA's new mission to search for racism, sexism, and economic inequality in deep space suffers from race, gender, and class power struggles over multibillion-dollar budget \nCollege progress enforcement squads issue schematic humor charts so students know if a joke may be spontaneously laughed at or if regulations require other action \nISIS opens suicide hotline for US teens depressed by climate change and other progressive doomsday scenarios \nVirginia county to close schools after teacher asks students to write 'death to America' in Arabic \n'Wear hijab to school day' ends with spontaneous female circumcision and stoning of a classmate during lunch break \nISIS releases new, even more barbaric video in an effort to regain mantle from Planned Parenthood \nImpressed by Fox News stellar rating during GOP debates, CNN to use same formula on Democrat candidates asking tough, pointed questions about Republicans \nShocking new book explores pros and cons of socialism, discovers they are same people \nPope outraged by Planned Parenthood's \"unfettered capitalism,\" demands equal redistribution of baby parts to each according to his need \nJohn Kerry accepts Iran's \"Golden Taquiyya\" award, requests jalapenos on the side \nCitizens of Pluto protest US government's surveillance of their planetoid and its moons with New Horizons space drone \nJohn Kerry proposes 3-day waiting period for all terrorist nations trying to acquire nuclear weapons \nChicago Police trying to identify flag that caused nine murders and 53 injuries in the city this past weekend \nCuba opens to affordable medical tourism for Americans who can't afford Obamacare deductibles \nState-funded research proves existence of Quantum Aggression Particles (Heterons) in Large Hadron Collider \nStudent job opportunities: make big bucks this summer as Hillary’s Ordinary-American; all expenses paid, travel, free acting lessons \nExperts debate whether Iranian negotiators broke John Kerry's leg or he did it himself to get out of negotiations \nJunior Varsity takes Ramadi, advances to quarterfinals \nUS media to GOP pool of candidates: 'Knowing what we know now, would you have had anything to do with the founding of the United States?' \nNY Mayor to hold peace talks with rats, apologize for previous Mayor's cowboy diplomacy \nChina launches cube-shaped space object with a message to aliens: \"The inhabitants of Earth will steal your intellectual property, copy it, manufacture it in sweatshops with slave labor, and sell it back to you at ridiculously low prices\" \nProgressive scientists: Truth is a variable deduced by subtracting 'what is' from 'what ought to be' \nExperts agree: Hillary Clinton best candidate to lessen percentage of Americans in top 1% \nAmerica's attempts at peace talks with the White House continue to be met with lies, stalling tactics, and bad faith \nStarbucks new policy to talk race with customers prompts new hashtag #DontHoldUpTheLine \nHillary: DELETE is the new RESET \nCharlie Hebdo receives Islamophobe 2015 award ; the cartoonists could not be reached for comment due to their inexplicable, illogical deaths \nRussia sends 'reset' button back to Hillary: 'You need it now more than we do' \nBarack Obama finds out from CNN that Hillary Clinton spent four years being his Secretary of State \nPresident Obama honors Leonard Nimoy by taking selfie in front of Starship Enterprise \nPolice: If Obama had a convenience store, it would look like Obama Express Food Market \nStudy finds stunning lack of racial, gender, and economic diversity among middle-class white males \nNASA: We're 80% sure about being 20% sure about being 17% sure about being 38% sure about 2014 being the hottest year on record \nPeople holding '$15 an Hour Now' posters sue Democratic party demanding raise to $15 an hour for rendered professional protesting services \nCuba-US normalization: US tourists flock to see Cuba before it looks like the US and Cubans flock to see the US before it looks like Cuba \nWhite House describes attacks on Sony Pictures as 'spontaneous hacking in response to offensive video mocking Juche and its prophet' \nCIA responds to Democrat calls for transparency by releasing the director's cut of The Making Of Obama's Birth Certificate \nObama: 'If I had a city, it would look like Ferguson' \nBiden: 'If I had a Ferguson (hic), it would look like a city' \nObama signs executive order renaming 'looters' to 'undocumented shoppers' \nEthicists agree: two wrongs do make a right so long as Bush did it first \nThe aftermath of the 'War on Women 2014' finds a new 'Lost Generation' of disillusioned Democrat politicians, unable to cope with life out of office \nWhite House: Republican takeover of the Senate is a clear mandate from the American people for President Obama to rule by executive orders \nNurse Kaci Hickox angrily tells reporters that she won't change her clocks for daylight savings time \nDemocratic Party leaders in panic after recent poll shows most Democratic voters think 'midterm' is when to end pregnancy \nDesperate Democratic candidates plead with Obama to stop backing them and instead support their GOP opponents \nEbola Czar issues five-year plan with mandatory quotas of Ebola infections per each state based on voting preferences \nStudy: crony capitalism is to the free market what the Westboro Baptist Church is to Christianity \nFun facts about world languages: the Left has more words for statism than the Eskimos have for snow \nAfrican countries to ban all flights from the United States because \"Obama is incompetent, it scares us\" \nNobel Peace Prize controversy: Hillary not nominated despite having done even less than Obama to deserve it \nObama: 'Ebola is the JV of viruses' \nBREAKING: Secret Service foils Secret Service plot to protect Obama \nRevised 1st Amendment: buy one speech, get the second free \nSharpton calls on white NFL players to beat their women in the interests of racial fairness \nPresident Obama appoints his weekly approval poll as new national security adviser \nObama wags pen and phone at Putin; Europe offers support with powerful pens and phones from NATO members \nWhite House pledges to embarrass ISIS back to the Stone Age with a barrage of fearsome Twitter messages and fatally ironic Instagram photos \nObama to fight ISIS with new federal Terrorist Regulatory Agency \nObama vows ISIS will never raise their flag over the eighteenth hole \nHarry Reid: \"Sometimes I say the wong thing\" \nElian Gonzalez wishes he had come to the U.S. on a bus from Central America like all the other kids \nObama visits US-Mexican border, calls for a two-state solution \nObama draws \"blue line\" in Iraq after Putin took away his red crayon \n\"Hard Choices,\" a porno flick loosely based on Hillary Clinton's memoir and starring Hillary Hellfire as a drinking, whoring Secretary of State, wildly outsells the flabby, sagging original \nAccusations of siding with the enemy leave Sgt. Bergdahl with only two options: pursue a doctorate at Berkley or become a Senator from Massachusetts \nJay Carney stuck in line behind Eric Shinseki to leave the White House; estimated wait time from 15 min to 6 weeks \n100% of scientists agree that if man-made global warming were real, \"the last people we'd want to help us is the Obama administration\" \nJay Carney says he found out that Obama found out that he found out that Obama found out that he found out about the latest Obama administration scandal on the news \n\"Anarchy Now!\" meeting turns into riot over points of order, bylaws, and whether or not 'kicking the #^@&*! ass' of the person trying to speak is or is not violence \nObama retaliates against Putin by prohibiting unionized federal employees from dating hot Russian girls online during work hours \nRussian separatists in Ukraine riot over an offensive YouTube video showing the toppling of Lenin statues \n\"Free Speech Zones\" confuse Obamaphone owners who roam streets in search of additional air minutes \nObamacare bolsters employment for professionals with skills to convert meth back into sudafed \nGloves finally off: Obama uses pen and phone to cancel Putin's Netflix account \nJoe Biden to Russia: \"We will bury you by turning more of Eastern Europe over to your control!\" \nIn last-ditch effort to help Ukraine, Obama deploys Rev. Sharpton and Rev. Jackson's Rainbow Coalition to Crimea \nAl Sharpton: \"Not even Putin can withstand our signature chanting, 'racist, sexist, anti-gay, Russian army go away'!\" \nMardi Gras in North Korea: \" Throw me some food! \" \nObama's foreign policy works: \"War, invasion, and conquest are signs of weakness; we've got Putin right where we want him\" \nUS offers military solution to Ukraine crisis: \"We will only fight countries that have LGBT military\" \nPutin annexes Brighton Beach to protect ethnic Russians in Brooklyn, Obama appeals to UN and EU for help \nThe 1980s: \"Mr. Obama, we're just calling to ask if you want our foreign policy back . The 1970s are right here with us, and they're wondering, too.\" \nIn a stunning act of defiance, Obama courageously unfriends Putin on Facebook \nMSNBC: Obama secures alliance with Austro-Hungarian Empire against Russia’s aggression in Ukraine \nStudy: springbreak is to STDs what April 15th is to accountants \nEfforts to achieve moisture justice for California thwarted by unfair redistribution of snow in America \nNorth Korean voters unanimous: \"We are the 100%\" \nLeader of authoritarian gulag-site, The People's Cube, unanimously 're-elected' with 100% voter turnout \nSuper Bowl: Obama blames Fox News for Broncos' loss \nFeminist author slams gay marriage: \"a man needs a man like a fish needs a bicycle\" \nBeverly Hills campaign heats up between Henry Waxman and Marianne Williamson over the widening income gap between millionaires and billionaires in their district \nBiden to lower $10,000-a-plate Dinner For The Homeless to $5,000 so more homeless can attend \nKim becomes world leader, feeds uncle to dogs; Obama eats dogs, becomes world leader, America cries uncle \nNorth Korean leader executes own uncle for talking about Obamacare at family Christmas party \nWhite House hires part-time schizophrenic Mandela sign interpreter to help sell Obamacare \nKim Jong Un executes own \" crazy uncle \" to keep him from ruining another family Christmas \nOFA admits its advice for area activists to give Obamacare Talk at shooting ranges was a bad idea \nPresident resolves Obamacare debacle with executive order declaring all Americans equally healthy \nObama to Iran: \"If you like your nuclear program, you can keep your nuclear program\" \nBovine community outraged by flatulence coming from Washington DC \nObama: \"I'm not particularly ideological; I believe in a good pragmatic five-year plan\" \nShocker: Obama had no knowledge he'd been reelected until he read about it in the local newspaper last week \nServer problems at HealthCare.gov so bad, it now flashes 'Error 808' message \nNSA marks National Best Friend Day with official announcement: \"Government is your best friend; we know you like no one else, we're always there, we're always willing to listen\" \nAl Qaeda cancels attack on USA citing launch of Obamacare as devastating enough \nThe President's latest talking point on Obamacare: \"I didn't build that\" \nDizzy with success, Obama renames his wildly popular healthcare mandate to HillaryCare \nCarney: huge ObamaCare deductibles won't look as bad come hyperinflation \nWashington Redskins drop 'Washington' from their name as offensive to most Americans \nPoll: 83% of Americans favor cowboy diplomacy over rodeo clown diplomacy \nGOVERNMENT WARNING: If you were able to complete ObamaCare form online, it wasn't a legitimate gov't website; you should report online fraud and change all your passwords \nObama administration gets serious, threatens Syria with ObamaCare \nObama authorizes the use of Vice President Joe Biden's double-barrel shotgun to fire a couple of blasts at Syria \nSharpton: \"British royals should have named baby 'Trayvon.' By choosing 'George' they sided with white Hispanic racist Zimmerman\" \nDNC launches 'Carlos Danger' action figure; proceeds to fund a charity helping survivors of the Republican War on Women \nNancy Pelosi extends abortion rights to the birds and the bees \nHubble discovers planetary drift to the left \nObama: 'If I had a daughter-in-law, she would look like Rachael Jeantel' \nFISA court rubberstamps statement denying its portrayal as government's rubber stamp \nEvery time ObamaCare gets delayed, a Julia somewhere dies \nGOP to Schumer: 'Force full implementation of ObamaCare before 2014 or Dems will never win another election' \nObama: 'If I had a son... no, wait, my daughter can now marry a woman!' \nJanet Napolitano: TSA findings reveal that since none of the hijackers were babies, elderly, or Tea Partiers, 9/11 was not an act of terrorism \nNews Flash: Sen. Mary Landrieu (D-LA) can see Canada from South Dakota \nSusan Rice: IRS actions against tea parties caused by anti-tax YouTube video that was insulting to their faith \nDrudge Report reduces font to fit all White House scandals onto one page \nObama: the IRS is a constitutional right, just like the Second Amendment \nWhite House: top Obama officials using secret email accounts a result of bad IT advice to avoid spam mail from Nigeria \nJay Carney to critics: 'Pinocchio never said anything inconsistent' \nObama: If I had a gay son, he'd look like Jason Collins \nGosnell's office in Benghazi raided by the IRS: mainstream media's worst cover-up challenge to date \nIRS targeting pro-gay-marriage LGBT groups leads to gayest tax revolt in U.S. history \nAfter Arlington Cemetery rejects offer to bury Boston bomber, Westboro Babtist Church steps up with premium front lawn plot \nBoston: Obama Administration to reclassify marathon bombing as 'sportsplace violence' \nStudy: Success has many fathers but failure becomes a government program \nUS Media: Can Pope Francis possibly clear up Vatican bureaucracy and banking without blaming the previous administration? \nMichelle Obama praises weekend rampage by Chicago teens as good way to burn calories and stay healthy \nThis Passover, Obama urges his subjects to paint lamb's blood above doors in order to avoid the Sequester \nWhite House to American children: Sequester causes layoffs among hens that lay Easter eggs; union-wage Easter Bunnies to be replaced by Mexican Chupacabras \nTime Mag names Hugo Chavez world's sexiest corpse \nBoy, 8, pretends banana is gun, makes daring escape from school \nStudy: Free lunches overpriced, lack nutrition \nOscars 2013: Michelle Obama announces long-awaited merger of Hollywood and the State \nJoe Salazar defends the right of women to be raped in gun-free environment: 'rapists and rapees should work together to prevent gun violence for the common good' \nDept. of Health and Human Services eliminates rape by reclassifying assailants as 'undocumented sex partners' \nKremlin puts out warning not to photoshop Putin riding meteor unless bare-chested \nDeeming football too violent, Obama moves to introduce Super Drone Sundays instead \nJapan offers to extend nuclear umbrella to cover U.S. should America suffer devastating attack on its own defense spending \nFeminists organize one billion women to protest male oppression with one billion lap dances \nUrban community protests Mayor Bloomberg's ban on extra-large pop singers owning assault weapons \nConcerned with mounting death toll, Taliban offers to send peacekeeping advisers to Chicago \nKarl Rove puts an end to Tea Party with new 'Republicans For Democrats' strategy aimed at losing elections \nAnswering public skepticism, President Obama authorizes unlimited drone attacks on all skeet targets throughout the country \nSkeet Ulrich denies claims he had been shot by President but considers changing his name to 'Traps' \nWhite House releases new exciting photos of Obama standing, sitting, looking thoughtful, and even breathing in and out \nNew York Times hacked by Chinese government, Paul Krugman's economic policies stolen \nWhite House: when President shoots skeet, he donates the meat to food banks that feed the middle class \nTo prove he is serious, Obama eliminates armed guard protection for President, Vice-President, and their families; establishes Gun-Free Zones around them instead \nState Dept to send 100,000 American college students to China as security for US debt obligations \nJay Carney: Al Qaeda is on the run, they're just running forward \nPresident issues executive orders banning cliffs, ceilings, obstructions, statistics, and other notions that prevent us from moving forwards and upward \nFearing the worst, Obama Administration outlaws the fan to prevent it from being hit by certain objects \nWorld ends; S&P soars \nRiddle of universe solved; answer not understood \nMeek inherit Earth, can't afford estate taxes \nGreece abandons Euro; accountants find Greece has no Euros anyway \nWheel finally reinvented; axles to be gradually reinvented in 3rd quarter of 2013 \nBigfoot found in Ohio, mysteriously not voting for Obama \nAs Santa's workshop files for bankruptcy, Fed offers bailout in exchange for control of 'naughty and nice' list \nFreak flying pig accident causes bacon to fly off shelves \nObama: green economy likely to transform America into a leading third world country of the new millennium \nReport: President Obama to visit the United States in the near future \nObama promises to create thousands more economically neutral jobs \nModernizing Islam: New York imam proposes to canonize Saul Alinsky as religion's latter day prophet \nImam Rauf's peaceful solution: 'Move Ground Zero a few blocks away from the mosque and no one gets hurt' \nStudy: Obama's threat to burn tax money in Washington 'recruitment bonanza' for Tea Parties \nStudy: no Social Security reform will be needed if gov't raises retirement age to at least 814 years \nObama attends church service, worships self \nObama proposes national 'Win The Future' lottery; proceeds of new WTF Powerball to finance more gov't spending \nHistorical revisionists: \"Hey, you never know\" \nVice President Biden: criticizing Egypt is un-pharaoh \nIsraelis to Egyptian rioters: \"don't damage the pyramids, we will not rebuild\" \nLake Superior renamed Lake Inferior in spirit of tolerance and inclusiveness \nAl Gore: It's a shame that a family can be torn apart by something as simple as a pack of polar bears \nMichael Moore: As long as there is anyone with money to shake down, this country is not broke \nObama's teleprompters unionize, demand collective bargaining rights \nObama calls new taxes 'spending reductions in tax code.' Elsewhere rapists tout 'consent reductions in sexual intercourse' \nObama's teleprompter unhappy with White House Twitter: \"Too few words\" \nObama's Regulation Reduction committee finds US Constitution to be expensive outdated framework inefficiently regulating federal gov't \nTaking a page from the Reagan years, Obama announces new era of Perestroika and Glasnost \nResponding to Oslo shootings, Obama declares Christianity \"Religion of Peace,\" praises \"moderate Christians,\" promises to send one into space \nRepublicans block Obama's $420 billion program to give American families free charms that ward off economic bad luck \nWhite House to impose Chimney tax on Santa Claus \nObama decrees the economy is not soaring as much as previously decreeed \nConservative think tank introduces children to capitalism with pop-up picture book \"The Road to Smurfdom\" \nAl Gore proposes to combat Global Warming by extracting silver linings from clouds in Earth's atmosphere \nObama refutes charges of him being unresponsive to people's suffering: \"When you pray to God, do you always hear a response?\" \nObama regrets the US government didn't provide his mother with free contraceptives when she was in college \nFluke to Congress: drill, baby, drill! \nPlanned Parenthood introduces Frequent Flucker reward card: 'Come again soon!' \nObama to tornado victims: 'We inherited this weather from the previous administration' \nObama congratulates Putin on Chicago-style election outcome \nPeople's Cube gives itself Hero of Socialist Labor medal in recognition of continued expert advice provided to the Obama Administration helping to shape its foreign and domestic policies \nHamas: Israeli air defense unfair to 99% of our missiles, \"only 1% allowed to reach Israel\" \nDemocrat strategist: without government supervision, women would have never evolved into humans \nVoters Without Borders oppose Texas new voter ID law \nEnraged by accusation that they are doing Obama's bidding, media leaders demand instructions from White House on how to respond \nObama blames previous Olympics for failure to win at this Olympics \nOfficial: China plans to land on Moon or at least on cheap knockoff thereof \nKoran-Contra: Obama secretly arms Syrian rebels \nPoll: Progressive slogan 'We should be more like Europe' most popular with members of American Nazi Party \nObama to Evangelicals: Jesus saves, I just spend \nMay Day: Anarchists plan, schedule, synchronize, and execute a coordinated campaign against all of the above \nMidwestern farmers hooked on new erotic novel \"50 Shades of Hay\" \nStudy: 99% of Liberals give the rest a bad name \nObama meets with Jewish leaders, proposes deeper circumcisions for the rich \nHistorians: Before HOPE & CHANGE there was HEMP & CHOOM at ten bucks a bag \nCancer once again fails to cure Venezuela of its \"President for Life\" \nTragic spelling error causes Muslim protesters to burn local boob-tube factory \nSecretary of Energy Steven Chu: due to energy conservation, the light at the end of the tunnel will be switched off \nObama Administration running food stamps across the border with Mexico in an operation code-named \"Fat And Furious\" \nPakistan explodes in protest over new Adobe Acrobat update; 17 local acrobats killed \nWhite House: \"Let them eat statistics\" \nSpecial Ops: if Benedict Arnold had a son, he would look like Barack Obama",
                              "label": 1,
                              "distance": 1.183970332145691
                        },
                        {
                              "text": "Channel list \nPost-election shopping tip: look for the PoliticsFree label at your local grocer to make sure you don't buy from companies that don't want your business anymore \nIn Hillary's America, email server scrubs you \nObama transfers his Nobel Peace Prize to anti-Trump rioters \nDemocrats blame Hillary's criminal e-mail server for her loss, demand it face prison \nAfraid of \"dangerous\" Trump presidency, protesters pre-emptively burn America down to the ground \nClinton Foundation in foreclosure as foreign donors demand refunds \nHillary Clinton blames YouTube video for unexpected and spontaneous voter uprising that prevented her inevitable move into the White House \nSudden rise in sea levels explained by disproportionately large tears shed by climate scientists in the aftermath of Trump's electoral victory \nFBI director Comey delighted after receiving Nobel Prize for Speed Reading (650,000 emails in one week) \nU.N. deploys troops to American college campuses in order to combat staggeringly low rape rates \nResponding to Trump's surging poll numbers, Obama preemptively pardons himself for treason \nFollowing hurricane Matthew's failure to devastate Florida, activists flock to the Sunshine State and destroy Trump signs manually \nTim Kaine takes credit for interrupting hurricane Matthew while debating weather in Florida \nStudy: Many non-voters still undecided on how they're not going to vote \nThe Evolution of Dissent: on November 8th the nation is to decide whether dissent will stop being racist and become sexist - or it will once again be patriotic as it was for 8 years under George W. Bush \nVenezuela solves starvation problem by making it mandatory to buy food \nBreaking: the Clinton Foundation set to investigate the FBI \nObama ​​captures rare Pokémon ​​while visiting Hiroshima \nMovie news: 'The Big Friendly Giant Government' flops at box office; audiences say \"It's creepy\" \nBarack Obama: \"If I had a son, he'd look like Micah Johnson\" \nWhite House edits Orlando 911 transcript to say shooter pledged allegiance to NRA and Republican Party \nPresident George Washington: 'Redcoats do not represent British Empire; King George promotes a distorted version of British colonialism' \nFollowing Obama's 'Okie-Doke' speech , stock of Okie-Doke soars; NASDAQ: 'Obama best Okie-Doke salesman' \nWeaponized baby formula threatens Planned Parenthood office; ACLU demands federal investigation of Gerber \nExperts: melting Antarctic glacier could cause sale levels to rise up to 80% off select items by this weekend \nTravel advisory: airlines now offering flights to front of TSA line \nAs Obama instructs his administration to get ready for presidential transition, Trump preemptively purchases 'T' keys for White House keyboards \nJohn Kasich self-identifies as GOP primary winner, demands access to White House bathroom \nUpcoming Trump/Kelly interview on FoxNews sponsored by 'Let's Make a Deal' and 'The Price is Right' \nNews from 2017: once the evacuation of Lena Dunham and 90% of other Hollywood celebrities to Canada is confirmed, Trump resigns from presidency: \"My work here is done\" \nNon-presidential candidate Paul Ryan pledges not to run for president in new non-presidential non-ad campaign \nTrump suggests creating 'Muslim database'; Obama symbolically protests by shredding White House guest logs beginning 2009 \nNational Enquirer: John Kasich's real dad was the milkman, not mailman \nNational Enquirer: Bound delegates from Colorado, Wyoming found in Ted Cruz’s basement \nIran breaks its pinky-swear promise not to support terrorism; US State Department vows rock-paper-scissors strategic response \nWomen across the country cheer as racist Democrat president on $20 bill is replaced by black pro-gun Republican \nFederal Reserve solves budget crisis by writing itself a 20-trillion-dollar check \nWidows, orphans claim responsibility for Brussels airport bombing \nChe Guevara's son hopes Cuba's communism will rub off on US, proposes a long list of people the government should execute first \nSusan Sarandon: \"I don't vote with my vagina.\" Voters in line behind her still suspicious, use hand sanitizer \nCampaign memo typo causes Hillary to court 'New Black Panties' vote \nNew Hampshire votes for socialist Sanders, changes state motto to \"Live FOR Free or Die\" \nMartin O'Malley drops out of race after Iowa Caucus; nation shocked with revelation he has been running for president \nStatisticians: one out of three Bernie Sanders supporters is just as dumb as the other two \nHillary campaign denies accusations of smoking-gun evidence in her emails, claims they contain only smoking-circumstantial-gun evidence \nObama stops short of firing US Congress upon realizing the difficulty of assembling another group of such tractable yes-men \nIn effort to contol wild passions for violent jihad, White House urges gun owners to keep their firearms covered in gun burkas \nTV horror live: A Charlie Brown Christmas gets shot up on air by Mohammed cartoons \nDemocrats vow to burn the country down over Ted Cruz statement, 'The overwhelming majority of violent criminals are Democrats' \nRussia's trend to sign bombs dropped on ISIS with \"This is for Paris\" found response in Obama administration's trend to sign American bombs with \"Return to sender\" \nUniversity researchers of cultural appropriation quit upon discovery that their research is appropriation from a culture that created universities \nArcheologists discover remains of what Barack Obama has described as unprecedented, un-American, and not-who-we-are immigration screening process in Ellis Island \nMizzou protests lead to declaring entire state a \"safe space,\" changing Missouri motto to \"The don't show me state\" \nGreen energy fact: if we put all green energy subsidies together in one-dollar bills and burn them, we could generate more electricity than has been produced by subsidized green energy \nState officials improve chances of healthcare payouts by replacing ObamaCare with state lottery \nNASA's new mission to search for racism, sexism, and economic inequality in deep space suffers from race, gender, and class power struggles over multibillion-dollar budget \nCollege progress enforcement squads issue schematic humor charts so students know if a joke may be spontaneously laughed at or if regulations require other action \nISIS opens suicide hotline for US teens depressed by climate change and other progressive doomsday scenarios \nVirginia county to close schools after teacher asks students to write 'death to America' in Arabic \n'Wear hijab to school day' ends with spontaneous female circumcision and stoning of a classmate during lunch break \nISIS releases new, even more barbaric video in an effort to regain mantle from Planned Parenthood \nImpressed by Fox News stellar rating during GOP debates, CNN to use same formula on Democrat candidates asking tough, pointed questions about Republicans \nShocking new book explores pros and cons of socialism, discovers they are same people \nPope outraged by Planned Parenthood's \"unfettered capitalism,\" demands equal redistribution of baby parts to each according to his need \nJohn Kerry accepts Iran's \"Golden Taquiyya\" award, requests jalapenos on the side \nCitizens of Pluto protest US government's surveillance of their planetoid and its moons with New Horizons space drone \nJohn Kerry proposes 3-day waiting period for all terrorist nations trying to acquire nuclear weapons \nChicago Police trying to identify flag that caused nine murders and 53 injuries in the city this past weekend \nCuba opens to affordable medical tourism for Americans who can't afford Obamacare deductibles \nState-funded research proves existence of Quantum Aggression Particles (Heterons) in Large Hadron Collider \nStudent job opportunities: make big bucks this summer as Hillary’s Ordinary-American; all expenses paid, travel, free acting lessons \nExperts debate whether Iranian negotiators broke John Kerry's leg or he did it himself to get out of negotiations \nJunior Varsity takes Ramadi, advances to quarterfinals \nUS media to GOP pool of candidates: 'Knowing what we know now, would you have had anything to do with the founding of the United States?' \nNY Mayor to hold peace talks with rats, apologize for previous Mayor's cowboy diplomacy \nChina launches cube-shaped space object with a message to aliens: \"The inhabitants of Earth will steal your intellectual property, copy it, manufacture it in sweatshops with slave labor, and sell it back to you at ridiculously low prices\" \nProgressive scientists: Truth is a variable deduced by subtracting 'what is' from 'what ought to be' \nExperts agree: Hillary Clinton best candidate to lessen percentage of Americans in top 1% \nAmerica's attempts at peace talks with the White House continue to be met with lies, stalling tactics, and bad faith \nStarbucks new policy to talk race with customers prompts new hashtag #DontHoldUpTheLine \nHillary: DELETE is the new RESET \nCharlie Hebdo receives Islamophobe 2015 award ; the cartoonists could not be reached for comment due to their inexplicable, illogical deaths \nRussia sends 'reset' button back to Hillary: 'You need it now more than we do' \nBarack Obama finds out from CNN that Hillary Clinton spent four years being his Secretary of State \nPresident Obama honors Leonard Nimoy by taking selfie in front of Starship Enterprise \nPolice: If Obama had a convenience store, it would look like Obama Express Food Market \nStudy finds stunning lack of racial, gender, and economic diversity among middle-class white males \nNASA: We're 80% sure about being 20% sure about being 17% sure about being 38% sure about 2014 being the hottest year on record \nPeople holding '$15 an Hour Now' posters sue Democratic party demanding raise to $15 an hour for rendered professional protesting services \nCuba-US normalization: US tourists flock to see Cuba before it looks like the US and Cubans flock to see the US before it looks like Cuba \nWhite House describes attacks on Sony Pictures as 'spontaneous hacking in response to offensive video mocking Juche and its prophet' \nCIA responds to Democrat calls for transparency by releasing the director's cut of The Making Of Obama's Birth Certificate \nObama: 'If I had a city, it would look like Ferguson' \nBiden: 'If I had a Ferguson (hic), it would look like a city' \nObama signs executive order renaming 'looters' to 'undocumented shoppers' \nEthicists agree: two wrongs do make a right so long as Bush did it first \nThe aftermath of the 'War on Women 2014' finds a new 'Lost Generation' of disillusioned Democrat politicians, unable to cope with life out of office \nWhite House: Republican takeover of the Senate is a clear mandate from the American people for President Obama to rule by executive orders \nNurse Kaci Hickox angrily tells reporters that she won't change her clocks for daylight savings time \nDemocratic Party leaders in panic after recent poll shows most Democratic voters think 'midterm' is when to end pregnancy \nDesperate Democratic candidates plead with Obama to stop backing them and instead support their GOP opponents \nEbola Czar issues five-year plan with mandatory quotas of Ebola infections per each state based on voting preferences \nStudy: crony capitalism is to the free market what the Westboro Baptist Church is to Christianity \nFun facts about world languages: the Left has more words for statism than the Eskimos have for snow \nAfrican countries to ban all flights from the United States because \"Obama is incompetent, it scares us\" \nNobel Peace Prize controversy: Hillary not nominated despite having done even less than Obama to deserve it \nObama: 'Ebola is the JV of viruses' \nBREAKING: Secret Service foils Secret Service plot to protect Obama \nRevised 1st Amendment: buy one speech, get the second free \nSharpton calls on white NFL players to beat their women in the interests of racial fairness \nPresident Obama appoints his weekly approval poll as new national security adviser \nObama wags pen and phone at Putin; Europe offers support with powerful pens and phones from NATO members \nWhite House pledges to embarrass ISIS back to the Stone Age with a barrage of fearsome Twitter messages and fatally ironic Instagram photos \nObama to fight ISIS with new federal Terrorist Regulatory Agency \nObama vows ISIS will never raise their flag over the eighteenth hole \nHarry Reid: \"Sometimes I say the wong thing\" \nElian Gonzalez wishes he had come to the U.S. on a bus from Central America like all the other kids \nObama visits US-Mexican border, calls for a two-state solution \nObama draws \"blue line\" in Iraq after Putin took away his red crayon \n\"Hard Choices,\" a porno flick loosely based on Hillary Clinton's memoir and starring Hillary Hellfire as a drinking, whoring Secretary of State, wildly outsells the flabby, sagging original \nAccusations of siding with the enemy leave Sgt. Bergdahl with only two options: pursue a doctorate at Berkley or become a Senator from Massachusetts \nJay Carney stuck in line behind Eric Shinseki to leave the White House; estimated wait time from 15 min to 6 weeks \n100% of scientists agree that if man-made global warming were real, \"the last people we'd want to help us is the Obama administration\" \nJay Carney says he found out that Obama found out that he found out that Obama found out that he found out about the latest Obama administration scandal on the news \n\"Anarchy Now!\" meeting turns into riot over points of order, bylaws, and whether or not 'kicking the #^@&*! ass' of the person trying to speak is or is not violence \nObama retaliates against Putin by prohibiting unionized federal employees from dating hot Russian girls online during work hours \nRussian separatists in Ukraine riot over an offensive YouTube video showing the toppling of Lenin statues \n\"Free Speech Zones\" confuse Obamaphone owners who roam streets in search of additional air minutes \nObamacare bolsters employment for professionals with skills to convert meth back into sudafed \nGloves finally off: Obama uses pen and phone to cancel Putin's Netflix account \nJoe Biden to Russia: \"We will bury you by turning more of Eastern Europe over to your control!\" \nIn last-ditch effort to help Ukraine, Obama deploys Rev. Sharpton and Rev. Jackson's Rainbow Coalition to Crimea \nAl Sharpton: \"Not even Putin can withstand our signature chanting, 'racist, sexist, anti-gay, Russian army go away'!\" \nMardi Gras in North Korea: \" Throw me some food! \" \nObama's foreign policy works: \"War, invasion, and conquest are signs of weakness; we've got Putin right where we want him\" \nUS offers military solution to Ukraine crisis: \"We will only fight countries that have LGBT military\" \nPutin annexes Brighton Beach to protect ethnic Russians in Brooklyn, Obama appeals to UN and EU for help \nThe 1980s: \"Mr. Obama, we're just calling to ask if you want our foreign policy back . The 1970s are right here with us, and they're wondering, too.\" \nIn a stunning act of defiance, Obama courageously unfriends Putin on Facebook \nMSNBC: Obama secures alliance with Austro-Hungarian Empire against Russia’s aggression in Ukraine \nStudy: springbreak is to STDs what April 15th is to accountants \nEfforts to achieve moisture justice for California thwarted by unfair redistribution of snow in America \nNorth Korean voters unanimous: \"We are the 100%\" \nLeader of authoritarian gulag-site, The People's Cube, unanimously 're-elected' with 100% voter turnout \nSuper Bowl: Obama blames Fox News for Broncos' loss \nFeminist author slams gay marriage: \"a man needs a man like a fish needs a bicycle\" \nBeverly Hills campaign heats up between Henry Waxman and Marianne Williamson over the widening income gap between millionaires and billionaires in their district \nBiden to lower $10,000-a-plate Dinner For The Homeless to $5,000 so more homeless can attend \nKim becomes world leader, feeds uncle to dogs; Obama eats dogs, becomes world leader, America cries uncle \nNorth Korean leader executes own uncle for talking about Obamacare at family Christmas party \nWhite House hires part-time schizophrenic Mandela sign interpreter to help sell Obamacare \nKim Jong Un executes own \" crazy uncle \" to keep him from ruining another family Christmas \nOFA admits its advice for area activists to give Obamacare Talk at shooting ranges was a bad idea \nPresident resolves Obamacare debacle with executive order declaring all Americans equally healthy \nObama to Iran: \"If you like your nuclear program, you can keep your nuclear program\" \nBovine community outraged by flatulence coming from Washington DC \nObama: \"I'm not particularly ideological; I believe in a good pragmatic five-year plan\" \nShocker: Obama had no knowledge he'd been reelected until he read about it in the local newspaper last week \nServer problems at HealthCare.gov so bad, it now flashes 'Error 808' message \nNSA marks National Best Friend Day with official announcement: \"Government is your best friend; we know you like no one else, we're always there, we're always willing to listen\" \nAl Qaeda cancels attack on USA citing launch of Obamacare as devastating enough \nThe President's latest talking point on Obamacare: \"I didn't build that\" \nDizzy with success, Obama renames his wildly popular healthcare mandate to HillaryCare \nCarney: huge ObamaCare deductibles won't look as bad come hyperinflation \nWashington Redskins drop 'Washington' from their name as offensive to most Americans \nPoll: 83% of Americans favor cowboy diplomacy over rodeo clown diplomacy \nGOVERNMENT WARNING: If you were able to complete ObamaCare form online, it wasn't a legitimate gov't website; you should report online fraud and change all your passwords \nObama administration gets serious, threatens Syria with ObamaCare \nObama authorizes the use of Vice President Joe Biden's double-barrel shotgun to fire a couple of blasts at Syria \nSharpton: \"British royals should have named baby 'Trayvon.' By choosing 'George' they sided with white Hispanic racist Zimmerman\" \nDNC launches 'Carlos Danger' action figure; proceeds to fund a charity helping survivors of the Republican War on Women \nNancy Pelosi extends abortion rights to the birds and the bees \nHubble discovers planetary drift to the left \nObama: 'If I had a daughter-in-law, she would look like Rachael Jeantel' \nFISA court rubberstamps statement denying its portrayal as government's rubber stamp \nEvery time ObamaCare gets delayed, a Julia somewhere dies \nGOP to Schumer: 'Force full implementation of ObamaCare before 2014 or Dems will never win another election' \nObama: 'If I had a son... no, wait, my daughter can now marry a woman!' \nJanet Napolitano: TSA findings reveal that since none of the hijackers were babies, elderly, or Tea Partiers, 9/11 was not an act of terrorism \nNews Flash: Sen. Mary Landrieu (D-LA) can see Canada from South Dakota \nSusan Rice: IRS actions against tea parties caused by anti-tax YouTube video that was insulting to their faith \nDrudge Report reduces font to fit all White House scandals onto one page \nObama: the IRS is a constitutional right, just like the Second Amendment \nWhite House: top Obama officials using secret email accounts a result of bad IT advice to avoid spam mail from Nigeria \nJay Carney to critics: 'Pinocchio never said anything inconsistent' \nObama: If I had a gay son, he'd look like Jason Collins \nGosnell's office in Benghazi raided by the IRS: mainstream media's worst cover-up challenge to date \nIRS targeting pro-gay-marriage LGBT groups leads to gayest tax revolt in U.S. history \nAfter Arlington Cemetery rejects offer to bury Boston bomber, Westboro Babtist Church steps up with premium front lawn plot \nBoston: Obama Administration to reclassify marathon bombing as 'sportsplace violence' \nStudy: Success has many fathers but failure becomes a government program \nUS Media: Can Pope Francis possibly clear up Vatican bureaucracy and banking without blaming the previous administration? \nMichelle Obama praises weekend rampage by Chicago teens as good way to burn calories and stay healthy \nThis Passover, Obama urges his subjects to paint lamb's blood above doors in order to avoid the Sequester \nWhite House to American children: Sequester causes layoffs among hens that lay Easter eggs; union-wage Easter Bunnies to be replaced by Mexican Chupacabras \nTime Mag names Hugo Chavez world's sexiest corpse \nBoy, 8, pretends banana is gun, makes daring escape from school \nStudy: Free lunches overpriced, lack nutrition \nOscars 2013: Michelle Obama announces long-awaited merger of Hollywood and the State \nJoe Salazar defends the right of women to be raped in gun-free environment: 'rapists and rapees should work together to prevent gun violence for the common good' \nDept. of Health and Human Services eliminates rape by reclassifying assailants as 'undocumented sex partners' \nKremlin puts out warning not to photoshop Putin riding meteor unless bare-chested \nDeeming football too violent, Obama moves to introduce Super Drone Sundays instead \nJapan offers to extend nuclear umbrella to cover U.S. should America suffer devastating attack on its own defense spending \nFeminists organize one billion women to protest male oppression with one billion lap dances \nUrban community protests Mayor Bloomberg's ban on extra-large pop singers owning assault weapons \nConcerned with mounting death toll, Taliban offers to send peacekeeping advisers to Chicago \nKarl Rove puts an end to Tea Party with new 'Republicans For Democrats' strategy aimed at losing elections \nAnswering public skepticism, President Obama authorizes unlimited drone attacks on all skeet targets throughout the country \nSkeet Ulrich denies claims he had been shot by President but considers changing his name to 'Traps' \nWhite House releases new exciting photos of Obama standing, sitting, looking thoughtful, and even breathing in and out \nNew York Times hacked by Chinese government, Paul Krugman's economic policies stolen \nWhite House: when President shoots skeet, he donates the meat to food banks that feed the middle class \nTo prove he is serious, Obama eliminates armed guard protection for President, Vice-President, and their families; establishes Gun-Free Zones around them instead \nState Dept to send 100,000 American college students to China as security for US debt obligations \nJay Carney: Al Qaeda is on the run, they're just running forward \nPresident issues executive orders banning cliffs, ceilings, obstructions, statistics, and other notions that prevent us from moving forwards and upward \nFearing the worst, Obama Administration outlaws the fan to prevent it from being hit by certain objects \nWorld ends; S&P soars \nRiddle of universe solved; answer not understood \nMeek inherit Earth, can't afford estate taxes \nGreece abandons Euro; accountants find Greece has no Euros anyway \nWheel finally reinvented; axles to be gradually reinvented in 3rd quarter of 2013 \nBigfoot found in Ohio, mysteriously not voting for Obama \nAs Santa's workshop files for bankruptcy, Fed offers bailout in exchange for control of 'naughty and nice' list \nFreak flying pig accident causes bacon to fly off shelves \nObama: green economy likely to transform America into a leading third world country of the new millennium \nReport: President Obama to visit the United States in the near future \nObama promises to create thousands more economically neutral jobs \nModernizing Islam: New York imam proposes to canonize Saul Alinsky as religion's latter day prophet \nImam Rauf's peaceful solution: 'Move Ground Zero a few blocks away from the mosque and no one gets hurt' \nStudy: Obama's threat to burn tax money in Washington 'recruitment bonanza' for Tea Parties \nStudy: no Social Security reform will be needed if gov't raises retirement age to at least 814 years \nObama attends church service, worships self \nObama proposes national 'Win The Future' lottery; proceeds of new WTF Powerball to finance more gov't spending \nHistorical revisionists: \"Hey, you never know\" \nVice President Biden: criticizing Egypt is un-pharaoh \nIsraelis to Egyptian rioters: \"don't damage the pyramids, we will not rebuild\" \nLake Superior renamed Lake Inferior in spirit of tolerance and inclusiveness \nAl Gore: It's a shame that a family can be torn apart by something as simple as a pack of polar bears \nMichael Moore: As long as there is anyone with money to shake down, this country is not broke \nObama's teleprompters unionize, demand collective bargaining rights \nObama calls new taxes 'spending reductions in tax code.' Elsewhere rapists tout 'consent reductions in sexual intercourse' \nObama's teleprompter unhappy with White House Twitter: \"Too few words\" \nObama's Regulation Reduction committee finds US Constitution to be expensive outdated framework inefficiently regulating federal gov't \nTaking a page from the Reagan years, Obama announces new era of Perestroika and Glasnost \nResponding to Oslo shootings, Obama declares Christianity \"Religion of Peace,\" praises \"moderate Christians,\" promises to send one into space \nRepublicans block Obama's $420 billion program to give American families free charms that ward off economic bad luck \nWhite House to impose Chimney tax on Santa Claus \nObama decrees the economy is not soaring as much as previously decreeed \nConservative think tank introduces children to capitalism with pop-up picture book \"The Road to Smurfdom\" \nAl Gore proposes to combat Global Warming by extracting silver linings from clouds in Earth's atmosphere \nObama refutes charges of him being unresponsive to people's suffering: \"When you pray to God, do you always hear a response?\" \nObama regrets the US government didn't provide his mother with free contraceptives when she was in college \nFluke to Congress: drill, baby, drill! \nPlanned Parenthood introduces Frequent Flucker reward card: 'Come again soon!' \nObama to tornado victims: 'We inherited this weather from the previous administration' \nObama congratulates Putin on Chicago-style election outcome \nPeople's Cube gives itself Hero of Socialist Labor medal in recognition of continued expert advice provided to the Obama Administration helping to shape its foreign and domestic policies \nHamas: Israeli air defense unfair to 99% of our missiles, \"only 1% allowed to reach Israel\" \nDemocrat strategist: without government supervision, women would have never evolved into humans \nVoters Without Borders oppose Texas new voter ID law \nEnraged by accusation that they are doing Obama's bidding, media leaders demand instructions from White House on how to respond \nObama blames previous Olympics for failure to win at this Olympics \nOfficial: China plans to land on Moon or at least on cheap knockoff thereof \nKoran-Contra: Obama secretly arms Syrian rebels \nPoll: Progressive slogan 'We should be more like Europe' most popular with members of American Nazi Party \nObama to Evangelicals: Jesus saves, I just spend \nMay Day: Anarchists plan, schedule, synchronize, and execute a coordinated campaign against all of the above \nMidwestern farmers hooked on new erotic novel \"50 Shades of Hay\" \nStudy: 99% of Liberals give the rest a bad name \nObama meets with Jewish leaders, proposes deeper circumcisions for the rich \nHistorians: Before HOPE & CHANGE there was HEMP & CHOOM at ten bucks a bag \nCancer once again fails to cure Venezuela of its \"President for Life\" \nTragic spelling error causes Muslim protesters to burn local boob-tube factory \nSecretary of Energy Steven Chu: due to energy conservation, the light at the end of the tunnel will be switched off \nObama Administration running food stamps across the border with Mexico in an operation code-named \"Fat And Furious\" \nPakistan explodes in protest over new Adobe Acrobat update; 17 local acrobats killed \nWhite House: \"Let them eat statistics\" \nSpecial Ops: if Benedict Arnold had a son, he would look like Barack Obama",
                              "label": 1,
                              "distance": 1.1844526529312134
                        },
                        {
                              "text": "Channel list \nPost-election shopping tip: look for the PoliticsFree label at your local grocer to make sure you don't buy from companies that don't want your business anymore \nIn Hillary's America, email server scrubs you \nObama transfers his Nobel Peace Prize to anti-Trump rioters \nDemocrats blame Hillary's criminal e-mail server for her loss, demand it face prison \nAfraid of \"dangerous\" Trump presidency, protesters pre-emptively burn America down to the ground \nClinton Foundation in foreclosure as foreign donors demand refunds \nHillary Clinton blames YouTube video for unexpected and spontaneous voter uprising that prevented her inevitable move into the White House \nSudden rise in sea levels explained by disproportionately large tears shed by climate scientists in the aftermath of Trump's electoral victory \nFBI director Comey delighted after receiving Nobel Prize for Speed Reading (650,000 emails in one week) \nU.N. deploys troops to American college campuses in order to combat staggeringly low rape rates \nResponding to Trump's surging poll numbers, Obama preemptively pardons himself for treason \nFollowing hurricane Matthew's failure to devastate Florida, activists flock to the Sunshine State and destroy Trump signs manually \nTim Kaine takes credit for interrupting hurricane Matthew while debating weather in Florida \nStudy: Many non-voters still undecided on how they're not going to vote \nThe Evolution of Dissent: on November 8th the nation is to decide whether dissent will stop being racist and become sexist - or it will once again be patriotic as it was for 8 years under George W. Bush \nVenezuela solves starvation problem by making it mandatory to buy food \nBreaking: the Clinton Foundation set to investigate the FBI \nObama ​​captures rare Pokémon ​​while visiting Hiroshima \nMovie news: 'The Big Friendly Giant Government' flops at box office; audiences say \"It's creepy\" \nBarack Obama: \"If I had a son, he'd look like Micah Johnson\" \nWhite House edits Orlando 911 transcript to say shooter pledged allegiance to NRA and Republican Party \nPresident George Washington: 'Redcoats do not represent British Empire; King George promotes a distorted version of British colonialism' \nFollowing Obama's 'Okie-Doke' speech , stock of Okie-Doke soars; NASDAQ: 'Obama best Okie-Doke salesman' \nWeaponized baby formula threatens Planned Parenthood office; ACLU demands federal investigation of Gerber \nExperts: melting Antarctic glacier could cause sale levels to rise up to 80% off select items by this weekend \nTravel advisory: airlines now offering flights to front of TSA line \nAs Obama instructs his administration to get ready for presidential transition, Trump preemptively purchases 'T' keys for White House keyboards \nJohn Kasich self-identifies as GOP primary winner, demands access to White House bathroom \nUpcoming Trump/Kelly interview on FoxNews sponsored by 'Let's Make a Deal' and 'The Price is Right' \nNews from 2017: once the evacuation of Lena Dunham and 90% of other Hollywood celebrities to Canada is confirmed, Trump resigns from presidency: \"My work here is done\" \nNon-presidential candidate Paul Ryan pledges not to run for president in new non-presidential non-ad campaign \nTrump suggests creating 'Muslim database'; Obama symbolically protests by shredding White House guest logs beginning 2009 \nNational Enquirer: John Kasich's real dad was the milkman, not mailman \nNational Enquirer: Bound delegates from Colorado, Wyoming found in Ted Cruz’s basement \nIran breaks its pinky-swear promise not to support terrorism; US State Department vows rock-paper-scissors strategic response \nWomen across the country cheer as racist Democrat president on $20 bill is replaced by black pro-gun Republican \nFederal Reserve solves budget crisis by writing itself a 20-trillion-dollar check \nWidows, orphans claim responsibility for Brussels airport bombing \nChe Guevara's son hopes Cuba's communism will rub off on US, proposes a long list of people the government should execute first \nSusan Sarandon: \"I don't vote with my vagina.\" Voters in line behind her still suspicious, use hand sanitizer \nCampaign memo typo causes Hillary to court 'New Black Panties' vote \nNew Hampshire votes for socialist Sanders, changes state motto to \"Live FOR Free or Die\" \nMartin O'Malley drops out of race after Iowa Caucus; nation shocked with revelation he has been running for president \nStatisticians: one out of three Bernie Sanders supporters is just as dumb as the other two \nHillary campaign denies accusations of smoking-gun evidence in her emails, claims they contain only smoking-circumstantial-gun evidence \nObama stops short of firing US Congress upon realizing the difficulty of assembling another group of such tractable yes-men \nIn effort to contol wild passions for violent jihad, White House urges gun owners to keep their firearms covered in gun burkas \nTV horror live: A Charlie Brown Christmas gets shot up on air by Mohammed cartoons \nDemocrats vow to burn the country down over Ted Cruz statement, 'The overwhelming majority of violent criminals are Democrats' \nRussia's trend to sign bombs dropped on ISIS with \"This is for Paris\" found response in Obama administration's trend to sign American bombs with \"Return to sender\" \nUniversity researchers of cultural appropriation quit upon discovery that their research is appropriation from a culture that created universities \nArcheologists discover remains of what Barack Obama has described as unprecedented, un-American, and not-who-we-are immigration screening process in Ellis Island \nMizzou protests lead to declaring entire state a \"safe space,\" changing Missouri motto to \"The don't show me state\" \nGreen energy fact: if we put all green energy subsidies together in one-dollar bills and burn them, we could generate more electricity than has been produced by subsidized green energy \nState officials improve chances of healthcare payouts by replacing ObamaCare with state lottery \nNASA's new mission to search for racism, sexism, and economic inequality in deep space suffers from race, gender, and class power struggles over multibillion-dollar budget \nCollege progress enforcement squads issue schematic humor charts so students know if a joke may be spontaneously laughed at or if regulations require other action \nISIS opens suicide hotline for US teens depressed by climate change and other progressive doomsday scenarios \nVirginia county to close schools after teacher asks students to write 'death to America' in Arabic \n'Wear hijab to school day' ends with spontaneous female circumcision and stoning of a classmate during lunch break \nISIS releases new, even more barbaric video in an effort to regain mantle from Planned Parenthood \nImpressed by Fox News stellar rating during GOP debates, CNN to use same formula on Democrat candidates asking tough, pointed questions about Republicans \nShocking new book explores pros and cons of socialism, discovers they are same people \nPope outraged by Planned Parenthood's \"unfettered capitalism,\" demands equal redistribution of baby parts to each according to his need \nJohn Kerry accepts Iran's \"Golden Taquiyya\" award, requests jalapenos on the side \nCitizens of Pluto protest US government's surveillance of their planetoid and its moons with New Horizons space drone \nJohn Kerry proposes 3-day waiting period for all terrorist nations trying to acquire nuclear weapons \nChicago Police trying to identify flag that caused nine murders and 53 injuries in the city this past weekend \nCuba opens to affordable medical tourism for Americans who can't afford Obamacare deductibles \nState-funded research proves existence of Quantum Aggression Particles (Heterons) in Large Hadron Collider \nStudent job opportunities: make big bucks this summer as Hillary’s Ordinary-American; all expenses paid, travel, free acting lessons \nExperts debate whether Iranian negotiators broke John Kerry's leg or he did it himself to get out of negotiations \nJunior Varsity takes Ramadi, advances to quarterfinals \nUS media to GOP pool of candidates: 'Knowing what we know now, would you have had anything to do with the founding of the United States?' \nNY Mayor to hold peace talks with rats, apologize for previous Mayor's cowboy diplomacy \nChina launches cube-shaped space object with a message to aliens: \"The inhabitants of Earth will steal your intellectual property, copy it, manufacture it in sweatshops with slave labor, and sell it back to you at ridiculously low prices\" \nProgressive scientists: Truth is a variable deduced by subtracting 'what is' from 'what ought to be' \nExperts agree: Hillary Clinton best candidate to lessen percentage of Americans in top 1% \nAmerica's attempts at peace talks with the White House continue to be met with lies, stalling tactics, and bad faith \nStarbucks new policy to talk race with customers prompts new hashtag #DontHoldUpTheLine \nHillary: DELETE is the new RESET \nCharlie Hebdo receives Islamophobe 2015 award ; the cartoonists could not be reached for comment due to their inexplicable, illogical deaths \nRussia sends 'reset' button back to Hillary: 'You need it now more than we do' \nBarack Obama finds out from CNN that Hillary Clinton spent four years being his Secretary of State \nPresident Obama honors Leonard Nimoy by taking selfie in front of Starship Enterprise \nPolice: If Obama had a convenience store, it would look like Obama Express Food Market \nStudy finds stunning lack of racial, gender, and economic diversity among middle-class white males \nNASA: We're 80% sure about being 20% sure about being 17% sure about being 38% sure about 2014 being the hottest year on record \nPeople holding '$15 an Hour Now' posters sue Democratic party demanding raise to $15 an hour for rendered professional protesting services \nCuba-US normalization: US tourists flock to see Cuba before it looks like the US and Cubans flock to see the US before it looks like Cuba \nWhite House describes attacks on Sony Pictures as 'spontaneous hacking in response to offensive video mocking Juche and its prophet' \nCIA responds to Democrat calls for transparency by releasing the director's cut of The Making Of Obama's Birth Certificate \nObama: 'If I had a city, it would look like Ferguson' \nBiden: 'If I had a Ferguson (hic), it would look like a city' \nObama signs executive order renaming 'looters' to 'undocumented shoppers' \nEthicists agree: two wrongs do make a right so long as Bush did it first \nThe aftermath of the 'War on Women 2014' finds a new 'Lost Generation' of disillusioned Democrat politicians, unable to cope with life out of office \nWhite House: Republican takeover of the Senate is a clear mandate from the American people for President Obama to rule by executive orders \nNurse Kaci Hickox angrily tells reporters that she won't change her clocks for daylight savings time \nDemocratic Party leaders in panic after recent poll shows most Democratic voters think 'midterm' is when to end pregnancy \nDesperate Democratic candidates plead with Obama to stop backing them and instead support their GOP opponents \nEbola Czar issues five-year plan with mandatory quotas of Ebola infections per each state based on voting preferences \nStudy: crony capitalism is to the free market what the Westboro Baptist Church is to Christianity \nFun facts about world languages: the Left has more words for statism than the Eskimos have for snow \nAfrican countries to ban all flights from the United States because \"Obama is incompetent, it scares us\" \nNobel Peace Prize controversy: Hillary not nominated despite having done even less than Obama to deserve it \nObama: 'Ebola is the JV of viruses' \nBREAKING: Secret Service foils Secret Service plot to protect Obama \nRevised 1st Amendment: buy one speech, get the second free \nSharpton calls on white NFL players to beat their women in the interests of racial fairness \nPresident Obama appoints his weekly approval poll as new national security adviser \nObama wags pen and phone at Putin; Europe offers support with powerful pens and phones from NATO members \nWhite House pledges to embarrass ISIS back to the Stone Age with a barrage of fearsome Twitter messages and fatally ironic Instagram photos \nObama to fight ISIS with new federal Terrorist Regulatory Agency \nObama vows ISIS will never raise their flag over the eighteenth hole \nHarry Reid: \"Sometimes I say the wong thing\" \nElian Gonzalez wishes he had come to the U.S. on a bus from Central America like all the other kids \nObama visits US-Mexican border, calls for a two-state solution \nObama draws \"blue line\" in Iraq after Putin took away his red crayon \n\"Hard Choices,\" a porno flick loosely based on Hillary Clinton's memoir and starring Hillary Hellfire as a drinking, whoring Secretary of State, wildly outsells the flabby, sagging original \nAccusations of siding with the enemy leave Sgt. Bergdahl with only two options: pursue a doctorate at Berkley or become a Senator from Massachusetts \nJay Carney stuck in line behind Eric Shinseki to leave the White House; estimated wait time from 15 min to 6 weeks \n100% of scientists agree that if man-made global warming were real, \"the last people we'd want to help us is the Obama administration\" \nJay Carney says he found out that Obama found out that he found out that Obama found out that he found out about the latest Obama administration scandal on the news \n\"Anarchy Now!\" meeting turns into riot over points of order, bylaws, and whether or not 'kicking the #^@&*! ass' of the person trying to speak is or is not violence \nObama retaliates against Putin by prohibiting unionized federal employees from dating hot Russian girls online during work hours \nRussian separatists in Ukraine riot over an offensive YouTube video showing the toppling of Lenin statues \n\"Free Speech Zones\" confuse Obamaphone owners who roam streets in search of additional air minutes \nObamacare bolsters employment for professionals with skills to convert meth back into sudafed \nGloves finally off: Obama uses pen and phone to cancel Putin's Netflix account \nJoe Biden to Russia: \"We will bury you by turning more of Eastern Europe over to your control!\" \nIn last-ditch effort to help Ukraine, Obama deploys Rev. Sharpton and Rev. Jackson's Rainbow Coalition to Crimea \nAl Sharpton: \"Not even Putin can withstand our signature chanting, 'racist, sexist, anti-gay, Russian army go away'!\" \nMardi Gras in North Korea: \" Throw me some food! \" \nObama's foreign policy works: \"War, invasion, and conquest are signs of weakness; we've got Putin right where we want him\" \nUS offers military solution to Ukraine crisis: \"We will only fight countries that have LGBT military\" \nPutin annexes Brighton Beach to protect ethnic Russians in Brooklyn, Obama appeals to UN and EU for help \nThe 1980s: \"Mr. Obama, we're just calling to ask if you want our foreign policy back . The 1970s are right here with us, and they're wondering, too.\" \nIn a stunning act of defiance, Obama courageously unfriends Putin on Facebook \nMSNBC: Obama secures alliance with Austro-Hungarian Empire against Russia’s aggression in Ukraine \nStudy: springbreak is to STDs what April 15th is to accountants \nEfforts to achieve moisture justice for California thwarted by unfair redistribution of snow in America \nNorth Korean voters unanimous: \"We are the 100%\" \nLeader of authoritarian gulag-site, The People's Cube, unanimously 're-elected' with 100% voter turnout \nSuper Bowl: Obama blames Fox News for Broncos' loss \nFeminist author slams gay marriage: \"a man needs a man like a fish needs a bicycle\" \nBeverly Hills campaign heats up between Henry Waxman and Marianne Williamson over the widening income gap between millionaires and billionaires in their district \nBiden to lower $10,000-a-plate Dinner For The Homeless to $5,000 so more homeless can attend \nKim becomes world leader, feeds uncle to dogs; Obama eats dogs, becomes world leader, America cries uncle \nNorth Korean leader executes own uncle for talking about Obamacare at family Christmas party \nWhite House hires part-time schizophrenic Mandela sign interpreter to help sell Obamacare \nKim Jong Un executes own \" crazy uncle \" to keep him from ruining another family Christmas \nOFA admits its advice for area activists to give Obamacare Talk at shooting ranges was a bad idea \nPresident resolves Obamacare debacle with executive order declaring all Americans equally healthy \nObama to Iran: \"If you like your nuclear program, you can keep your nuclear program\" \nBovine community outraged by flatulence coming from Washington DC \nObama: \"I'm not particularly ideological; I believe in a good pragmatic five-year plan\" \nShocker: Obama had no knowledge he'd been reelected until he read about it in the local newspaper last week \nServer problems at HealthCare.gov so bad, it now flashes 'Error 808' message \nNSA marks National Best Friend Day with official announcement: \"Government is your best friend; we know you like no one else, we're always there, we're always willing to listen\" \nAl Qaeda cancels attack on USA citing launch of Obamacare as devastating enough \nThe President's latest talking point on Obamacare: \"I didn't build that\" \nDizzy with success, Obama renames his wildly popular healthcare mandate to HillaryCare \nCarney: huge ObamaCare deductibles won't look as bad come hyperinflation \nWashington Redskins drop 'Washington' from their name as offensive to most Americans \nPoll: 83% of Americans favor cowboy diplomacy over rodeo clown diplomacy \nGOVERNMENT WARNING: If you were able to complete ObamaCare form online, it wasn't a legitimate gov't website; you should report online fraud and change all your passwords \nObama administration gets serious, threatens Syria with ObamaCare \nObama authorizes the use of Vice President Joe Biden's double-barrel shotgun to fire a couple of blasts at Syria \nSharpton: \"British royals should have named baby 'Trayvon.' By choosing 'George' they sided with white Hispanic racist Zimmerman\" \nDNC launches 'Carlos Danger' action figure; proceeds to fund a charity helping survivors of the Republican War on Women \nNancy Pelosi extends abortion rights to the birds and the bees \nHubble discovers planetary drift to the left \nObama: 'If I had a daughter-in-law, she would look like Rachael Jeantel' \nFISA court rubberstamps statement denying its portrayal as government's rubber stamp \nEvery time ObamaCare gets delayed, a Julia somewhere dies \nGOP to Schumer: 'Force full implementation of ObamaCare before 2014 or Dems will never win another election' \nObama: 'If I had a son... no, wait, my daughter can now marry a woman!' \nJanet Napolitano: TSA findings reveal that since none of the hijackers were babies, elderly, or Tea Partiers, 9/11 was not an act of terrorism \nNews Flash: Sen. Mary Landrieu (D-LA) can see Canada from South Dakota \nSusan Rice: IRS actions against tea parties caused by anti-tax YouTube video that was insulting to their faith \nDrudge Report reduces font to fit all White House scandals onto one page \nObama: the IRS is a constitutional right, just like the Second Amendment \nWhite House: top Obama officials using secret email accounts a result of bad IT advice to avoid spam mail from Nigeria \nJay Carney to critics: 'Pinocchio never said anything inconsistent' \nObama: If I had a gay son, he'd look like Jason Collins \nGosnell's office in Benghazi raided by the IRS: mainstream media's worst cover-up challenge to date \nIRS targeting pro-gay-marriage LGBT groups leads to gayest tax revolt in U.S. history \nAfter Arlington Cemetery rejects offer to bury Boston bomber, Westboro Babtist Church steps up with premium front lawn plot \nBoston: Obama Administration to reclassify marathon bombing as 'sportsplace violence' \nStudy: Success has many fathers but failure becomes a government program \nUS Media: Can Pope Francis possibly clear up Vatican bureaucracy and banking without blaming the previous administration? \nMichelle Obama praises weekend rampage by Chicago teens as good way to burn calories and stay healthy \nThis Passover, Obama urges his subjects to paint lamb's blood above doors in order to avoid the Sequester \nWhite House to American children: Sequester causes layoffs among hens that lay Easter eggs; union-wage Easter Bunnies to be replaced by Mexican Chupacabras \nTime Mag names Hugo Chavez world's sexiest corpse \nBoy, 8, pretends banana is gun, makes daring escape from school \nStudy: Free lunches overpriced, lack nutrition \nOscars 2013: Michelle Obama announces long-awaited merger of Hollywood and the State \nJoe Salazar defends the right of women to be raped in gun-free environment: 'rapists and rapees should work together to prevent gun violence for the common good' \nDept. of Health and Human Services eliminates rape by reclassifying assailants as 'undocumented sex partners' \nKremlin puts out warning not to photoshop Putin riding meteor unless bare-chested \nDeeming football too violent, Obama moves to introduce Super Drone Sundays instead \nJapan offers to extend nuclear umbrella to cover U.S. should America suffer devastating attack on its own defense spending \nFeminists organize one billion women to protest male oppression with one billion lap dances \nUrban community protests Mayor Bloomberg's ban on extra-large pop singers owning assault weapons \nConcerned with mounting death toll, Taliban offers to send peacekeeping advisers to Chicago \nKarl Rove puts an end to Tea Party with new 'Republicans For Democrats' strategy aimed at losing elections \nAnswering public skepticism, President Obama authorizes unlimited drone attacks on all skeet targets throughout the country \nSkeet Ulrich denies claims he had been shot by President but considers changing his name to 'Traps' \nWhite House releases new exciting photos of Obama standing, sitting, looking thoughtful, and even breathing in and out \nNew York Times hacked by Chinese government, Paul Krugman's economic policies stolen \nWhite House: when President shoots skeet, he donates the meat to food banks that feed the middle class \nTo prove he is serious, Obama eliminates armed guard protection for President, Vice-President, and their families; establishes Gun-Free Zones around them instead \nState Dept to send 100,000 American college students to China as security for US debt obligations \nJay Carney: Al Qaeda is on the run, they're just running forward \nPresident issues executive orders banning cliffs, ceilings, obstructions, statistics, and other notions that prevent us from moving forwards and upward \nFearing the worst, Obama Administration outlaws the fan to prevent it from being hit by certain objects \nWorld ends; S&P soars \nRiddle of universe solved; answer not understood \nMeek inherit Earth, can't afford estate taxes \nGreece abandons Euro; accountants find Greece has no Euros anyway \nWheel finally reinvented; axles to be gradually reinvented in 3rd quarter of 2013 \nBigfoot found in Ohio, mysteriously not voting for Obama \nAs Santa's workshop files for bankruptcy, Fed offers bailout in exchange for control of 'naughty and nice' list \nFreak flying pig accident causes bacon to fly off shelves \nObama: green economy likely to transform America into a leading third world country of the new millennium \nReport: President Obama to visit the United States in the near future \nObama promises to create thousands more economically neutral jobs \nModernizing Islam: New York imam proposes to canonize Saul Alinsky as religion's latter day prophet \nImam Rauf's peaceful solution: 'Move Ground Zero a few blocks away from the mosque and no one gets hurt' \nStudy: Obama's threat to burn tax money in Washington 'recruitment bonanza' for Tea Parties \nStudy: no Social Security reform will be needed if gov't raises retirement age to at least 814 years \nObama attends church service, worships self \nObama proposes national 'Win The Future' lottery; proceeds of new WTF Powerball to finance more gov't spending \nHistorical revisionists: \"Hey, you never know\" \nVice President Biden: criticizing Egypt is un-pharaoh \nIsraelis to Egyptian rioters: \"don't damage the pyramids, we will not rebuild\" \nLake Superior renamed Lake Inferior in spirit of tolerance and inclusiveness \nAl Gore: It's a shame that a family can be torn apart by something as simple as a pack of polar bears \nMichael Moore: As long as there is anyone with money to shake down, this country is not broke \nObama's teleprompters unionize, demand collective bargaining rights \nObama calls new taxes 'spending reductions in tax code.' Elsewhere rapists tout 'consent reductions in sexual intercourse' \nObama's teleprompter unhappy with White House Twitter: \"Too few words\" \nObama's Regulation Reduction committee finds US Constitution to be expensive outdated framework inefficiently regulating federal gov't \nTaking a page from the Reagan years, Obama announces new era of Perestroika and Glasnost \nResponding to Oslo shootings, Obama declares Christianity \"Religion of Peace,\" praises \"moderate Christians,\" promises to send one into space \nRepublicans block Obama's $420 billion program to give American families free charms that ward off economic bad luck \nWhite House to impose Chimney tax on Santa Claus \nObama decrees the economy is not soaring as much as previously decreeed \nConservative think tank introduces children to capitalism with pop-up picture book \"The Road to Smurfdom\" \nAl Gore proposes to combat Global Warming by extracting silver linings from clouds in Earth's atmosphere \nObama refutes charges of him being unresponsive to people's suffering: \"When you pray to God, do you always hear a response?\" \nObama regrets the US government didn't provide his mother with free contraceptives when she was in college \nFluke to Congress: drill, baby, drill! \nPlanned Parenthood introduces Frequent Flucker reward card: 'Come again soon!' \nObama to tornado victims: 'We inherited this weather from the previous administration' \nObama congratulates Putin on Chicago-style election outcome \nPeople's Cube gives itself Hero of Socialist Labor medal in recognition of continued expert advice provided to the Obama Administration helping to shape its foreign and domestic policies \nHamas: Israeli air defense unfair to 99% of our missiles, \"only 1% allowed to reach Israel\" \nDemocrat strategist: without government supervision, women would have never evolved into humans \nVoters Without Borders oppose Texas new voter ID law \nEnraged by accusation that they are doing Obama's bidding, media leaders demand instructions from White House on how to respond \nObama blames previous Olympics for failure to win at this Olympics \nOfficial: China plans to land on Moon or at least on cheap knockoff thereof \nKoran-Contra: Obama secretly arms Syrian rebels \nPoll: Progressive slogan 'We should be more like Europe' most popular with members of American Nazi Party \nObama to Evangelicals: Jesus saves, I just spend \nMay Day: Anarchists plan, schedule, synchronize, and execute a coordinated campaign against all of the above \nMidwestern farmers hooked on new erotic novel \"50 Shades of Hay\" \nStudy: 99% of Liberals give the rest a bad name \nObama meets with Jewish leaders, proposes deeper circumcisions for the rich \nHistorians: Before HOPE & CHANGE there was HEMP & CHOOM at ten bucks a bag \nCancer once again fails to cure Venezuela of its \"President for Life\" \nTragic spelling error causes Muslim protesters to burn local boob-tube factory \nSecretary of Energy Steven Chu: due to energy conservation, the light at the end of the tunnel will be switched off \nObama Administration running food stamps across the border with Mexico in an operation code-named \"Fat And Furious\" \nPakistan explodes in protest over new Adobe Acrobat update; 17 local acrobats killed \nWhite House: \"Let them eat statistics\" \nSpecial Ops: if Benedict Arnold had a son, he would look like Barack Obama",
                              "label": 1,
                              "distance": 1.1844526529312134
                        },
                        {
                              "text": "In Hillary's America, email server scrubs you \nObama transfers his Nobel Peace Prize to anti-Trump rioters \nDemocrats blame Hillary's criminal e-mail server for her loss, demand it face prison \nAfraid of \"dangerous\" Trump presidency, protesters pre-emptively burn America down to the ground \nClinton Foundation in foreclosure as foreign donors demand refunds \nHillary Clinton blames YouTube video for unexpected and spontaneous voter uprising that prevented her inevitable move into the White House \nSudden rise in sea levels explained by disproportionately large tears shed by climate scientists in the aftermath of Trump's electoral victory \nFBI director Comey delighted after receiving Nobel Prize for Speed Reading (650,000 emails in one week) \nU.N. deploys troops to American college campuses in order to combat staggeringly low rape rates \nResponding to Trump's surging poll numbers, Obama preemptively pardons himself for treason \nFollowing hurricane Matthew's failure to devastate Florida, activists flock to the Sunshine State and destroy Trump signs manually \nTim Kaine takes credit for interrupting hurricane Matthew while debating weather in Florida \nStudy: Many non-voters still undecided on how they're not going to vote \nThe Evolution of Dissent: on November 8th the nation is to decide whether dissent will stop being racist and become sexist - or it will once again be patriotic as it was for 8 years under George W. Bush \nVenezuela solves starvation problem by making it mandatory to buy food \nBreaking: the Clinton Foundation set to investigate the FBI \nObama ​​captures rare Pokémon ​​while visiting Hiroshima \nMovie news: 'The Big Friendly Giant Government' flops at box office; audiences say \"It's creepy\" \nBarack Obama: \"If I had a son, he'd look like Micah Johnson\" \nWhite House edits Orlando 911 transcript to say shooter pledged allegiance to NRA and Republican Party \nPresident George Washington: 'Redcoats do not represent British Empire; King George promotes a distorted version of British colonialism' \nFollowing Obama's 'Okie-Doke' speech , stock of Okie-Doke soars; NASDAQ: 'Obama best Okie-Doke salesman' \nWeaponized baby formula threatens Planned Parenthood office; ACLU demands federal investigation of Gerber \nExperts: melting Antarctic glacier could cause sale levels to rise up to 80% off select items by this weekend \nTravel advisory: airlines now offering flights to front of TSA line \nAs Obama instructs his administration to get ready for presidential transition, Trump preemptively purchases 'T' keys for White House keyboards \nJohn Kasich self-identifies as GOP primary winner, demands access to White House bathroom \nUpcoming Trump/Kelly interview on FoxNews sponsored by 'Let's Make a Deal' and 'The Price is Right' \nNews from 2017: once the evacuation of Lena Dunham and 90% of other Hollywood celebrities to Canada is confirmed, Trump resigns from presidency: \"My work here is done\" \nNon-presidential candidate Paul Ryan pledges not to run for president in new non-presidential non-ad campaign \nTrump suggests creating 'Muslim database'; Obama symbolically protests by shredding White House guest logs beginning 2009 \nNational Enquirer: John Kasich's real dad was the milkman, not mailman \nNational Enquirer: Bound delegates from Colorado, Wyoming found in Ted Cruz’s basement \nIran breaks its pinky-swear promise not to support terrorism; US State Department vows rock-paper-scissors strategic response \nWomen across the country cheer as racist Democrat president on $20 bill is replaced by black pro-gun Republican \nFederal Reserve solves budget crisis by writing itself a 20-trillion-dollar check \nWidows, orphans claim responsibility for Brussels airport bombing \nChe Guevara's son hopes Cuba's communism will rub off on US, proposes a long list of people the government should execute first \nSusan Sarandon: \"I don't vote with my vagina.\" Voters in line behind her still suspicious, use hand sanitizer \nCampaign memo typo causes Hillary to court 'New Black Panties' vote \nNew Hampshire votes for socialist Sanders, changes state motto to \"Live FOR Free or Die\" \nMartin O'Malley drops out of race after Iowa Caucus; nation shocked with revelation he has been running for president \nStatisticians: one out of three Bernie Sanders supporters is just as dumb as the other two \nHillary campaign denies accusations of smoking-gun evidence in her emails, claims they contain only smoking-circumstantial-gun evidence \nObama stops short of firing US Congress upon realizing the difficulty of assembling another group of such tractable yes-men \nIn effort to contol wild passions for violent jihad, White House urges gun owners to keep their firearms covered in gun burkas \nTV horror live: A Charlie Brown Christmas gets shot up on air by Mohammed cartoons \nDemocrats vow to burn the country down over Ted Cruz statement, 'The overwhelming majority of violent criminals are Democrats' \nRussia's trend to sign bombs dropped on ISIS with \"This is for Paris\" found response in Obama administration's trend to sign American bombs with \"Return to sender\" \nUniversity researchers of cultural appropriation quit upon discovery that their research is appropriation from a culture that created universities \nArcheologists discover remains of what Barack Obama has described as unprecedented, un-American, and not-who-we-are immigration screening process in Ellis Island \nMizzou protests lead to declaring entire state a \"safe space,\" changing Missouri motto to \"The don't show me state\" \nGreen energy fact: if we put all green energy subsidies together in one-dollar bills and burn them, we could generate more electricity than has been produced by subsidized green energy \nState officials improve chances of healthcare payouts by replacing ObamaCare with state lottery \nNASA's new mission to search for racism, sexism, and economic inequality in deep space suffers from race, gender, and class power struggles over multibillion-dollar budget \nCollege progress enforcement squads issue schematic humor charts so students know if a joke may be spontaneously laughed at or if regulations require other action \nISIS opens suicide hotline for US teens depressed by climate change and other progressive doomsday scenarios \nVirginia county to close schools after teacher asks students to write 'death to America' in Arabic \n'Wear hijab to school day' ends with spontaneous female circumcision and stoning of a classmate during lunch break \nISIS releases new, even more barbaric video in an effort to regain mantle from Planned Parenthood \nImpressed by Fox News stellar rating during GOP debates, CNN to use same formula on Democrat candidates asking tough, pointed questions about Republicans \nShocking new book explores pros and cons of socialism, discovers they are same people \nPope outraged by Planned Parenthood's \"unfettered capitalism,\" demands equal redistribution of baby parts to each according to his need \nJohn Kerry accepts Iran's \"Golden Taquiyya\" award, requests jalapenos on the side \nCitizens of Pluto protest US government's surveillance of their planetoid and its moons with New Horizons space drone \nJohn Kerry proposes 3-day waiting period for all terrorist nations trying to acquire nuclear weapons \nChicago Police trying to identify flag that caused nine murders and 53 injuries in the city this past weekend \nCuba opens to affordable medical tourism for Americans who can't afford Obamacare deductibles \nState-funded research proves existence of Quantum Aggression Particles (Heterons) in Large Hadron Collider \nStudent job opportunities: make big bucks this summer as Hillary’s Ordinary-American; all expenses paid, travel, free acting lessons \nExperts debate whether Iranian negotiators broke John Kerry's leg or he did it himself to get out of negotiations \nJunior Varsity takes Ramadi, advances to quarterfinals \nUS media to GOP pool of candidates: 'Knowing what we know now, would you have had anything to do with the founding of the United States?' \nNY Mayor to hold peace talks with rats, apologize for previous Mayor's cowboy diplomacy \nChina launches cube-shaped space object with a message to aliens: \"The inhabitants of Earth will steal your intellectual property, copy it, manufacture it in sweatshops with slave labor, and sell it back to you at ridiculously low prices\" \nProgressive scientists: Truth is a variable deduced by subtracting 'what is' from 'what ought to be' \nExperts agree: Hillary Clinton best candidate to lessen percentage of Americans in top 1% \nAmerica's attempts at peace talks with the White House continue to be met with lies, stalling tactics, and bad faith \nStarbucks new policy to talk race with customers prompts new hashtag #DontHoldUpTheLine \nHillary: DELETE is the new RESET \nCharlie Hebdo receives Islamophobe 2015 award ; the cartoonists could not be reached for comment due to their inexplicable, illogical deaths \nRussia sends 'reset' button back to Hillary: 'You need it now more than we do' \nBarack Obama finds out from CNN that Hillary Clinton spent four years being his Secretary of State \nPresident Obama honors Leonard Nimoy by taking selfie in front of Starship Enterprise \nPolice: If Obama had a convenience store, it would look like Obama Express Food Market \nStudy finds stunning lack of racial, gender, and economic diversity among middle-class white males \nNASA: We're 80% sure about being 20% sure about being 17% sure about being 38% sure about 2014 being the hottest year on record \nPeople holding '$15 an Hour Now' posters sue Democratic party demanding raise to $15 an hour for rendered professional protesting services \nCuba-US normalization: US tourists flock to see Cuba before it looks like the US and Cubans flock to see the US before it looks like Cuba \nWhite House describes attacks on Sony Pictures as 'spontaneous hacking in response to offensive video mocking Juche and its prophet' \nCIA responds to Democrat calls for transparency by releasing the director's cut of The Making Of Obama's Birth Certificate \nObama: 'If I had a city, it would look like Ferguson' \nBiden: 'If I had a Ferguson (hic), it would look like a city' \nObama signs executive order renaming 'looters' to 'undocumented shoppers' \nEthicists agree: two wrongs do make a right so long as Bush did it first \nThe aftermath of the 'War on Women 2014' finds a new 'Lost Generation' of disillusioned Democrat politicians, unable to cope with life out of office \nWhite House: Republican takeover of the Senate is a clear mandate from the American people for President Obama to rule by executive orders \nNurse Kaci Hickox angrily tells reporters that she won't change her clocks for daylight savings time \nDemocratic Party leaders in panic after recent poll shows most Democratic voters think 'midterm' is when to end pregnancy \nDesperate Democratic candidates plead with Obama to stop backing them and instead support their GOP opponents \nEbola Czar issues five-year plan with mandatory quotas of Ebola infections per each state based on voting preferences \nStudy: crony capitalism is to the free market what the Westboro Baptist Church is to Christianity \nFun facts about world languages: the Left has more words for statism than the Eskimos have for snow \nAfrican countries to ban all flights from the United States because \"Obama is incompetent, it scares us\" \nNobel Peace Prize controversy: Hillary not nominated despite having done even less than Obama to deserve it \nObama: 'Ebola is the JV of viruses' \nBREAKING: Secret Service foils Secret Service plot to protect Obama \nRevised 1st Amendment: buy one speech, get the second free \nSharpton calls on white NFL players to beat their women in the interests of racial fairness \nPresident Obama appoints his weekly approval poll as new national security adviser \nObama wags pen and phone at Putin; Europe offers support with powerful pens and phones from NATO members \nWhite House pledges to embarrass ISIS back to the Stone Age with a barrage of fearsome Twitter messages and fatally ironic Instagram photos \nObama to fight ISIS with new federal Terrorist Regulatory Agency \nObama vows ISIS will never raise their flag over the eighteenth hole \nHarry Reid: \"Sometimes I say the wong thing\" \nElian Gonzalez wishes he had come to the U.S. on a bus from Central America like all the other kids \nObama visits US-Mexican border, calls for a two-state solution \nObama draws \"blue line\" in Iraq after Putin took away his red crayon \n\"Hard Choices,\" a porno flick loosely based on Hillary Clinton's memoir and starring Hillary Hellfire as a drinking, whoring Secretary of State, wildly outsells the flabby, sagging original \nAccusations of siding with the enemy leave Sgt. Bergdahl with only two options: pursue a doctorate at Berkley or become a Senator from Massachusetts \nJay Carney stuck in line behind Eric Shinseki to leave the White House; estimated wait time from 15 min to 6 weeks \n100% of scientists agree that if man-made global warming were real, \"the last people we'd want to help us is the Obama administration\" \nJay Carney says he found out that Obama found out that he found out that Obama found out that he found out about the latest Obama administration scandal on the news \n\"Anarchy Now!\" meeting turns into riot over points of order, bylaws, and whether or not 'kicking the #^@&*! ass' of the person trying to speak is or is not violence \nObama retaliates against Putin by prohibiting unionized federal employees from dating hot Russian girls online during work hours \nRussian separatists in Ukraine riot over an offensive YouTube video showing the toppling of Lenin statues \n\"Free Speech Zones\" confuse Obamaphone owners who roam streets in search of additional air minutes \nObamacare bolsters employment for professionals with skills to convert meth back into sudafed \nGloves finally off: Obama uses pen and phone to cancel Putin's Netflix account \nJoe Biden to Russia: \"We will bury you by turning more of Eastern Europe over to your control!\" \nIn last-ditch effort to help Ukraine, Obama deploys Rev. Sharpton and Rev. Jackson's Rainbow Coalition to Crimea \nAl Sharpton: \"Not even Putin can withstand our signature chanting, 'racist, sexist, anti-gay, Russian army go away'!\" \nMardi Gras in North Korea: \" Throw me some food! \" \nObama's foreign policy works: \"War, invasion, and conquest are signs of weakness; we've got Putin right where we want him\" \nUS offers military solution to Ukraine crisis: \"We will only fight countries that have LGBT military\" \nPutin annexes Brighton Beach to protect ethnic Russians in Brooklyn, Obama appeals to UN and EU for help \nThe 1980s: \"Mr. Obama, we're just calling to ask if you want our foreign policy back . The 1970s are right here with us, and they're wondering, too.\" \nIn a stunning act of defiance, Obama courageously unfriends Putin on Facebook \nMSNBC: Obama secures alliance with Austro-Hungarian Empire against Russia’s aggression in Ukraine \nStudy: springbreak is to STDs what April 15th is to accountants \nEfforts to achieve moisture justice for California thwarted by unfair redistribution of snow in America \nNorth Korean voters unanimous: \"We are the 100%\" \nLeader of authoritarian gulag-site, The People's Cube, unanimously 're-elected' with 100% voter turnout \nSuper Bowl: Obama blames Fox News for Broncos' loss \nFeminist author slams gay marriage: \"a man needs a man like a fish needs a bicycle\" \nBeverly Hills campaign heats up between Henry Waxman and Marianne Williamson over the widening income gap between millionaires and billionaires in their district \nBiden to lower $10,000-a-plate Dinner For The Homeless to $5,000 so more homeless can attend \nKim becomes world leader, feeds uncle to dogs; Obama eats dogs, becomes world leader, America cries uncle \nNorth Korean leader executes own uncle for talking about Obamacare at family Christmas party \nWhite House hires part-time schizophrenic Mandela sign interpreter to help sell Obamacare \nKim Jong Un executes own \" crazy uncle \" to keep him from ruining another family Christmas \nOFA admits its advice for area activists to give Obamacare Talk at shooting ranges was a bad idea \nPresident resolves Obamacare debacle with executive order declaring all Americans equally healthy \nObama to Iran: \"If you like your nuclear program, you can keep your nuclear program\" \nBovine community outraged by flatulence coming from Washington DC \nObama: \"I'm not particularly ideological; I believe in a good pragmatic five-year plan\" \nShocker: Obama had no knowledge he'd been reelected until he read about it in the local newspaper last week \nServer problems at HealthCare.gov so bad, it now flashes 'Error 808' message \nNSA marks National Best Friend Day with official announcement: \"Government is your best friend; we know you like no one else, we're always there, we're always willing to listen\" \nAl Qaeda cancels attack on USA citing launch of Obamacare as devastating enough \nThe President's latest talking point on Obamacare: \"I didn't build that\" \nDizzy with success, Obama renames his wildly popular healthcare mandate to HillaryCare \nCarney: huge ObamaCare deductibles won't look as bad come hyperinflation \nWashington Redskins drop 'Washington' from their name as offensive to most Americans \nPoll: 83% of Americans favor cowboy diplomacy over rodeo clown diplomacy \nGOVERNMENT WARNING: If you were able to complete ObamaCare form online, it wasn't a legitimate gov't website; you should report online fraud and change all your passwords \nObama administration gets serious, threatens Syria with ObamaCare \nObama authorizes the use of Vice President Joe Biden's double-barrel shotgun to fire a couple of blasts at Syria \nSharpton: \"British royals should have named baby 'Trayvon.' By choosing 'George' they sided with white Hispanic racist Zimmerman\" \nDNC launches 'Carlos Danger' action figure; proceeds to fund a charity helping survivors of the Republican War on Women \nNancy Pelosi extends abortion rights to the birds and the bees \nHubble discovers planetary drift to the left \nObama: 'If I had a daughter-in-law, she would look like Rachael Jeantel' \nFISA court rubberstamps statement denying its portrayal as government's rubber stamp \nEvery time ObamaCare gets delayed, a Julia somewhere dies \nGOP to Schumer: 'Force full implementation of ObamaCare before 2014 or Dems will never win another election' \nObama: 'If I had a son... no, wait, my daughter can now marry a woman!' \nJanet Napolitano: TSA findings reveal that since none of the hijackers were babies, elderly, or Tea Partiers, 9/11 was not an act of terrorism \nNews Flash: Sen. Mary Landrieu (D-LA) can see Canada from South Dakota \nSusan Rice: IRS actions against tea parties caused by anti-tax YouTube video that was insulting to their faith \nDrudge Report reduces font to fit all White House scandals onto one page \nObama: the IRS is a constitutional right, just like the Second Amendment \nWhite House: top Obama officials using secret email accounts a result of bad IT advice to avoid spam mail from Nigeria \nJay Carney to critics: 'Pinocchio never said anything inconsistent' \nObama: If I had a gay son, he'd look like Jason Collins \nGosnell's office in Benghazi raided by the IRS: mainstream media's worst cover-up challenge to date \nIRS targeting pro-gay-marriage LGBT groups leads to gayest tax revolt in U.S. history \nAfter Arlington Cemetery rejects offer to bury Boston bomber, Westboro Babtist Church steps up with premium front lawn plot \nBoston: Obama Administration to reclassify marathon bombing as 'sportsplace violence' \nStudy: Success has many fathers but failure becomes a government program \nUS Media: Can Pope Francis possibly clear up Vatican bureaucracy and banking without blaming the previous administration? \nMichelle Obama praises weekend rampage by Chicago teens as good way to burn calories and stay healthy \nThis Passover, Obama urges his subjects to paint lamb's blood above doors in order to avoid the Sequester \nWhite House to American children: Sequester causes layoffs among hens that lay Easter eggs; union-wage Easter Bunnies to be replaced by Mexican Chupacabras \nTime Mag names Hugo Chavez world's sexiest corpse \nBoy, 8, pretends banana is gun, makes daring escape from school \nStudy: Free lunches overpriced, lack nutrition \nOscars 2013: Michelle Obama announces long-awaited merger of Hollywood and the State \nJoe Salazar defends the right of women to be raped in gun-free environment: 'rapists and rapees should work together to prevent gun violence for the common good' \nDept. of Health and Human Services eliminates rape by reclassifying assailants as 'undocumented sex partners' \nKremlin puts out warning not to photoshop Putin riding meteor unless bare-chested \nDeeming football too violent, Obama moves to introduce Super Drone Sundays instead \nJapan offers to extend nuclear umbrella to cover U.S. should America suffer devastating attack on its own defense spending \nFeminists organize one billion women to protest male oppression with one billion lap dances \nUrban community protests Mayor Bloomberg's ban on extra-large pop singers owning assault weapons \nConcerned with mounting death toll, Taliban offers to send peacekeeping advisers to Chicago \nKarl Rove puts an end to Tea Party with new 'Republicans For Democrats' strategy aimed at losing elections \nAnswering public skepticism, President Obama authorizes unlimited drone attacks on all skeet targets throughout the country \nSkeet Ulrich denies claims he had been shot by President but considers changing his name to 'Traps' \nWhite House releases new exciting photos of Obama standing, sitting, looking thoughtful, and even breathing in and out \nNew York Times hacked by Chinese government, Paul Krugman's economic policies stolen \nWhite House: when President shoots skeet, he donates the meat to food banks that feed the middle class \nTo prove he is serious, Obama eliminates armed guard protection for President, Vice-President, and their families; establishes Gun-Free Zones around them instead \nState Dept to send 100,000 American college students to China as security for US debt obligations \nJay Carney: Al Qaeda is on the run, they're just running forward \nPresident issues executive orders banning cliffs, ceilings, obstructions, statistics, and other notions that prevent us from moving forwards and upward \nFearing the worst, Obama Administration outlaws the fan to prevent it from being hit by certain objects \nWorld ends; S&P soars \nRiddle of universe solved; answer not understood \nMeek inherit Earth, can't afford estate taxes \nGreece abandons Euro; accountants find Greece has no Euros anyway \nWheel finally reinvented; axles to be gradually reinvented in 3rd quarter of 2013 \nBigfoot found in Ohio, mysteriously not voting for Obama \nAs Santa's workshop files for bankruptcy, Fed offers bailout in exchange for control of 'naughty and nice' list \nFreak flying pig accident causes bacon to fly off shelves \nObama: green economy likely to transform America into a leading third world country of the new millennium \nReport: President Obama to visit the United States in the near future \nObama promises to create thousands more economically neutral jobs \nModernizing Islam: New York imam proposes to canonize Saul Alinsky as religion's latter day prophet \nImam Rauf's peaceful solution: 'Move Ground Zero a few blocks away from the mosque and no one gets hurt' \nStudy: Obama's threat to burn tax money in Washington 'recruitment bonanza' for Tea Parties \nStudy: no Social Security reform will be needed if gov't raises retirement age to at least 814 years \nObama attends church service, worships self \nObama proposes national 'Win The Future' lottery; proceeds of new WTF Powerball to finance more gov't spending \nHistorical revisionists: \"Hey, you never know\" \nVice President Biden: criticizing Egypt is un-pharaoh \nIsraelis to Egyptian rioters: \"don't damage the pyramids, we will not rebuild\" \nLake Superior renamed Lake Inferior in spirit of tolerance and inclusiveness \nAl Gore: It's a shame that a family can be torn apart by something as simple as a pack of polar bears \nMichael Moore: As long as there is anyone with money to shake down, this country is not broke \nObama's teleprompters unionize, demand collective bargaining rights \nObama calls new taxes 'spending reductions in tax code.' Elsewhere rapists tout 'consent reductions in sexual intercourse' \nObama's teleprompter unhappy with White House Twitter: \"Too few words\" \nObama's Regulation Reduction committee finds US Constitution to be expensive outdated framework inefficiently regulating federal gov't \nTaking a page from the Reagan years, Obama announces new era of Perestroika and Glasnost \nResponding to Oslo shootings, Obama declares Christianity \"Religion of Peace,\" praises \"moderate Christians,\" promises to send one into space \nRepublicans block Obama's $420 billion program to give American families free charms that ward off economic bad luck \nWhite House to impose Chimney tax on Santa Claus \nObama decrees the economy is not soaring as much as previously decreeed \nConservative think tank introduces children to capitalism with pop-up picture book \"The Road to Smurfdom\" \nAl Gore proposes to combat Global Warming by extracting silver linings from clouds in Earth's atmosphere \nObama refutes charges of him being unresponsive to people's suffering: \"When you pray to God, do you always hear a response?\" \nObama regrets the US government didn't provide his mother with free contraceptives when she was in college \nFluke to Congress: drill, baby, drill! \nPlanned Parenthood introduces Frequent Flucker reward card: 'Come again soon!' \nObama to tornado victims: 'We inherited this weather from the previous administration' \nObama congratulates Putin on Chicago-style election outcome \nPeople's Cube gives itself Hero of Socialist Labor medal in recognition of continued expert advice provided to the Obama Administration helping to shape its foreign and domestic policies \nHamas: Israeli air defense unfair to 99% of our missiles, \"only 1% allowed to reach Israel\" \nDemocrat strategist: without government supervision, women would have never evolved into humans \nVoters Without Borders oppose Texas new voter ID law \nEnraged by accusation that they are doing Obama's bidding, media leaders demand instructions from White House on how to respond \nObama blames previous Olympics for failure to win at this Olympics \nOfficial: China plans to land on Moon or at least on cheap knockoff thereof \nKoran-Contra: Obama secretly arms Syrian rebels \nPoll: Progressive slogan 'We should be more like Europe' most popular with members of American Nazi Party \nObama to Evangelicals: Jesus saves, I just spend \nMay Day: Anarchists plan, schedule, synchronize, and execute a coordinated campaign against all of the above \nMidwestern farmers hooked on new erotic novel \"50 Shades of Hay\" \nStudy: 99% of Liberals give the rest a bad name \nObama meets with Jewish leaders, proposes deeper circumcisions for the rich \nHistorians: Before HOPE & CHANGE there was HEMP & CHOOM at ten bucks a bag \nCancer once again fails to cure Venezuela of its \"President for Life\" \nTragic spelling error causes Muslim protesters to burn local boob-tube factory \nSecretary of Energy Steven Chu: due to energy conservation, the light at the end of the tunnel will be switched off \nObama Administration running food stamps across the border with Mexico in an operation code-named \"Fat And Furious\" \nPakistan explodes in protest over new Adobe Acrobat update; 17 local acrobats killed \nWhite House: \"Let them eat statistics\" \nSpecial Ops: if Benedict Arnold had a son, he would look like Barack Obama",
                              "label": 1,
                              "distance": 1.1846661567687988
                        },
                        {
                              "text": "In Hillary's America, email server scrubs you \nObama transfers his Nobel Peace Prize to anti-Trump rioters \nDemocrats blame Hillary's criminal e-mail server for her loss, demand it face prison \nAfraid of \"dangerous\" Trump presidency, protesters pre-emptively burn America down to the ground \nClinton Foundation in foreclosure as foreign donors demand refunds \nHillary Clinton blames YouTube video for unexpected and spontaneous voter uprising that prevented her inevitable move into the White House \nSudden rise in sea levels explained by disproportionately large tears shed by climate scientists in the aftermath of Trump's electoral victory \nFBI director Comey delighted after receiving Nobel Prize for Speed Reading (650,000 emails in one week) \nU.N. deploys troops to American college campuses in order to combat staggeringly low rape rates \nResponding to Trump's surging poll numbers, Obama preemptively pardons himself for treason \nFollowing hurricane Matthew's failure to devastate Florida, activists flock to the Sunshine State and destroy Trump signs manually \nTim Kaine takes credit for interrupting hurricane Matthew while debating weather in Florida \nStudy: Many non-voters still undecided on how they're not going to vote \nThe Evolution of Dissent: on November 8th the nation is to decide whether dissent will stop being racist and become sexist - or it will once again be patriotic as it was for 8 years under George W. Bush \nVenezuela solves starvation problem by making it mandatory to buy food \nBreaking: the Clinton Foundation set to investigate the FBI \nObama ​​captures rare Pokémon ​​while visiting Hiroshima \nMovie news: 'The Big Friendly Giant Government' flops at box office; audiences say \"It's creepy\" \nBarack Obama: \"If I had a son, he'd look like Micah Johnson\" \nWhite House edits Orlando 911 transcript to say shooter pledged allegiance to NRA and Republican Party \nPresident George Washington: 'Redcoats do not represent British Empire; King George promotes a distorted version of British colonialism' \nFollowing Obama's 'Okie-Doke' speech , stock of Okie-Doke soars; NASDAQ: 'Obama best Okie-Doke salesman' \nWeaponized baby formula threatens Planned Parenthood office; ACLU demands federal investigation of Gerber \nExperts: melting Antarctic glacier could cause sale levels to rise up to 80% off select items by this weekend \nTravel advisory: airlines now offering flights to front of TSA line \nAs Obama instructs his administration to get ready for presidential transition, Trump preemptively purchases 'T' keys for White House keyboards \nJohn Kasich self-identifies as GOP primary winner, demands access to White House bathroom \nUpcoming Trump/Kelly interview on FoxNews sponsored by 'Let's Make a Deal' and 'The Price is Right' \nNews from 2017: once the evacuation of Lena Dunham and 90% of other Hollywood celebrities to Canada is confirmed, Trump resigns from presidency: \"My work here is done\" \nNon-presidential candidate Paul Ryan pledges not to run for president in new non-presidential non-ad campaign \nTrump suggests creating 'Muslim database'; Obama symbolically protests by shredding White House guest logs beginning 2009 \nNational Enquirer: John Kasich's real dad was the milkman, not mailman \nNational Enquirer: Bound delegates from Colorado, Wyoming found in Ted Cruz’s basement \nIran breaks its pinky-swear promise not to support terrorism; US State Department vows rock-paper-scissors strategic response \nWomen across the country cheer as racist Democrat president on $20 bill is replaced by black pro-gun Republican \nFederal Reserve solves budget crisis by writing itself a 20-trillion-dollar check \nWidows, orphans claim responsibility for Brussels airport bombing \nChe Guevara's son hopes Cuba's communism will rub off on US, proposes a long list of people the government should execute first \nSusan Sarandon: \"I don't vote with my vagina.\" Voters in line behind her still suspicious, use hand sanitizer \nCampaign memo typo causes Hillary to court 'New Black Panties' vote \nNew Hampshire votes for socialist Sanders, changes state motto to \"Live FOR Free or Die\" \nMartin O'Malley drops out of race after Iowa Caucus; nation shocked with revelation he has been running for president \nStatisticians: one out of three Bernie Sanders supporters is just as dumb as the other two \nHillary campaign denies accusations of smoking-gun evidence in her emails, claims they contain only smoking-circumstantial-gun evidence \nObama stops short of firing US Congress upon realizing the difficulty of assembling another group of such tractable yes-men \nIn effort to contol wild passions for violent jihad, White House urges gun owners to keep their firearms covered in gun burkas \nTV horror live: A Charlie Brown Christmas gets shot up on air by Mohammed cartoons \nDemocrats vow to burn the country down over Ted Cruz statement, 'The overwhelming majority of violent criminals are Democrats' \nRussia's trend to sign bombs dropped on ISIS with \"This is for Paris\" found response in Obama administration's trend to sign American bombs with \"Return to sender\" \nUniversity researchers of cultural appropriation quit upon discovery that their research is appropriation from a culture that created universities \nArcheologists discover remains of what Barack Obama has described as unprecedented, un-American, and not-who-we-are immigration screening process in Ellis Island \nMizzou protests lead to declaring entire state a \"safe space,\" changing Missouri motto to \"The don't show me state\" \nGreen energy fact: if we put all green energy subsidies together in one-dollar bills and burn them, we could generate more electricity than has been produced by subsidized green energy \nState officials improve chances of healthcare payouts by replacing ObamaCare with state lottery \nNASA's new mission to search for racism, sexism, and economic inequality in deep space suffers from race, gender, and class power struggles over multibillion-dollar budget \nCollege progress enforcement squads issue schematic humor charts so students know if a joke may be spontaneously laughed at or if regulations require other action \nISIS opens suicide hotline for US teens depressed by climate change and other progressive doomsday scenarios \nVirginia county to close schools after teacher asks students to write 'death to America' in Arabic \n'Wear hijab to school day' ends with spontaneous female circumcision and stoning of a classmate during lunch break \nISIS releases new, even more barbaric video in an effort to regain mantle from Planned Parenthood \nImpressed by Fox News stellar rating during GOP debates, CNN to use same formula on Democrat candidates asking tough, pointed questions about Republicans \nShocking new book explores pros and cons of socialism, discovers they are same people \nPope outraged by Planned Parenthood's \"unfettered capitalism,\" demands equal redistribution of baby parts to each according to his need \nJohn Kerry accepts Iran's \"Golden Taquiyya\" award, requests jalapenos on the side \nCitizens of Pluto protest US government's surveillance of their planetoid and its moons with New Horizons space drone \nJohn Kerry proposes 3-day waiting period for all terrorist nations trying to acquire nuclear weapons \nChicago Police trying to identify flag that caused nine murders and 53 injuries in the city this past weekend \nCuba opens to affordable medical tourism for Americans who can't afford Obamacare deductibles \nState-funded research proves existence of Quantum Aggression Particles (Heterons) in Large Hadron Collider \nStudent job opportunities: make big bucks this summer as Hillary’s Ordinary-American; all expenses paid, travel, free acting lessons \nExperts debate whether Iranian negotiators broke John Kerry's leg or he did it himself to get out of negotiations \nJunior Varsity takes Ramadi, advances to quarterfinals \nUS media to GOP pool of candidates: 'Knowing what we know now, would you have had anything to do with the founding of the United States?' \nNY Mayor to hold peace talks with rats, apologize for previous Mayor's cowboy diplomacy \nChina launches cube-shaped space object with a message to aliens: \"The inhabitants of Earth will steal your intellectual property, copy it, manufacture it in sweatshops with slave labor, and sell it back to you at ridiculously low prices\" \nProgressive scientists: Truth is a variable deduced by subtracting 'what is' from 'what ought to be' \nExperts agree: Hillary Clinton best candidate to lessen percentage of Americans in top 1% \nAmerica's attempts at peace talks with the White House continue to be met with lies, stalling tactics, and bad faith \nStarbucks new policy to talk race with customers prompts new hashtag #DontHoldUpTheLine \nHillary: DELETE is the new RESET \nCharlie Hebdo receives Islamophobe 2015 award ; the cartoonists could not be reached for comment due to their inexplicable, illogical deaths \nRussia sends 'reset' button back to Hillary: 'You need it now more than we do' \nBarack Obama finds out from CNN that Hillary Clinton spent four years being his Secretary of State \nPresident Obama honors Leonard Nimoy by taking selfie in front of Starship Enterprise \nPolice: If Obama had a convenience store, it would look like Obama Express Food Market \nStudy finds stunning lack of racial, gender, and economic diversity among middle-class white males \nNASA: We're 80% sure about being 20% sure about being 17% sure about being 38% sure about 2014 being the hottest year on record \nPeople holding '$15 an Hour Now' posters sue Democratic party demanding raise to $15 an hour for rendered professional protesting services \nCuba-US normalization: US tourists flock to see Cuba before it looks like the US and Cubans flock to see the US before it looks like Cuba \nWhite House describes attacks on Sony Pictures as 'spontaneous hacking in response to offensive video mocking Juche and its prophet' \nCIA responds to Democrat calls for transparency by releasing the director's cut of The Making Of Obama's Birth Certificate \nObama: 'If I had a city, it would look like Ferguson' \nBiden: 'If I had a Ferguson (hic), it would look like a city' \nObama signs executive order renaming 'looters' to 'undocumented shoppers' \nEthicists agree: two wrongs do make a right so long as Bush did it first \nThe aftermath of the 'War on Women 2014' finds a new 'Lost Generation' of disillusioned Democrat politicians, unable to cope with life out of office \nWhite House: Republican takeover of the Senate is a clear mandate from the American people for President Obama to rule by executive orders \nNurse Kaci Hickox angrily tells reporters that she won't change her clocks for daylight savings time \nDemocratic Party leaders in panic after recent poll shows most Democratic voters think 'midterm' is when to end pregnancy \nDesperate Democratic candidates plead with Obama to stop backing them and instead support their GOP opponents \nEbola Czar issues five-year plan with mandatory quotas of Ebola infections per each state based on voting preferences \nStudy: crony capitalism is to the free market what the Westboro Baptist Church is to Christianity \nFun facts about world languages: the Left has more words for statism than the Eskimos have for snow \nAfrican countries to ban all flights from the United States because \"Obama is incompetent, it scares us\" \nNobel Peace Prize controversy: Hillary not nominated despite having done even less than Obama to deserve it \nObama: 'Ebola is the JV of viruses' \nBREAKING: Secret Service foils Secret Service plot to protect Obama \nRevised 1st Amendment: buy one speech, get the second free \nSharpton calls on white NFL players to beat their women in the interests of racial fairness \nPresident Obama appoints his weekly approval poll as new national security adviser \nObama wags pen and phone at Putin; Europe offers support with powerful pens and phones from NATO members \nWhite House pledges to embarrass ISIS back to the Stone Age with a barrage of fearsome Twitter messages and fatally ironic Instagram photos \nObama to fight ISIS with new federal Terrorist Regulatory Agency \nObama vows ISIS will never raise their flag over the eighteenth hole \nHarry Reid: \"Sometimes I say the wong thing\" \nElian Gonzalez wishes he had come to the U.S. on a bus from Central America like all the other kids \nObama visits US-Mexican border, calls for a two-state solution \nObama draws \"blue line\" in Iraq after Putin took away his red crayon \n\"Hard Choices,\" a porno flick loosely based on Hillary Clinton's memoir and starring Hillary Hellfire as a drinking, whoring Secretary of State, wildly outsells the flabby, sagging original \nAccusations of siding with the enemy leave Sgt. Bergdahl with only two options: pursue a doctorate at Berkley or become a Senator from Massachusetts \nJay Carney stuck in line behind Eric Shinseki to leave the White House; estimated wait time from 15 min to 6 weeks \n100% of scientists agree that if man-made global warming were real, \"the last people we'd want to help us is the Obama administration\" \nJay Carney says he found out that Obama found out that he found out that Obama found out that he found out about the latest Obama administration scandal on the news \n\"Anarchy Now!\" meeting turns into riot over points of order, bylaws, and whether or not 'kicking the #^@&*! ass' of the person trying to speak is or is not violence \nObama retaliates against Putin by prohibiting unionized federal employees from dating hot Russian girls online during work hours \nRussian separatists in Ukraine riot over an offensive YouTube video showing the toppling of Lenin statues \n\"Free Speech Zones\" confuse Obamaphone owners who roam streets in search of additional air minutes \nObamacare bolsters employment for professionals with skills to convert meth back into sudafed \nGloves finally off: Obama uses pen and phone to cancel Putin's Netflix account \nJoe Biden to Russia: \"We will bury you by turning more of Eastern Europe over to your control!\" \nIn last-ditch effort to help Ukraine, Obama deploys Rev. Sharpton and Rev. Jackson's Rainbow Coalition to Crimea \nAl Sharpton: \"Not even Putin can withstand our signature chanting, 'racist, sexist, anti-gay, Russian army go away'!\" \nMardi Gras in North Korea: \" Throw me some food! \" \nObama's foreign policy works: \"War, invasion, and conquest are signs of weakness; we've got Putin right where we want him\" \nUS offers military solution to Ukraine crisis: \"We will only fight countries that have LGBT military\" \nPutin annexes Brighton Beach to protect ethnic Russians in Brooklyn, Obama appeals to UN and EU for help \nThe 1980s: \"Mr. Obama, we're just calling to ask if you want our foreign policy back . The 1970s are right here with us, and they're wondering, too.\" \nIn a stunning act of defiance, Obama courageously unfriends Putin on Facebook \nMSNBC: Obama secures alliance with Austro-Hungarian Empire against Russia’s aggression in Ukraine \nStudy: springbreak is to STDs what April 15th is to accountants \nEfforts to achieve moisture justice for California thwarted by unfair redistribution of snow in America \nNorth Korean voters unanimous: \"We are the 100%\" \nLeader of authoritarian gulag-site, The People's Cube, unanimously 're-elected' with 100% voter turnout \nSuper Bowl: Obama blames Fox News for Broncos' loss \nFeminist author slams gay marriage: \"a man needs a man like a fish needs a bicycle\" \nBeverly Hills campaign heats up between Henry Waxman and Marianne Williamson over the widening income gap between millionaires and billionaires in their district \nBiden to lower $10,000-a-plate Dinner For The Homeless to $5,000 so more homeless can attend \nKim becomes world leader, feeds uncle to dogs; Obama eats dogs, becomes world leader, America cries uncle \nNorth Korean leader executes own uncle for talking about Obamacare at family Christmas party \nWhite House hires part-time schizophrenic Mandela sign interpreter to help sell Obamacare \nKim Jong Un executes own \" crazy uncle \" to keep him from ruining another family Christmas \nOFA admits its advice for area activists to give Obamacare Talk at shooting ranges was a bad idea \nPresident resolves Obamacare debacle with executive order declaring all Americans equally healthy \nObama to Iran: \"If you like your nuclear program, you can keep your nuclear program\" \nBovine community outraged by flatulence coming from Washington DC \nObama: \"I'm not particularly ideological; I believe in a good pragmatic five-year plan\" \nShocker: Obama had no knowledge he'd been reelected until he read about it in the local newspaper last week \nServer problems at HealthCare.gov so bad, it now flashes 'Error 808' message \nNSA marks National Best Friend Day with official announcement: \"Government is your best friend; we know you like no one else, we're always there, we're always willing to listen\" \nAl Qaeda cancels attack on USA citing launch of Obamacare as devastating enough \nThe President's latest talking point on Obamacare: \"I didn't build that\" \nDizzy with success, Obama renames his wildly popular healthcare mandate to HillaryCare \nCarney: huge ObamaCare deductibles won't look as bad come hyperinflation \nWashington Redskins drop 'Washington' from their name as offensive to most Americans \nPoll: 83% of Americans favor cowboy diplomacy over rodeo clown diplomacy \nGOVERNMENT WARNING: If you were able to complete ObamaCare form online, it wasn't a legitimate gov't website; you should report online fraud and change all your passwords \nObama administration gets serious, threatens Syria with ObamaCare \nObama authorizes the use of Vice President Joe Biden's double-barrel shotgun to fire a couple of blasts at Syria \nSharpton: \"British royals should have named baby 'Trayvon.' By choosing 'George' they sided with white Hispanic racist Zimmerman\" \nDNC launches 'Carlos Danger' action figure; proceeds to fund a charity helping survivors of the Republican War on Women \nNancy Pelosi extends abortion rights to the birds and the bees \nHubble discovers planetary drift to the left \nObama: 'If I had a daughter-in-law, she would look like Rachael Jeantel' \nFISA court rubberstamps statement denying its portrayal as government's rubber stamp \nEvery time ObamaCare gets delayed, a Julia somewhere dies \nGOP to Schumer: 'Force full implementation of ObamaCare before 2014 or Dems will never win another election' \nObama: 'If I had a son... no, wait, my daughter can now marry a woman!' \nJanet Napolitano: TSA findings reveal that since none of the hijackers were babies, elderly, or Tea Partiers, 9/11 was not an act of terrorism \nNews Flash: Sen. Mary Landrieu (D-LA) can see Canada from South Dakota \nSusan Rice: IRS actions against tea parties caused by anti-tax YouTube video that was insulting to their faith \nDrudge Report reduces font to fit all White House scandals onto one page \nObama: the IRS is a constitutional right, just like the Second Amendment \nWhite House: top Obama officials using secret email accounts a result of bad IT advice to avoid spam mail from Nigeria \nJay Carney to critics: 'Pinocchio never said anything inconsistent' \nObama: If I had a gay son, he'd look like Jason Collins \nGosnell's office in Benghazi raided by the IRS: mainstream media's worst cover-up challenge to date \nIRS targeting pro-gay-marriage LGBT groups leads to gayest tax revolt in U.S. history \nAfter Arlington Cemetery rejects offer to bury Boston bomber, Westboro Babtist Church steps up with premium front lawn plot \nBoston: Obama Administration to reclassify marathon bombing as 'sportsplace violence' \nStudy: Success has many fathers but failure becomes a government program \nUS Media: Can Pope Francis possibly clear up Vatican bureaucracy and banking without blaming the previous administration? \nMichelle Obama praises weekend rampage by Chicago teens as good way to burn calories and stay healthy \nThis Passover, Obama urges his subjects to paint lamb's blood above doors in order to avoid the Sequester \nWhite House to American children: Sequester causes layoffs among hens that lay Easter eggs; union-wage Easter Bunnies to be replaced by Mexican Chupacabras \nTime Mag names Hugo Chavez world's sexiest corpse \nBoy, 8, pretends banana is gun, makes daring escape from school \nStudy: Free lunches overpriced, lack nutrition \nOscars 2013: Michelle Obama announces long-awaited merger of Hollywood and the State \nJoe Salazar defends the right of women to be raped in gun-free environment: 'rapists and rapees should work together to prevent gun violence for the common good' \nDept. of Health and Human Services eliminates rape by reclassifying assailants as 'undocumented sex partners' \nKremlin puts out warning not to photoshop Putin riding meteor unless bare-chested \nDeeming football too violent, Obama moves to introduce Super Drone Sundays instead \nJapan offers to extend nuclear umbrella to cover U.S. should America suffer devastating attack on its own defense spending \nFeminists organize one billion women to protest male oppression with one billion lap dances \nUrban community protests Mayor Bloomberg's ban on extra-large pop singers owning assault weapons \nConcerned with mounting death toll, Taliban offers to send peacekeeping advisers to Chicago \nKarl Rove puts an end to Tea Party with new 'Republicans For Democrats' strategy aimed at losing elections \nAnswering public skepticism, President Obama authorizes unlimited drone attacks on all skeet targets throughout the country \nSkeet Ulrich denies claims he had been shot by President but considers changing his name to 'Traps' \nWhite House releases new exciting photos of Obama standing, sitting, looking thoughtful, and even breathing in and out \nNew York Times hacked by Chinese government, Paul Krugman's economic policies stolen \nWhite House: when President shoots skeet, he donates the meat to food banks that feed the middle class \nTo prove he is serious, Obama eliminates armed guard protection for President, Vice-President, and their families; establishes Gun-Free Zones around them instead \nState Dept to send 100,000 American college students to China as security for US debt obligations \nJay Carney: Al Qaeda is on the run, they're just running forward \nPresident issues executive orders banning cliffs, ceilings, obstructions, statistics, and other notions that prevent us from moving forwards and upward \nFearing the worst, Obama Administration outlaws the fan to prevent it from being hit by certain objects \nWorld ends; S&P soars \nRiddle of universe solved; answer not understood \nMeek inherit Earth, can't afford estate taxes \nGreece abandons Euro; accountants find Greece has no Euros anyway \nWheel finally reinvented; axles to be gradually reinvented in 3rd quarter of 2013 \nBigfoot found in Ohio, mysteriously not voting for Obama \nAs Santa's workshop files for bankruptcy, Fed offers bailout in exchange for control of 'naughty and nice' list \nFreak flying pig accident causes bacon to fly off shelves \nObama: green economy likely to transform America into a leading third world country of the new millennium \nReport: President Obama to visit the United States in the near future \nObama promises to create thousands more economically neutral jobs \nModernizing Islam: New York imam proposes to canonize Saul Alinsky as religion's latter day prophet \nImam Rauf's peaceful solution: 'Move Ground Zero a few blocks away from the mosque and no one gets hurt' \nStudy: Obama's threat to burn tax money in Washington 'recruitment bonanza' for Tea Parties \nStudy: no Social Security reform will be needed if gov't raises retirement age to at least 814 years \nObama attends church service, worships self \nObama proposes national 'Win The Future' lottery; proceeds of new WTF Powerball to finance more gov't spending \nHistorical revisionists: \"Hey, you never know\" \nVice President Biden: criticizing Egypt is un-pharaoh \nIsraelis to Egyptian rioters: \"don't damage the pyramids, we will not rebuild\" \nLake Superior renamed Lake Inferior in spirit of tolerance and inclusiveness \nAl Gore: It's a shame that a family can be torn apart by something as simple as a pack of polar bears \nMichael Moore: As long as there is anyone with money to shake down, this country is not broke \nObama's teleprompters unionize, demand collective bargaining rights \nObama calls new taxes 'spending reductions in tax code.' Elsewhere rapists tout 'consent reductions in sexual intercourse' \nObama's teleprompter unhappy with White House Twitter: \"Too few words\" \nObama's Regulation Reduction committee finds US Constitution to be expensive outdated framework inefficiently regulating federal gov't \nTaking a page from the Reagan years, Obama announces new era of Perestroika and Glasnost \nResponding to Oslo shootings, Obama declares Christianity \"Religion of Peace,\" praises \"moderate Christians,\" promises to send one into space \nRepublicans block Obama's $420 billion program to give American families free charms that ward off economic bad luck \nWhite House to impose Chimney tax on Santa Claus \nObama decrees the economy is not soaring as much as previously decreeed \nConservative think tank introduces children to capitalism with pop-up picture book \"The Road to Smurfdom\" \nAl Gore proposes to combat Global Warming by extracting silver linings from clouds in Earth's atmosphere \nObama refutes charges of him being unresponsive to people's suffering: \"When you pray to God, do you always hear a response?\" \nObama regrets the US government didn't provide his mother with free contraceptives when she was in college \nFluke to Congress: drill, baby, drill! \nPlanned Parenthood introduces Frequent Flucker reward card: 'Come again soon!' \nObama to tornado victims: 'We inherited this weather from the previous administration' \nObama congratulates Putin on Chicago-style election outcome \nPeople's Cube gives itself Hero of Socialist Labor medal in recognition of continued expert advice provided to the Obama Administration helping to shape its foreign and domestic policies \nHamas: Israeli air defense unfair to 99% of our missiles, \"only 1% allowed to reach Israel\" \nDemocrat strategist: without government supervision, women would have never evolved into humans \nVoters Without Borders oppose Texas new voter ID law \nEnraged by accusation that they are doing Obama's bidding, media leaders demand instructions from White House on how to respond \nObama blames previous Olympics for failure to win at this Olympics \nOfficial: China plans to land on Moon or at least on cheap knockoff thereof \nKoran-Contra: Obama secretly arms Syrian rebels \nPoll: Progressive slogan 'We should be more like Europe' most popular with members of American Nazi Party \nObama to Evangelicals: Jesus saves, I just spend \nMay Day: Anarchists plan, schedule, synchronize, and execute a coordinated campaign against all of the above \nMidwestern farmers hooked on new erotic novel \"50 Shades of Hay\" \nStudy: 99% of Liberals give the rest a bad name \nObama meets with Jewish leaders, proposes deeper circumcisions for the rich \nHistorians: Before HOPE & CHANGE there was HEMP & CHOOM at ten bucks a bag \nCancer once again fails to cure Venezuela of its \"President for Life\" \nTragic spelling error causes Muslim protesters to burn local boob-tube factory \nSecretary of Energy Steven Chu: due to energy conservation, the light at the end of the tunnel will be switched off \nObama Administration running food stamps across the border with Mexico in an operation code-named \"Fat And Furious\" \nPakistan explodes in protest over new Adobe Acrobat update; 17 local acrobats killed \nWhite House: \"Let them eat statistics\" \nSpecial Ops: if Benedict Arnold had a son, he would look like Barack Obama",
                              "label": 1,
                              "distance": 1.1846661567687988
                        },
                        {
                              "text": "In Hillary's America, email server scrubs you \nObama transfers his Nobel Peace Prize to anti-Trump rioters \nDemocrats blame Hillary's criminal e-mail server for her loss, demand it face prison \nAfraid of \"dangerous\" Trump presidency, protesters pre-emptively burn America down to the ground \nClinton Foundation in foreclosure as foreign donors demand refunds \nHillary Clinton blames YouTube video for unexpected and spontaneous voter uprising that prevented her inevitable move into the White House \nSudden rise in sea levels explained by disproportionately large tears shed by climate scientists in the aftermath of Trump's electoral victory \nFBI director Comey delighted after receiving Nobel Prize for Speed Reading (650,000 emails in one week) \nU.N. deploys troops to American college campuses in order to combat staggeringly low rape rates \nResponding to Trump's surging poll numbers, Obama preemptively pardons himself for treason \nFollowing hurricane Matthew's failure to devastate Florida, activists flock to the Sunshine State and destroy Trump signs manually \nTim Kaine takes credit for interrupting hurricane Matthew while debating weather in Florida \nStudy: Many non-voters still undecided on how they're not going to vote \nThe Evolution of Dissent: on November 8th the nation is to decide whether dissent will stop being racist and become sexist - or it will once again be patriotic as it was for 8 years under George W. Bush \nVenezuela solves starvation problem by making it mandatory to buy food \nBreaking: the Clinton Foundation set to investigate the FBI \nObama ​​captures rare Pokémon ​​while visiting Hiroshima \nMovie news: 'The Big Friendly Giant Government' flops at box office; audiences say \"It's creepy\" \nBarack Obama: \"If I had a son, he'd look like Micah Johnson\" \nWhite House edits Orlando 911 transcript to say shooter pledged allegiance to NRA and Republican Party \nPresident George Washington: 'Redcoats do not represent British Empire; King George promotes a distorted version of British colonialism' \nFollowing Obama's 'Okie-Doke' speech , stock of Okie-Doke soars; NASDAQ: 'Obama best Okie-Doke salesman' \nWeaponized baby formula threatens Planned Parenthood office; ACLU demands federal investigation of Gerber \nExperts: melting Antarctic glacier could cause sale levels to rise up to 80% off select items by this weekend \nTravel advisory: airlines now offering flights to front of TSA line \nAs Obama instructs his administration to get ready for presidential transition, Trump preemptively purchases 'T' keys for White House keyboards \nJohn Kasich self-identifies as GOP primary winner, demands access to White House bathroom \nUpcoming Trump/Kelly interview on FoxNews sponsored by 'Let's Make a Deal' and 'The Price is Right' \nNews from 2017: once the evacuation of Lena Dunham and 90% of other Hollywood celebrities to Canada is confirmed, Trump resigns from presidency: \"My work here is done\" \nNon-presidential candidate Paul Ryan pledges not to run for president in new non-presidential non-ad campaign \nTrump suggests creating 'Muslim database'; Obama symbolically protests by shredding White House guest logs beginning 2009 \nNational Enquirer: John Kasich's real dad was the milkman, not mailman \nNational Enquirer: Bound delegates from Colorado, Wyoming found in Ted Cruz’s basement \nIran breaks its pinky-swear promise not to support terrorism; US State Department vows rock-paper-scissors strategic response \nWomen across the country cheer as racist Democrat president on $20 bill is replaced by black pro-gun Republican \nFederal Reserve solves budget crisis by writing itself a 20-trillion-dollar check \nWidows, orphans claim responsibility for Brussels airport bombing \nChe Guevara's son hopes Cuba's communism will rub off on US, proposes a long list of people the government should execute first \nSusan Sarandon: \"I don't vote with my vagina.\" Voters in line behind her still suspicious, use hand sanitizer \nCampaign memo typo causes Hillary to court 'New Black Panties' vote \nNew Hampshire votes for socialist Sanders, changes state motto to \"Live FOR Free or Die\" \nMartin O'Malley drops out of race after Iowa Caucus; nation shocked with revelation he has been running for president \nStatisticians: one out of three Bernie Sanders supporters is just as dumb as the other two \nHillary campaign denies accusations of smoking-gun evidence in her emails, claims they contain only smoking-circumstantial-gun evidence \nObama stops short of firing US Congress upon realizing the difficulty of assembling another group of such tractable yes-men \nIn effort to contol wild passions for violent jihad, White House urges gun owners to keep their firearms covered in gun burkas \nTV horror live: A Charlie Brown Christmas gets shot up on air by Mohammed cartoons \nDemocrats vow to burn the country down over Ted Cruz statement, 'The overwhelming majority of violent criminals are Democrats' \nRussia's trend to sign bombs dropped on ISIS with \"This is for Paris\" found response in Obama administration's trend to sign American bombs with \"Return to sender\" \nUniversity researchers of cultural appropriation quit upon discovery that their research is appropriation from a culture that created universities \nArcheologists discover remains of what Barack Obama has described as unprecedented, un-American, and not-who-we-are immigration screening process in Ellis Island \nMizzou protests lead to declaring entire state a \"safe space,\" changing Missouri motto to \"The don't show me state\" \nGreen energy fact: if we put all green energy subsidies together in one-dollar bills and burn them, we could generate more electricity than has been produced by subsidized green energy \nState officials improve chances of healthcare payouts by replacing ObamaCare with state lottery \nNASA's new mission to search for racism, sexism, and economic inequality in deep space suffers from race, gender, and class power struggles over multibillion-dollar budget \nCollege progress enforcement squads issue schematic humor charts so students know if a joke may be spontaneously laughed at or if regulations require other action \nISIS opens suicide hotline for US teens depressed by climate change and other progressive doomsday scenarios \nVirginia county to close schools after teacher asks students to write 'death to America' in Arabic \n'Wear hijab to school day' ends with spontaneous female circumcision and stoning of a classmate during lunch break \nISIS releases new, even more barbaric video in an effort to regain mantle from Planned Parenthood \nImpressed by Fox News stellar rating during GOP debates, CNN to use same formula on Democrat candidates asking tough, pointed questions about Republicans \nShocking new book explores pros and cons of socialism, discovers they are same people \nPope outraged by Planned Parenthood's \"unfettered capitalism,\" demands equal redistribution of baby parts to each according to his need \nJohn Kerry accepts Iran's \"Golden Taquiyya\" award, requests jalapenos on the side \nCitizens of Pluto protest US government's surveillance of their planetoid and its moons with New Horizons space drone \nJohn Kerry proposes 3-day waiting period for all terrorist nations trying to acquire nuclear weapons \nChicago Police trying to identify flag that caused nine murders and 53 injuries in the city this past weekend \nCuba opens to affordable medical tourism for Americans who can't afford Obamacare deductibles \nState-funded research proves existence of Quantum Aggression Particles (Heterons) in Large Hadron Collider \nStudent job opportunities: make big bucks this summer as Hillary’s Ordinary-American; all expenses paid, travel, free acting lessons \nExperts debate whether Iranian negotiators broke John Kerry's leg or he did it himself to get out of negotiations \nJunior Varsity takes Ramadi, advances to quarterfinals \nUS media to GOP pool of candidates: 'Knowing what we know now, would you have had anything to do with the founding of the United States?' \nNY Mayor to hold peace talks with rats, apologize for previous Mayor's cowboy diplomacy \nChina launches cube-shaped space object with a message to aliens: \"The inhabitants of Earth will steal your intellectual property, copy it, manufacture it in sweatshops with slave labor, and sell it back to you at ridiculously low prices\" \nProgressive scientists: Truth is a variable deduced by subtracting 'what is' from 'what ought to be' \nExperts agree: Hillary Clinton best candidate to lessen percentage of Americans in top 1% \nAmerica's attempts at peace talks with the White House continue to be met with lies, stalling tactics, and bad faith \nStarbucks new policy to talk race with customers prompts new hashtag #DontHoldUpTheLine \nHillary: DELETE is the new RESET \nCharlie Hebdo receives Islamophobe 2015 award ; the cartoonists could not be reached for comment due to their inexplicable, illogical deaths \nRussia sends 'reset' button back to Hillary: 'You need it now more than we do' \nBarack Obama finds out from CNN that Hillary Clinton spent four years being his Secretary of State \nPresident Obama honors Leonard Nimoy by taking selfie in front of Starship Enterprise \nPolice: If Obama had a convenience store, it would look like Obama Express Food Market \nStudy finds stunning lack of racial, gender, and economic diversity among middle-class white males \nNASA: We're 80% sure about being 20% sure about being 17% sure about being 38% sure about 2014 being the hottest year on record \nPeople holding '$15 an Hour Now' posters sue Democratic party demanding raise to $15 an hour for rendered professional protesting services \nCuba-US normalization: US tourists flock to see Cuba before it looks like the US and Cubans flock to see the US before it looks like Cuba \nWhite House describes attacks on Sony Pictures as 'spontaneous hacking in response to offensive video mocking Juche and its prophet' \nCIA responds to Democrat calls for transparency by releasing the director's cut of The Making Of Obama's Birth Certificate \nObama: 'If I had a city, it would look like Ferguson' \nBiden: 'If I had a Ferguson (hic), it would look like a city' \nObama signs executive order renaming 'looters' to 'undocumented shoppers' \nEthicists agree: two wrongs do make a right so long as Bush did it first \nThe aftermath of the 'War on Women 2014' finds a new 'Lost Generation' of disillusioned Democrat politicians, unable to cope with life out of office \nWhite House: Republican takeover of the Senate is a clear mandate from the American people for President Obama to rule by executive orders \nNurse Kaci Hickox angrily tells reporters that she won't change her clocks for daylight savings time \nDemocratic Party leaders in panic after recent poll shows most Democratic voters think 'midterm' is when to end pregnancy \nDesperate Democratic candidates plead with Obama to stop backing them and instead support their GOP opponents \nEbola Czar issues five-year plan with mandatory quotas of Ebola infections per each state based on voting preferences \nStudy: crony capitalism is to the free market what the Westboro Baptist Church is to Christianity \nFun facts about world languages: the Left has more words for statism than the Eskimos have for snow \nAfrican countries to ban all flights from the United States because \"Obama is incompetent, it scares us\" \nNobel Peace Prize controversy: Hillary not nominated despite having done even less than Obama to deserve it \nObama: 'Ebola is the JV of viruses' \nBREAKING: Secret Service foils Secret Service plot to protect Obama \nRevised 1st Amendment: buy one speech, get the second free \nSharpton calls on white NFL players to beat their women in the interests of racial fairness \nPresident Obama appoints his weekly approval poll as new national security adviser \nObama wags pen and phone at Putin; Europe offers support with powerful pens and phones from NATO members \nWhite House pledges to embarrass ISIS back to the Stone Age with a barrage of fearsome Twitter messages and fatally ironic Instagram photos \nObama to fight ISIS with new federal Terrorist Regulatory Agency \nObama vows ISIS will never raise their flag over the eighteenth hole \nHarry Reid: \"Sometimes I say the wong thing\" \nElian Gonzalez wishes he had come to the U.S. on a bus from Central America like all the other kids \nObama visits US-Mexican border, calls for a two-state solution \nObama draws \"blue line\" in Iraq after Putin took away his red crayon \n\"Hard Choices,\" a porno flick loosely based on Hillary Clinton's memoir and starring Hillary Hellfire as a drinking, whoring Secretary of State, wildly outsells the flabby, sagging original \nAccusations of siding with the enemy leave Sgt. Bergdahl with only two options: pursue a doctorate at Berkley or become a Senator from Massachusetts \nJay Carney stuck in line behind Eric Shinseki to leave the White House; estimated wait time from 15 min to 6 weeks \n100% of scientists agree that if man-made global warming were real, \"the last people we'd want to help us is the Obama administration\" \nJay Carney says he found out that Obama found out that he found out that Obama found out that he found out about the latest Obama administration scandal on the news \n\"Anarchy Now!\" meeting turns into riot over points of order, bylaws, and whether or not 'kicking the #^@&*! ass' of the person trying to speak is or is not violence \nObama retaliates against Putin by prohibiting unionized federal employees from dating hot Russian girls online during work hours \nRussian separatists in Ukraine riot over an offensive YouTube video showing the toppling of Lenin statues \n\"Free Speech Zones\"confuse Obamaphone owners who roam streets in search of additional air minutes \nObamacare bolsters employment for professionals with skills to convert meth back into sudafed \nGloves finally off: Obama uses pen and phone to cancel Putin's Netflix account \nJoe Biden to Russia: \"We will bury you by turning more of Eastern Europe over to your control!\" \nIn last-ditch effort to help Ukraine, Obama deploys Rev. Sharpton and Rev. Jackson's Rainbow Coalition to Crimea \nAl Sharpton: \"Not even Putin can withstand our signature chanting, 'racist, sexist, anti-gay, Russian army go away'!\" \nMardi Gras in North Korea: \" Throw me some food! \" \nObama's foreign policy works: \"War, invasion, and conquest are signs of weakness; we've got Putin right where we want him\" \nUS offers military solution to Ukraine crisis: \"We will only fight countries that have LGBT military\" \nPutin annexes Brighton Beach to protect ethnic Russians in Brooklyn, Obama appeals to UN and EU for help \nThe 1980s: \"Mr. Obama, we're just calling to ask if you want our foreign policy back . The 1970s are right here with us, and they're wondering, too.\" \nIn a stunning act of defiance, Obama courageously unfriends Putin on Facebook \nMSNBC: Obama secures alliance with Austro-Hungarian Empire against Russia’s aggression in Ukraine \nStudy: springbreak is to STDs what April 15th is to accountants \nEfforts to achieve moisture justice for California thwarted by unfair redistribution of snow in America \nNorth Korean voters unanimous: \"We are the 100%\" \nLeader of authoritarian gulag-site, The People's Cube, unanimously 're-elected' with 100% voter turnout \nSuper Bowl: Obama blames Fox News for Broncos' loss \nFeminist author slams gay marriage: \"a man needs a man like a fish needs a bicycle\" \nBeverly Hills campaign heats up between Henry Waxman and Marianne Williamson over the widening income gap between millionaires and billionaires in their district \nBiden to lower $10,000-a-plate Dinner For The Homeless to $5,000 so more homeless can attend \nKim becomes world leader, feeds uncle to dogs; Obama eats dogs, becomes world leader, America cries uncle \nNorth Korean leader executes own uncle for talking about Obamacare at family Christmas party \nWhite House hires part-time schizophrenic Mandela sign interpreter to help sell Obamacare \nKim Jong Un executes own \" crazy uncle \" to keep him from ruining another family Christmas \nOFA admits its advice for area activists to give Obamacare Talk at shooting ranges was a bad idea \nPresident resolves Obamacare debacle with executive order declaring all Americans equally healthy \nObama to Iran: \"If you like your nuclear program, you can keep your nuclear program\" \nBovine community outraged by flatulence coming from Washington DC \nObama: \"I'm not particularly ideological; I believe in a good pragmatic five-year plan\" \nShocker: Obama had no knowledge he'd been reelected until he read about it in the local newspaper last week \nServer problems at HealthCare.gov so bad, it now flashes 'Error 808' message \nNSA marks National Best Friend Day with official announcement: \"Government is your best friend; we know you like no one else, we're always there, we're always willing to listen\" \nAl Qaeda cancels attack on USA citing launch of Obamacare as devastating enough \nThe President's latest talking point on Obamacare: \"I didn't build that\" \nDizzy with success, Obama renames his wildly popular healthcare mandate to HillaryCare \nCarney: huge ObamaCare deductibles won't look as bad come hyperinflation \nWashington Redskins drop 'Washington' from their name as offensive to most Americans \nPoll: 83% of Americans favor cowboy diplomacy over rodeo clown diplomacy \nGOVERNMENT WARNING: If you were able to complete ObamaCare form online, it wasn't a legitimate gov't website; you should report online fraud and change all your passwords \nObama administration gets serious, threatens Syria with ObamaCare \nObama authorizes the use of Vice President Joe Biden's double-barrel shotgun to fire a couple of blasts at Syria \nSharpton: \"British royals should have named baby 'Trayvon.' By choosing 'George' they sided with white Hispanic racist Zimmerman\" \nDNC launches 'Carlos Danger' action figure; proceeds to fund a charity helping survivors of the Republican War on Women \nNancy Pelosi extends abortion rights to the birds and the bees \nHubble discovers planetary drift to the left \nObama: 'If I had a daughter-in-law, she would look like Rachael Jeantel' \nFISA court rubberstamps statement denying its portrayal as government's rubber stamp \nEvery time ObamaCare gets delayed, a Julia somewhere dies \nGOP to Schumer: 'Force full implementation of ObamaCare before 2014 or Dems will never win another election' \nObama: 'If I had a son... no, wait, my daughter can now marry a woman!' \nJanet Napolitano: TSA findings reveal that since none of the hijackers were babies, elderly, or Tea Partiers, 9/11 was not an act of terrorism \nNews Flash: Sen. Mary Landrieu (D-LA) can see Canada from South Dakota \nSusan Rice: IRS actions against tea parties caused by anti-tax YouTube video that was insulting to their faith \nDrudge Report reduces font to fit all White House scandals onto one page \nObama: the IRS is a constitutional right, just like the Second Amendment \nWhite House: top Obama officials using secret email accounts a result of bad IT advice to avoid spam mail from Nigeria \nJay Carney to critics: 'Pinocchio never said anything inconsistent' \nObama: If I had a gay son, he'd look like Jason Collins \nGosnell's office in Benghazi raided by the IRS: mainstream media's worst cover-up challenge to date \nIRS targeting pro-gay-marriage LGBT groups leads to gayest tax revolt in U.S. history \nAfter Arlington Cemetery rejects offer to bury Boston bomber, Westboro Babtist Church steps up with premium front lawn plot \nBoston: Obama Administration to reclassify marathon bombing as 'sportsplace violence' \nStudy: Success has many fathers but failure becomes a government program \nUS Media: Can Pope Francis possibly clear up Vatican bureaucracy and banking without blaming the previous administration? \nMichelle Obama praises weekend rampage by Chicago teens as good way to burn calories and stay healthy \nThis Passover, Obama urges his subjects to paint lamb's blood above doors in order to avoid the Sequester \nWhite House to American children: Sequester causes layoffs among hens that lay Easter eggs; union-wage Easter Bunnies to be replaced by Mexican Chupacabras \nTime Mag names Hugo Chavez world's sexiest corpse \nBoy, 8, pretends banana is gun, makes daring escape from school \nStudy: Free lunches overpriced, lack nutrition \nOscars 2013: Michelle Obama announces long-awaited merger of Hollywood and the State \nJoe Salazar defends the right of women to be raped in gun-free environment: 'rapists and rapees should work together to prevent gun violence for the common good' \nDept. of Health and Human Services eliminates rape by reclassifying assailants as 'undocumented sex partners' \nKremlin puts out warning not to photoshop Putin riding meteor unless bare-chested \nDeeming football too violent, Obama moves to introduce Super Drone Sundays instead \nJapan offers to extend nuclear umbrella to cover U.S. should America suffer devastating attack on its own defense spending \nFeminists organize one billion women to protest male oppression with one billion lap dances \nUrban community protests Mayor Bloomberg's ban on extra-large pop singers owning assault weapons \nConcerned with mounting death toll, Taliban offers to send peacekeeping advisers to Chicago \nKarl Rove puts an end to Tea Party with new 'Republicans For Democrats' strategy aimed at losing elections \nAnswering public skepticism, President Obama authorizes unlimited drone attacks on all skeet targets throughout the country \nSkeet Ulrich denies claims he had been shot by President but considers changing his name to 'Traps' \nWhite House releases new exciting photos of Obama standing, sitting, looking thoughtful, and even breathing in and out \nNew York Times hacked by Chinese government, Paul Krugman's economic policies stolen \nWhite House: when President shoots skeet, he donates the meat to food banks that feed the middle class \nTo prove he is serious, Obama eliminates armed guard protection for President, Vice-President, and their families; establishes Gun-Free Zones around them instead \nState Dept to send 100,000 American college students to China as security for US debt obligations \nJay Carney: Al Qaeda is on the run, they're just running forward \nPresident issues executive orders banning cliffs, ceilings, obstructions, statistics, and other notions that prevent us from moving forwards and upward \nFearing the worst, Obama Administration outlaws the fan to prevent it from being hit by certain objects \nWorld ends; S&P soars \nRiddle of universe solved; answer not understood \nMeek inherit Earth, can't afford estate taxes \nGreece abandons Euro; accountants find Greece has no Euros anyway \nWheel finally reinvented; axles to be gradually reinvented in 3rd quarter of 2013 \nBigfoot found in Ohio, mysteriously not voting for Obama \nAs Santa's workshop files for bankruptcy, Fed offers bailout in exchange for control of 'naughty and nice' list \nFreak flying pig accident causes bacon to fly off shelves \nObama: green economy likely to transform America into a leading third world country of the new millennium \nReport: President Obama to visit the United States in the near future \nObama promises to create thousands more economically neutral jobs \nModernizing Islam: New York imam proposes to canonize Saul Alinsky as religion's latter day prophet \nImam Rauf's peaceful solution: 'Move Ground Zero a few blocks away from the mosque and no one gets hurt' \nStudy: Obama's threat to burn tax money in Washington 'recruitment bonanza' for Tea Parties \nStudy: no Social Security reform will be needed if gov't raises retirement age to at least 814 years \nObama attends church service, worships self \nObama proposes national 'Win The Future' lottery; proceeds of new WTF Powerball to finance more gov't spending \nHistorical revisionists: \"Hey, you never know\" \nVice President Biden: criticizing Egypt is un-pharaoh \nIsraelis to Egyptian rioters: \"don't damage the pyramids, we will not rebuild\" \nLake Superior renamed Lake Inferior in spirit of tolerance and inclusiveness \nAl Gore: It's a shame that a family can be torn apart by something as simple as a pack of polar bears \nMichael Moore: As long as there is anyone with money to shake down, this country is not broke \nObama's teleprompters unionize, demand collective bargaining rights \nObama calls new taxes 'spending reductions in tax code.' Elsewhere rapists tout 'consent reductions in sexual intercourse' \nObama's teleprompter unhappy with White House Twitter: \"Too few words\" \nObama's Regulation Reduction committee finds US Constitution to be expensive outdated framework inefficiently regulating federal gov't \nTaking a page from the Reagan years, Obama announces new era of Perestroika and Glasnost \nResponding to Oslo shootings, Obama declares Christianity \"Religion of Peace,\" praises \"moderate Christians,\" promises to send one into space \nRepublicans block Obama's $420 billion program to give American families free charms that ward off economic bad luck \nWhite House to impose Chimney tax on Santa Claus \nObama decrees the economy is not soaring as much as previously decreeed \nConservative think tank introduces children to capitalism with pop-up picture book \"The Road to Smurfdom\" \nAl Gore proposes to combat Global Warming by extracting silver linings from clouds in Earth's atmosphere \nObama refutes charges of him being unresponsive to people's suffering: \"When you pray to God, do you always hear a response?\" \nObama regrets the US government didn't provide his mother with free contraceptives when she was in college \nFluke to Congress: drill, baby, drill! \nPlanned Parenthood introduces Frequent Flucker reward card: 'Come again soon!' \nObama to tornado victims: 'We inherited this weather from the previous administration' \nObama congratulates Putin on Chicago-style election outcome \nPeople's Cube gives itself Hero of Socialist Labor medal in recognition of continued expert advice provided to the Obama Administration helping to shape its foreign and domestic policies \nHamas: Israeli air defense unfair to 99% of our missiles, \"only 1% allowed to reach Israel\" \nDemocrat strategist: without government supervision, women would have never evolved into humans \nVoters Without Borders oppose Texas new voter ID law \nEnraged by accusation that they are doing Obama's bidding, media leaders demand instructions from White House on how to respond \nObama blames previous Olympics for failure to win at this Olympics \nOfficial: China plans to land on Moon or at least on cheap knockoff thereof \nKoran-Contra: Obama secretly arms Syrian rebels \nPoll: Progressive slogan 'We should be more like Europe' most popular with members of American Nazi Party \nObama to Evangelicals: Jesus saves, I just spend \nMay Day: Anarchists plan, schedule, synchronize, and execute a coordinated campaign against all of the above \nMidwestern farmers hooked on new erotic novel \"50 Shades of Hay\" \nStudy: 99% of Liberals give the rest a bad name \nObama meets with Jewish leaders, proposes deeper circumcisions for the rich \nHistorians: Before HOPE & CHANGE there was HEMP & CHOOM at ten bucks a bag \nCancer once again fails to cure Venezuela of its \"President for Life\" \nTragic spelling error causes Muslim protesters to burn local boob-tube factory \nSecretary of Energy Steven Chu: due to energy conservation, the light at the end of the tunnel will be switched off \nObama Administration running food stamps across the border with Mexico in an operation code-named \"Fat And Furious\" \nPakistan explodes in protest over new Adobe Acrobat update; 17 local acrobats killed \nWhite House: \"Let them eat statistics\" \nSpecial Ops: if Benedict Arnold had a son, he would look like Barack Obama",
                              "label": 1,
                              "distance": 1.1846661567687988
                        }
                  ]
            },
            "title": "Obama",
            "body": "A 150-page printout confirms that while Obama's points are generally cogent in the first quarter of the message, the increasingly chaotic spacing, multiple spelling errors, and near total lack of commas rendered the later portions almost impossible to parse.\n\nExcerpts indicate an erratic use of capitalized and underlined words, with the phrase \"Stopped a second Great Depression\" mentioned 14 times in a bolded red font double the size of surrounding text. In addition, the e-mail contained multiple links to the Wikipedia entry for Social Security and line graphs of Ronald Reagan's year-by-year approval ratings.\n\nBecause Obama copied and pasted some critical passages directly from right-wing editorials and personal blogs, the e-mail included formatting irregularities that caused many citizens to receive a message in which all of the apostrophes were replaced with question marks. Moreover, some software flagged it as spam.\n\n\"I don?t mean to be rude, but I thought we were all on the samepage about helath care reform,\" the 29th paragraph of Obama's e-mail read in part. \"It was part of my platform. You all knew I was goingt o pursue it when you elected me. And just real fast, going back on what I said earlier, the economic stimulus cut taxes for 95% of Americans. It didn't raise them. It cut them. You people need to look at facts and stop litnening to all the right wing crap out there. By the way, we're basically out of Iraq now. You?re welcome.\"\n\n\"JESUS CHRIST, WE LOST OVER @ MILLION JOBS BEFOREE I EVEN TOOK OFFICE!!!11!\" reads a sentence occupying a large white space between two massive chunks of texts, one of which was a 6,500-word tangent on the Muslim community center being built two blocks from the former World Trade Center site.\n\nAccording to White House sources, Obama \"snapped\" late Tuesday afternoon when a staffer reminded him he was scheduled to take a call from incoming Speaker of the House John Boehner. At that point, a visibly disgusted Obama was observed slowly repeating the words \"House Speaker Boehner\" before ordering everyone to leave the Oval Office, where he sat typing and, according to some, banging angrily on his keyboard for the next five hours.\n\nWhen White House Chief of Staff Pete Rouse urged the president to sleep on the e-mail, Obama told him he had already sent it.\n\n\"In terms of fulfilling campaign promises I think I've actually done a pretty good job in terms of fulfilling campaign,\" Obama wrote in response to an anonymous comment made to a post by conservative blogger Michelle Malkin. \"I know I said I'd close Guantanamo and I sti5ill want to do that but it's harder than it looks. And yes I know I said it would be done by now along with energy reform too—-trust me it is still a priority because \"TOGETHER WE CAN & MUST EMBRACE CLEAN ENERGY\"\"\n\n\"Yes we can!\" the e-mail concluded. \"Ugh, you know what? Forget it. Believe what you want. Yours, Barack.\"\n\nThus far the response from the American public has been subdued, though a sixth of the populace did not even receive the e-mail because the message generated 50 million mailer-daemon delivery failure notifications.",
            "time": "2022-11-05T13:57:02.810429"
      },
      {
            "cls": {
                  "result": 0,
                  "result_proba": [
                        0.9986670507381412,
                        0.0013329492618587438
                  ],
                  "domain": 3,
                  "domain_proba": [
                        2.411272193655319e-06,
                        0.07612945811243546,
                        0.022670866201601046,
                        0.6728151330452133,
                        0.08059805179749512,
                        0.14778407957106135
                  ],
                  "similar_articles": [
                        {
                              "text": "While on the campaign trail for Hillary Clinton in Ohio, Vice President Joe Biden was talking about the dangers of a Donald Trump presidency and what that would do to the average citizen.However, while speaking, a protester started shouting at Biden about the Iraq War. And while he could have simply ignored this protester or let the crowd drown him out with chants of  Hillary!  Biden instead hushed the crowd to field his question.After Biden answered the question, the protester, still upset, let the vice president know that his friend had died. This is when Biden says: So did my son. It was a poignant moment and one that let the protester know that Biden understands what it s like to lose someone so close to you. And in an additional gesture of empathy, Biden told the protester that if he s serious about asking questions in regard to Iraq and his friend, that he can come backstage and will answer his questions.This is why we love Joe Biden. He s a man of the people.Watch the moment here:Video: Biden stumping for Clinton in OH when man protests over Iraq War:  My friend died! Biden:  So did my son.  https://t.co/zl5VPFBBUq  Bradd Jaffy (@BraddJaffy) September 1, 2016Featured image via video screen capture",
                              "label": 1,
                              "distance": 1.0313376188278198
                        },
                        {
                              "text": "WASHINGTON (Reuters) - U.S. Democratic presidential candidate Bernie Sanders on Thursday thanked President Barack Obama and Vice President Joe Biden for maintaining impartiality during the primary process, and said he would meet with rival Hillary Clinton soon to discuss ways to defeat Republican candidate Donald Trump. Speaking at the White House following a meeting with President Obama, a Democrat, Sanders praised Obama and Biden for not thumbing the scales by endorsing a candidate during the primary season, and said he would do everything he could to stop Trump from succeeding Obama in the November election. ",
                              "label": 0,
                              "distance": 1.049729824066162
                        },
                        {
                              "text": "Does anyone else get the sense Biden was picked to be the VP just to make Obama look smart?Vice President Joe Biden remarked at a Hillary Clinton campaign event Thursday that it s  OK sometimes  to be an uninformed guy who  has no idea what the hell he s talking about. Biden, however, was referring to Republican presidential nominee Donald Trump. I don t believe the guy s a bad guy. I just think he is thoroughly, totally, completely uninformed,  Biden said.  He has no idea what the hell he s talking about. And guess what? That s OK sometimes. That s OK sometimes. Biden went on to point out for the rally audience, for the second time in less than a month, the military aide who travels with him and holds the nuclear launch codes in case something happens to the president.  WFB",
                              "label": 1,
                              "distance": 1.0654624700546265
                        },
                        {
                              "text": "Does anyone else get the sense Biden was picked to be the VP just to make Obama look smart?Vice President Joe Biden remarked at a Hillary Clinton campaign event Thursday that it s  OK sometimes  to be an uninformed guy who  has no idea what the hell he s talking about. Biden, however, was referring to Republican presidential nominee Donald Trump. I don t believe the guy s a bad guy. I just think he is thoroughly, totally, completely uninformed,  Biden said.  He has no idea what the hell he s talking about. And guess what? That s OK sometimes. That s OK sometimes. Biden went on to point out for the rally audience, for the second time in less than a month, the military aide who travels with him and holds the nuclear launch codes in case something happens to the president.  WFB",
                              "label": 1,
                              "distance": 1.0654624700546265
                        },
                        {
                              "text": "Vice President Joe Biden has been careful to give Hillary Clinton and Bernie Sanders their fair share of lauding and criticism. Like President Obama, Biden has not endorsed any candidate for the 2016 race, and has pledged to stay neutral until a nominee is decided at the convention.But in a telling interview with Mic   in which his staffers tried to shut down   Vice President Biden may have hurled a veiled endorsement towards Clinton s way when he said he would  like to see a woman elected president. His comments, more specifically:This country s ready for a woman. There s no problem. We re gonna be able to elect a woman in this country. I would like to see a woman elected.After his staffers tried to cut the interview, Biden said he had no issues discussing the 2016 election, and reminded Mic that  the president and I are not going endorse because we both, when we ran said,  let the party decide.' Although he did not mention Clinton by name, there is only one woman in the running for the White House (unless Sanders picks a female VP or the Republicans do)  and that s Hillary Clinton. After brushing off his staff, Biden added that both candidates are qualified, but then added,  Hillary s overwhelmingly qualified to be president. Biden s comments will be an uplift to Clinton, who suffered a public humiliation after the Vice President branded her as  new  to the issues of income inequality, a staple of the Sanders campaign.Surprisingly, Biden told Mic that he does not believe Clinton is held to a higher standard because she is a woman, even though social psychology shows people do, in fact, hold women in politics to a different   higher  standard than men.Although not an official endorsement, is Biden ready for Hillary?Here s the interview, via YouTube: Featured image via Drew Angerer/Getty Images",
                              "label": 1,
                              "distance": 1.06890869140625
                        },
                        {
                              "text": "Vice President Joe Biden has reportedly been added to a potential shortlist of Hillary Clinton s choices for secretary of state if she were to be elected president in November.The Clinton campaign has not formally reached out to Biden but has put him at the top of its list, Politico reported, citing a source familiar with the matter.Biden, a former chair of the Senate Foreign Relations committee, has played an integral role in President Obama s foreign policy decisions and the Clinton team believes he would be a good fit for her administration.Biden and Clinton have known each other since her days as first lady and worked together while Clinton was secretary of state. Their relationship somewhat soured last summer, though, as Biden s political team gamed out a possible presidential run.",
                              "label": 1,
                              "distance": 1.114632248878479
                        },
                        {
                              "text": "A new report indicates that Vice President Joe Biden s long tenure in Washington, D.C. may not be over just yet if Hillary Clinton has anything to do with it. According to Politico, the Clinton brain trust is considering offering Biden one of the most important roles in her administration if she wins the election. Joe Biden is at the top of the internal short list Hillary Clinton s transition team is preparing for her pick to be secretary of state, a source familiar with the planning tells POLITICO.This would be the first major Cabinet candidate to go public for a campaign that s insisted its focus remains on winning the election, and perhaps the most central choice for a potential president who was a secretary of state herself. The report indicates that a formal offer of the position has not been discussed yet between Biden and Clinton.Biden has years of experience with foreign policy, including time leading the Foreign Relations Committee when he was a U.S. Senator from Delaware, and he has been one of President Obama s closest advisors on the topic while serving as Vice President.Biden considered running for President this year, and some polls indicated he would have been a strong challenger to Clinton. After the death of his son Beau, he decided against the campaign and has endorsed Clinton. His speech in favor of Clinton at the Democratic Convention in Philadelphia was one of the highlights of the event.He has been holding campaign events on her behalf and is among the all-star team of surrogates including the President, First Lady Michelle Obama, and Senator Bernie Sanders that are promoting Clinton s campaign.Biden has also dedicated himself to leading the so-called  moon shot  project to cure cancer, a position that President Obama announced for him during his final State of the Union address.Featured image via Flickr",
                              "label": 1,
                              "distance": 1.1161527633666992
                        },
                        {
                              "text": "LAS VEGAS (Reuters) - President Barack Obama on Sunday campaigned in the battleground state of Nevada for Hillary Clinton, the Democratic candidate he wants to succeed him in the White House - but he spent most of his time talking about the state’s Senate race. Democrats badly want to get back control of the Republican-controlled Senate in the Nov. 8 election, and are sending Obama, Michelle Obama and Joe Biden to states where close races could tip the balance. In Nevada, Obama reserved most of his firepower for mocking three-term Republican U.S. Representative Joe Heck, who had supported his party’s presidential candidate until earlier this month when Donald Trump’s campaign went into crisis mode by the release of a video in which he lewdly bragged about groping and kissing women. “I understand Joe Heck now wishes he never said those things about Donald Trump, but they’re on tape, they’re on the record,” Obama said, using Heck’s earlier praise of Trump against him. It’s not just the Senate. Obama wants to capitalize on his high approval rating to help elect more Democrats to the House of Representatives, and has also endorsed about 150 candidates in state legislative races. At an intimate fundraising dinner in La Jolla, California, on Sunday evening, where tickets started at $10,000, Obama urged about 60 guests to help elect Democratic congressional candidate Doug Applegate, a former Marine colonel who is challenging Republican incumbent Darrell Issa. “As far as I can tell, (Darrell) Issa’s primary contribution to the United States Congress has been to obstruct and to waste taxpayer dollars on trumped-up investigations that have led nowhere,” Obama said. Issa, the former head of the House Oversight Committee, led a series of headline-grabbing investigations into Obama’s administration - but has featured a photo of Obama signing legislation on a campaign brochure. “Now that is the definition of chutzpah!” Obama said. Last week, Obama excoriated Republican Senator Marco Rubio of Florida - who has a narrow lead over Democratic challenger Patrick Murphy, a congressman - for failing to repudiate Trump. In the final two weeks leading up to Nov. 8, Clinton said she planned to work hard to support congressional and state races. “We’re going to be emphasizing the importance of electing Democrats down the ballot,” Clinton told reporters traveling with her on Saturday. In Las Vegas, Obama was introduced by the Democratic Senate candidate Catherine Cortez Masto, a two-term Nevada attorney general, who would be the first Latina elected to the U.S Senate if she wins. “We can’t elect Hillary and then saddle her with a Congress that is do-nothing, won’t even try to do something,” Obama said. The Nevada Senate seat is the only Senate race this year that Republicans could flip to their control. The seat has long been held by Harry Reid, the Senate Democratic leader, who is retiring. Cortez Masto currently has a slim 2.3 percentage point lead in an average of polls tracked by RealClearPolitics over Heck. Obama won Nevada in 2008 and 2012. Polls show Clinton with a 4.2 percentage point lead at 45.4 percent support to Trump’s 41.3 percent, according to the RealClearPolitics average. ",
                              "label": 0,
                              "distance": 1.1362528800964355
                        },
                        {
                              "text": "Washington (CNN) Democrats flipped their 41st state legislative seat of Donald Trump's presidency, winning a special election Tuesday night in the Philadelphia suburbs.  Democrat Helen Tai bested Republican Wendi Thomas in the Bucks County race -- notching a 96-vote victory in a district that has previously favored Republicans, with Trump winning there by 3 percentage points in 2016 and Mitt Romney by 13 points in 2012.  It's the latest evidence of America's suburbs shifting in Democrats' favor since Trump took office.  Former Vice President Joe Biden endorsed Tai in the race, and the Democratic Legislative Campaign Committee said Tai's campaign knocked on 40,000 doors in the district.  The wins in state legislative races are seen -- in part because the candidates are typically little-known -- as gauges of voters' enthusiasm in small slices of the country. Other races, including a state supreme court contest in Wisconsin, have also shown major movement in Democrats' favor in key states since Trump took office.  Read More",
                              "label": 0,
                              "distance": 1.1390843391418457
                        },
                        {
                              "text": "in: Politics , Sleuth Journal , Special Interests “And I certainly hope that Michelle Obama does not become the nominee if Hillary Clinton has to step aside, because Donald Trump would have an exceedingly difficult time defeating her.” I realize that this headline must sound extremely bizarre, but in this article I will explain why this could actually happen. We have just learned that the FBI has obtained a search warrant that will enable the agency to examine approximately 650,000 emails that are sitting on electronic devices owned by Huma Abedin and her estranged husband Anthony Weiner. Now that the FBI is going through these emails, it is unlikely but still possible that a decision about whether or not to charge Hillary Clinton with a crime could be made by November 8th. Of course the most likely scenario is that Hillary Clinton will not be indicted before election day and that Americans will be voting with this scandal hanging ominously over the Clinton campaign. But if the FBI does quickly take action, it is possible that Hillary Clinton could be forced from the race before election day, and that would require the Democrats to come up with a new candidate. In fact, there are already calls in the mainstream media for Clinton to willingly remove herself from the race. For example, the following comes from a Chicago Tribune article entitled “ Democrats should ask Clinton to step aside “… So what should the Democrats do now? If ruling Democrats hold themselves to the high moral standards they impose on the people they govern, they would follow a simple process: They would demand that Mrs. Clinton step down, immediately, and let her vice presidential nominee, Sen. Tim Kaine of Virginia, stand in her place. Democrats should say, honestly, that with a new criminal investigation going on into events around her home-brew email server from the time she was secretary of state, having Clinton anywhere near the White House is just not a good idea. But what the author of that article does not understand is that Tim Kaine would not automatically take her place if Clinton steps down before the election. In a previous article , I included a quote from a U.S. News & World Report article that explained what would happen if Hillary Clinton was removed from the Democratic ticket for some reason prior to November 8th… If Clinton were to fall off the ticket, Democratic National Committee members would gather to vote on a replacement. DNC members acted as superdelegates during this year’s primary and overwhelmingly backed Clinton over boat-rocking socialist Sen. Bernie Sanders of Vermont. DNC spokesman Mark Paustenbach says there currently are 445 committee members – a number that changes over time and is guided by the group’s bylaws, which give membership to specific officeholders and party leaders and hold 200 spots for selection by states, along with an optional 75 slots DNC members can choose to fill. But the party rules for replacing a presidential nominee merely specify that a majority of members must be present at a special meeting called by the committee chairman. The meeting would follow procedures set by the DNC Rules and Bylaws Committee and proxy voting would not be allowed. So if this email scandal forced Hillary Clinton to exit the race at the last minute, a majority of the members of the Democratic National Committee would gather to select a new nominee. Who would they choose? Let’s take a look at the top five options… #1 Tim Kaine He would seem to be an obvious choice since he is Hillary Clinton’s running mate. But to win a national campaign you need to have name recognition, and most Americans outside of the state of Virginia have very little familiarity with him. And at this point he has proven to have very little popularity on the campaign trail. In fact, attendance at many of his rallies in key swing states can be measured in the dozens. So to me it seems unlikely that the DNC would select Kaine as the replacement nominee. #2 Joe Biden Vice-President Joe Biden has far more name recognition than Tim Kaine does, and in recent days he has been touting how he believes that he would have actually won the nomination if he would have decided to run … Vice President Joe Biden said in a recent interview that he believed he could have beat former secretary of state Hillary Clinton for the Democratic presidential nomination had he pursued it. Biden was asked in an interview with CNN Saturday if news that the FBI was re-opening their criminal probe into Clinton’s use of a private email server while secretary of state made him second-guess his decision last year not to run. But according to the vice president, the short answer is “no.” The only thing that kept him from running, Biden said, was the recent death of his son, Beau. Unfortunately for Biden, he suffers from many of the same things that Kaine does. Biden is boring, he is not very good on the campaign trail, and he doesn’t have the sort of charisma that would motivate people to go to the polls in large numbers. Biden would probably represent the “safest” choice for the Democrats, but he might not be a winning choice. #3 Bernie Sanders Bernie Sanders would seem to be a logical choice since he was the runner-up to Hillary Clinton, but the truth is that there are a lot of things working against Bernie Sanders. First of all, he does not have any real loyalty to the Democrats. He has previously operated as an independent, and he expressed a desire to return to independent status once the campaign was over. Secondly, the Democratic establishment very much dislikes him, and that plays a huge role in decisions such as this. Thirdly, Democratic insiders fear that he would be “another McGovern” and would get absolutely wiped out in a general election. So even though he is very popular with the radical left, it appears that Sanders would be the least likely choice on this list. #4 Elizabeth Warren Elizabeth Warren would be very popular with the “Bernie Sanders” wing of the party, and she would enable the party to replace Hillary Clinton with another woman. So she is definitely a possibility. But she does lack name recognition, and just like Sanders there would be concern that the Republicans would frame her candidacy as “another McGovern” because of her far left policies. #5 Michelle Obama One recent survey found that 67 percent of all Democrats would rather have a third term for Obama than a first term for Hillary Clinton. And these days Barack Obama’s approval rating is running anywhere from +9 to +11. So the thought of another Obama in the White House is not as far-fetched as you might think. Michelle Obama has better name recognition than anyone else on this list, and she is generally very well-liked by the American people. And she has received a tremendous amount of praise for her work on the campaign trail recently. For instance, her recent speech in New Hampshire was lauded as “the most influential speech of the 2016 campaign” in a recent MSN article entitled “ In this campaign, Michelle Obama became more than just another political voice “… The speech, amplified by timing and met with an enthusiastic response, cemented Obama’s place as a star of the presidential race and put a defining stroke not just on how women view Trump, but also on herself as a voice of moral authority. Three months before leaving the White House, she already is among the ranks of public figures who transcend politics and title. “When you rise to a level like that, you see how much weight your words carry,” said Anita McBride, former chief of staff to Laura Bush and executive in residence at the School of Public Affairs at American University. “We know she didn’t like politics. But she was impassioned by the language that was used, and she feels compelled to speak out. People listen to her.” If I were the Democrats, Michelle Obama is the one that I would select if a replacement nominee was needed, because she would give them the very best chance of winning against Donald Trump. Of course the Obamas are just as radical as Bernie Sanders and Elizabeth Warren, but the American people have become quite comfortable with them at this point. And I certainly hope that Michelle Obama does not become the nominee if Hillary Clinton has to step aside, because Donald Trump would have an exceedingly difficult time defeating her. In the final analysis, none of this is probably going to matter anyway because it is unlikely that the FBI will move quickly enough to force Hillary Clinton out before election day, but there is still a small chance that it could actually happen. And if it does happen, it is going to turn politics in America completely upside down. Submit your review",
                              "label": 1,
                              "distance": 1.1500519514083862
                        }
                  ]
            },
            "title": "CNN",
            "body": "Three presidents -- one sitting and two former -- descend on Pennsylvania Saturday for a final-stretch midterm push that underscores the stakes of one of the nation's most closely watched Senate races.\n\nFor President Joe Biden, who will hold a rare joint appearance with former President Barack Obama in Philadelphia meant to boost the Democratic candidate Lt. Gov. John Fetterman, Pennsylvania will amount to a political stress test in his home state, where he's traveled 20 times since taking office.\n\nFor former President Donald Trump, who rallies outside of Pittsburgh in the city of Latrobe, a win by his hand-selected candidate Dr. Mehmet Oz could prove his own enduring viability in a commonwealth he lost by a narrow margin in 2020.\n\nThe consequences extend well beyond next week's election. As Trump prepares to announce a third presidential bid, potentially in the coming weeks, Biden's aides are taking their own initial steps toward mounting a reelection campaign. For a several-hour stretch on Saturday afternoon, the dynamics of a potential 2020 rematch will be laid bare.\n\nThe moment marks a historic anomaly. Former presidents have typically only waded sparingly into daily politics, mostly avoiding direct criticism of the men occupying the office they once held. Not since Grover Cleveland in 1892 has a defeated one-term president returned to win the White House again.\n\nThe convergence of presidents in Pennsylvania, each warning of dire consequences should the opposing party prevail, reflects the altered norms Trump precipitated when he took office nearly six years ago, quickly issuing false accusations against Obama of spying and general malfeasance.\n\nBiden, who spent much of his first year in office trying to avoid saying Trump's name, is no longer so cautious. He called out \"Trump and all his Trumpies\" at a rally in California this week and identified Florida Gov. Ron DeSantis as \"Trump incarnate\" during a fundraiser outside Fort Lauderdale on Tuesday. At his own rallies, Trump plays a video reel of slip-ups to cast his successor as a gaffe-prone senior citizen -- though he hasn't as frequently gone after Obama.\n\nObama, meanwhile, has issued his harshest criticism to the cast of candidates backed by Trump, many of whom deny the 2020 election results and have modeled themselves after the 45th president.\n\n\"It doesn't just work out just because somebody's been on TV. Turns out, being president or governor is about more than snappy lines and good lighting,\" Obama said in Arizona last week of the Republican gubernatorial candidate Kari Lake, a former local news anchor.\n\nObama becomes a main draw in battleground states\n\nPennsylvania's senate and gubernatorial contests are the sole marquee races of this year's midterm cycle Biden has stumped in repeatedly. In other high-profile races, candidates have maintained their distance from a president with underwater approval ratings.\n\nThat hasn't been true of Obama, who has been in high demand among Democrats in close races. In the final weeks of the campaign, Obama has held raucous rallies in Georgia, Michigan, Wisconsin, Arizona and Nevada -- all states Biden has avoided in the last several months as candidates work to stave off Republican momentum.\n\nThat's a 180-degree turn from midterm cycles during Obama's presidency, when it was Biden venturing to more states -- including conservative-leaning districts -- where the sitting president was considered a drag on Democratic candidates.\n\nBiden is hardly irritated or even surprised that Obama is more of a draw on the campaign trail this year than him, according to officials. He has discussed some of the races with his former boss and believes Obama's message is both resonating with voters and complementary to his own.\n\nStill, their joint appearance Saturday will only serve to underscore their divergent styles and political abilities -- a comparison even some Democrats say ultimately favors Obama.\n\nBiden goes to Democrat-heavy areas\n\n\"I know you always ask me how we're doing. We're going to win this time around I think. I feel really good about our chances,\" Biden told reporters Friday in California.\n\nThe president has been bullish on Democrats' chances next week, even as many Democrats grow increasingly anxious about their party's prospects. His campaign schedule -- in blue states stumping for candidates in closer-than-expected races -- is itself a signal of Democrats'' vulnerabilities.\n\nIn the final days of the campaign, Biden has been traveling mostly to blue states he won, but where Democrats are nonetheless running closer-than-expected races. He stopped in New Mexico, California and Illinois before stumping in Pennsylvania on Saturday, and will campaign with the embattled New York Gov. Kathy Hochul on Sunday. He'll spend Election Eve in Maryland.\n\nPeople familiar with Biden's thinking say he accepts that not every Democratic candidate will welcome him as a surrogate while his approval ratings remain underwater. And he has told fellow Democrats he respects their political intuition when it comes to their own races.\n\nBut he has grown frustrated at coverage suggesting he is political albatross, according to people familiar with the conversations, arguing his policies -- when properly explained -- are widely popular with voters.\n\nCompared to both Obama and Trump, Biden has held far fewer campaign rallies for his party during this midterm cycle. Most of his engagements over the past month have been official events, delivered to crowds that sometimes only number a few dozen.\n\nHis rallies have begun drawing larger crowds in the waning days of the campaign. Six hundred people had to be turned away from an event in Southern California on Friday, according to the White House. And Biden addressed an overflow crowd in New Mexico that couldn't fit inside the main venue when he was holding a rally with Gov. Michelle Lujan Grisham.\n\n\"I know you don't think it, but I think we have pretty good crowds. They're fairly enthusiastic. You don't write it that way, but they are,\" Biden said as he was departing California on Friday.\n\n'Get ready, that's all I'm saying'\n\nStill, his events haven't generated the same electricity as Obama's. The former president has laid into Trump and his acolytes who are running for office during his string of rallies across the country over the past weeks, using stinging humor and an air of bemusement to ridicule Republicans.\n\nLike Biden, he's also argued the American system of government is at stake in next week's election, telling a crowd in Arizona that \"democracy as we know it\" could perish if election deniers take office.\n\nObama and Biden last appeared together at the White House in September, when Obama's official portrait was unveiled in the White House East Room. The event had been put off while Trump was in office, partly because neither the Obamas nor the Trumps were interested in putting on a show of friendship.\n\nAs he campaigns for his endorsed candidates this fall, Trump has made little attempt to conceal his larger intentions: to buttress his own likely presidential campaign he hopes will return him to the White House.\n\n\"Get ready, that's all I'm saying,\" Trump told a crowd in Sioux City, Iowa, on Thursday, adding that he \"will very, very probably do it again.\"\n\nTop Trump aides have discussed the third week of November as an ideal launch point for his 2024 presidential campaign if Republicans fare well in the midterm elections, sources familiar with the matter said.\n\nFor Biden, the decision may take a little longer. He has pointed to family discussions around the holidays when asked about his own timeline. Members of his political team have made early preparations for a campaign infrastructure, operating under the assumption he will decide to run again.\n\nHis motivating factor, aides say: Whether Trump jumps in himself.\n\n© 2022 Cable News Network. A Warner Media Company. All Rights Reserved.\n\nListen to CNN (low-bandwidth usage)\n\nGo to the full CNN experience",
            "time": "2022-11-05T13:57:36.202232"
      },
      {
            "cls": {
                  "result": 1,
                  "result_proba": [
                        0.0005298869801076966,
                        0.9994701130198923
                  ],
                  "domain": 4,
                  "domain_proba": [
                        3.754667709860516e-06,
                        0.008842875443197526,
                        0.004713758359010987,
                        0.046102009610907754,
                        0.9139524992853871,
                        0.026385102633786617
                  ],
                  "similar_articles": [
                        {
                              "text": "While on the campaign trail for Hillary Clinton in Ohio, Vice President Joe Biden was talking about the dangers of a Donald Trump presidency and what that would do to the average citizen.However, while speaking, a protester started shouting at Biden about the Iraq War. And while he could have simply ignored this protester or let the crowd drown him out with chants of  Hillary!  Biden instead hushed the crowd to field his question.After Biden answered the question, the protester, still upset, let the vice president know that his friend had died. This is when Biden says: So did my son. It was a poignant moment and one that let the protester know that Biden understands what it s like to lose someone so close to you. And in an additional gesture of empathy, Biden told the protester that if he s serious about asking questions in regard to Iraq and his friend, that he can come backstage and will answer his questions.This is why we love Joe Biden. He s a man of the people.Watch the moment here:Video: Biden stumping for Clinton in OH when man protests over Iraq War:  My friend died! Biden:  So did my son.  https://t.co/zl5VPFBBUq  Bradd Jaffy (@BraddJaffy) September 1, 2016Featured image via video screen capture",
                              "label": 1,
                              "distance": 0.4722289443016052
                        },
                        {
                              "text": "Rudy Giuliani stated in an interview with the Huffington Post, “Joe Biden is a moron. I’m calling Joe Biden a mentally deficient idiot.”  Since he was talking to HuffPo, he had to clarify. \"I meant he’s dumb,”  Is Joe Biden mentally deficient? According to Biden, he has a very high IQ.  In the above video, taken at April 3, 1987 campaign stop in Claremont, New Hampshire, Biden can be seen sparring with a voter who questioned his academic credentials. Biden responded, “I think I have a much higher I.Q. than you do I suspect. I went to law school on a full academic scholarship – the only one in my class to have a full academic scholarship.” Biden went on to claim that he graduated in the top half of his law school. In his statement today, Mr. Biden, who attended the Syracuse College of Law and graduated 76th in a class of 85, acknowledged: “I did not graduate in the top half of my class at law school and my recollection of this was inaccurate.” … Newsweek said Mr. Biden had gone to Syracuse “on half scholarship based on financial need.”  That seems like a pretty dumb thing to say. But Joe Biden says a lot of dumb things.  \"A man I'm proud to call my friend. A man who will be the next President of the United States — Barack America!\" --Joe Biden, at his first campaign rally with Barack Obama after being announced as his running mate, Springfield, Ill., Aug. 23, 2008  Also Joe Biden got in trouble for plagiarism. He's fairly unique in having a campaign collapse over a plagiarism scandal..  Delaware Sen. Joseph R. Biden Jr., trying to control mounting damage to his drive for the Democratic presidential nomination, admitted Thursday that he had committed plagiarism during his first year of law school but called the controversy surrounding his borrowed passages in recent speeches \"much ado about nothing.\" In his most detailed response to the controversy, which began during the weekend, Biden told a news conference that he \"did something very stupid 23 years ago,\" by lifting five pages from a law review article for a brief he wrote in a legal methods class at the University of Syracuse. Larry Sabato, professor of government at the University of Virginia, said: \"In my mind, this completely eliminates him from consideration\" for the nomination. \"A plagiarist can clearly not be in the White House.\" Biden's troubles began Saturday, when the New York Times and Des Moines Register noted the similarities between a rousing speech made by Neil Kinnock, the British Labor Party leader, and one delivered by Biden at a presidential debate at the Iowa State Fair on Aug. 23. Biden's problems deepened when other newspapers noted similarities between a Biden speech to the California Democratic Party in February and rhetoric by the late Robert F. Kennedy. Kennedy, at Fordham University in June, 1967, said: \"Few will have the greatness to bend history itself. But each of us can work to change a small portion of events, and in the total of all those acts will be written the history of this generation.\"  That's pretty dumb. And Biden's response to 9/11? Really dumb.  I’m groping here,” Joe says. For once he isn’t referring to his notorious habits with women that will go on to make him the star of countless viral photographs, massaging, squeezing, caressing. Instead he’s talking about foreign policy. The Chair of the Senate Foreign Relations Committee has no clue. Joe is worried that the Muslims will think badly of us after they murdered thousands of us. And he has a plan to make them feel better. “Seems to me this would be a good time to send, no strings attached, a check for $200 million to Iran,” Senator Joe Biden says.  But maybe Joe Biden is secretly brilliant?  \"Look, John's last-minute economic plan does nothing to tackle the number-one job facing the middle class, and it happens to be, as Barack says, a three-letter word: jobs. J-O-B-S, jobs.\" --Joe Biden, Athens, Ohio, Oct. 15, 2008  No, he's dumb.",
                              "label": 1,
                              "distance": 0.9426185488700867
                        },
                        {
                              "text": "The results of the disappointing 2016 presidential election aren t even official yet, but Vice President Joe Biden is already making noise about 2020. Known for bucking the rules and speaking from his gut, the outgoing vice-president hinted that he might be up for another fight four years from now.CNN asked him jokingly if he planned to run for office again. Yeah, I am. I m going to run in 2020,  Biden responded.When asked for what position, Biden responded,  For president. What the hell, man. When CNN told Biden it was planning to publish his quotes, the vice president responded,  That s okay. No, I ve enjoyed every minutes of my time here in the Senate. It s a great feeling to come back. I love this place. Biden later clarified,  I m not committing not to run. I m not committing to anything. I learned a long time ago fate has a strange way of intervening. Biden is leaving office one of the most popular political figures in America, and that popularity is even higher among Democrats. Biden is seen by many as a Democrat who excels at speaking to working class families across the racial spectrum, but still has a history of legislative experience as success as a Senator from Delaware and then as a two-term Vice President.Biden would likely be able to tap into existing Democratic donors if he ran, as he has near 100% name recognition domestically and internationally. Besides First Lady Michelle Obama, he would probably be the public figure to benefit most from an association with President Obama.Biden considered running in the 2016 election, but decided against it after the tragic death of his son Beau Biden. Since then, President Obama has put Biden in charge of the  moon shot  effort to find a cure for cancer, while Biden endorsed and heavily campaigned for Secretary Hillary Clinton in the 2016 election.Featured image via Flickr",
                              "label": 1,
                              "distance": 0.9497297406196594
                        },
                        {
                              "text": "Obama couldn t just endorse Joe Biden because like a loyal dog, he s defended every one of his unconstitutional acts against America. No Obama doesn t do anything without injecting Chicago style politics into the equation. In this case, he will only endorse one of the dumbest men in Washington DC for our next President if he agrees to his radical terms.How very  Putin-esque The talk in Democratic Party circles is that Barack Obama has told Joe Biden that he is prepared to endorse him for president if, in return, Biden promises to let Obama have a final say in the choice of his vice presidential running mate.According to these Democratic sources, Biden is mulling over the president s conditional offer of support.In addition, there is speculation among top Democratic sources that Obama has another quid pro quo for his endorsement: he wants Biden to choose an African American as his vice presidential running mate.In this scenario, which Obama has not yet fully explained to Biden, Biden would promise to serve only one term in the White House, after which he would back his vice president to succeed him.As Biden s vice president, Obama is said to favor former Massachusetts Governor Deval Patrick, a close Obama ally who is the first and only African American to have served as governor of the Bay State.Obama has already given Biden carte blanche to use Air Force Two, the official vice presidential plane, to crisscross the country and launch an unofficial campaign.So far, Biden has visited several key primary and general election states and hammered GOP frontrunner Donald Trump, charging that Trump is offering a  sick message  on immigration.Biden has also courted the Jewish vote, hinting that he will meet with Israeli Prime Minister Benjamin Netanyahu.With Obama s blessing, Biden appeared on  The Late Show With Stephen Colbert,  where he discussed his son Beau s death from brain cancer and came across as an authentic alternative to the stiff and overly scripted Hillary Clinton. Via: Edward Klein",
                              "label": 1,
                              "distance": 0.9543207883834839
                        },
                        {
                              "text": "Obama couldn t just endorse Joe Biden because like a loyal dog, he s defended every one of his unconstitutional acts against America. No Obama doesn t do anything without injecting Chicago style politics into the equation. In this case, he will only endorse one of the dumbest men in Washington DC for our next President if he agrees to his radical terms.How very  Putin-esque The talk in Democratic Party circles is that Barack Obama has told Joe Biden that he is prepared to endorse him for president if, in return, Biden promises to let Obama have a final say in the choice of his vice presidential running mate.According to these Democratic sources, Biden is mulling over the president s conditional offer of support.In addition, there is speculation among top Democratic sources that Obama has another quid pro quo for his endorsement: he wants Biden to choose an African American as his vice presidential running mate.In this scenario, which Obama has not yet fully explained to Biden, Biden would promise to serve only one term in the White House, after which he would back his vice president to succeed him.As Biden s vice president, Obama is said to favor former Massachusetts Governor Deval Patrick, a close Obama ally who is the first and only African American to have served as governor of the Bay State.Obama has already given Biden carte blanche to use Air Force Two, the official vice presidential plane, to crisscross the country and launch an unofficial campaign.So far, Biden has visited several key primary and general election states and hammered GOP frontrunner Donald Trump, charging that Trump is offering a  sick message  on immigration.Biden has also courted the Jewish vote, hinting that he will meet with Israeli Prime Minister Benjamin Netanyahu.With Obama s blessing, Biden appeared on  The Late Show With Stephen Colbert,  where he discussed his son Beau s death from brain cancer and came across as an authentic alternative to the stiff and overly scripted Hillary Clinton. Via: Edward Klein",
                              "label": 1,
                              "distance": 0.9543207883834839
                        },
                        {
                              "text": "Obama couldn t just endorse Joe Biden because like a loyal dog, he s defended every one of his unconstitutional acts against America. No Obama doesn t do anything without injecting Chicago style politics into the equation. In this case, he will only endorse one of the dumbest men in Washington DC for our next President if he agrees to his radical terms.How very  Putin-esque The talk in Democratic Party circles is that Barack Obama has told Joe Biden that he is prepared to endorse him for president if, in return, Biden promises to let Obama have a final say in the choice of his vice presidential running mate.According to these Democratic sources, Biden is mulling over the president s conditional offer of support.In addition, there is speculation among top Democratic sources that Obama has another quid pro quo for his endorsement: he wants Biden to choose an African American as his vice presidential running mate.In this scenario, which Obama has not yet fully explained to Biden, Biden would promise to serve only one term in the White House, after which he would back his vice president to succeed him.As Biden s vice president, Obama is said to favor former Massachusetts Governor Deval Patrick, a close Obama ally who is the first and only African American to have served as governor of the Bay State.Obama has already given Biden carte blanche to use Air Force Two, the official vice presidential plane, to crisscross the country and launch an unofficial campaign.So far, Biden has visited several key primary and general election states and hammered GOP frontrunner Donald Trump, charging that Trump is offering a  sick message  on immigration.Biden has also courted the Jewish vote, hinting that he will meet with Israeli Prime Minister Benjamin Netanyahu.With Obama s blessing, Biden appeared on  The Late Show With Stephen Colbert,  where he discussed his son Beau s death from brain cancer and came across as an authentic alternative to the stiff and overly scripted Hillary Clinton. Via: Edward Klein",
                              "label": 1,
                              "distance": 0.9543207883834839
                        },
                        {
                              "text": "Joe Biden was speaking at the SkyBridge Alternatives (SALT) Conference when one rich  a**hole  decided to disrespect the former vice president s dead son. Biden was furious and he put the heckler in his place effortlessly.Bill Ackman, manager of a failing hedge fund, was speaking at the wall street event as well. Fox Business reports that during the private VIP dinner, former Florida governor and 2016 GOP presidential contender Jeb Bush, asked Biden why didn t you run? Biden explained that part of the decision stemmed from the death of his son Beau Biden, who died of brain cancer in 2015. The room grew quiet as Biden became emotional, and said:  I m sorry I ve said enough. That s when Ackman blurted out  Why? That s never stopped you before. The formal, and understated dinner conversation suddenly turned tense, according to three people who were present and confirmed both the substance and the wording of Biden s responses.Biden, these people say, turned to someone seated near him, and asked,  who is this asshole?,  a reference to Ackman.Then he turned directly to Ackman and stated:  look, I don t know who you are, wiseass, but never disrespect the memory of my dead son!  these people say.Ackman attempted what was described as an apology, to which Biden said,  just shut the hell up. A spokesman for Ackman insisted that the idea that there was an argument or altercation between Joe Biden and Bill Ackman  is just utter nonsense. He even added that  Bill had a great time at the dinner and enjoyed spending time with the former vice president. But three different sources who witnessed the exchange say otherwise. Biden was in rare form,  said one person with direct knowledge of the heated conversation.  I can t believe it has never leaked out. There are some lines you just don t cross and this is one of them. Why Ackman thought he could get away with making this kind of remark is anybody s guess. But Biden was NOT having it and in the process, he proved that he has plenty of spunk left for a 2020 presidential run. I never thought she was a great candidate. I thought I was a great candidate, Biden said at the dinner, which raises speculation that he may decide to run for president in the next election. While Biden, who is 74, would be the oldest candidate to ever run for the White House, he certainly seems up to the task.Featured image via Alex Wong/Getty Images",
                              "label": 1,
                              "distance": 0.9627558588981628
                        },
                        {
                              "text": "Joe Biden is as genuine as they come. For many, their first exposure to him was when they watched him decimate Sarah Palin in the pre-election debates with a brilliant mind, clever wit and award-winning smile. Four years later, it was Paul Ryan who looked like a deer caught in the headlights as VP Biden considered his preposterous answers in their debates together and couldn t help but bust out in that ever-popular Joe Biden laugh.Joe Biden is one of the good ones. He s one of us. He s not a wealthy man or a sleezy politician who manages to live large off of campaign war chests; he s just a man   who happens to be second in line for the most powerful office in the world.Last year we were thrust into the personal life of Joe Biden and his family when his beloved son Beau, who the vice president calls his  soul,  was taken from him after a battle with cancer. What many people don t know is the incredible support Mr. Biden received from the only man he can call  boss,  President Barack Obama. The president delivered a beautiful and unforgettable eulogy for Beau, but according to an interview Biden did Monday with CNN, that was just the tip of the iceberg of the love and friendship he showed the Vice President.According to Biden, after Beau had the stroke that began the path towards his passing, President Obama came RUNNING down the hallway of the hospital to see if his friend and colleague was OK. Biden assured the president that he would be; that he and his wife would sell their house to get by and take care of Beau if need be.In an incredible act of selflessness and kindness, our President offered to give Joe Biden and his family whatever financial support they needed to weather the storm. As he tells the story you can see the tears welling up in his eyes. He says repeatedly that he s certain the president will be upset that he made such a personal notion public, but this man obviously wants the country to know exactly what kind of man sits in the Oval Office.He goes on to talk about the president and his family and how they are HIS family. How the President s daughters have sleepovers with his granddaughters and how much the special friendship between them has meant.Warning: The interview is a tear-jerker. Never have I been more proud of our president MY president or more thankful for having had the opportunity to witness his historic and monumentally successful administration than I am after watching this video:Featured image via screen capture",
                              "label": 1,
                              "distance": 0.9655141830444336
                        },
                        {
                              "text": "Joe Biden didn t earn his nickname  Creepy Joe  or  Creepy Uncle Joe  for his good behavior. Sadly,  Creepy Joe  earned his nickname after he was caught numerous times groping women and young girls on camera. Of course, the media gives Joe Biden a pass, because he s a Democrat, and if there s anything we ve learned over the past 4 decades, it s that high-profile members of the Democrat Party, like accused rapist Bill Clinton, can t be held accountable for their  playful  sexual advances towards women, and in the especially creepy Joe Biden s case, young girls.The first girl is a niece of Senate Majority Leader Mitch McConnell of Kentucky (R). The girl with the sharp elbow is apparently a relative of freshman Senator Steve Daines of Montana (R).An enlarged image from C-SPAN shows Biden s hand sliding over the chest of McConnell s niece.Another incident shows Biden s right hand sliding down a girl s shoulder and then his fingers creep over toward her breast [at about the 4:20 mark]. The girl elbowed Biden and stepped away from him, but Biden grabbed her and put his right hand back over her breast.Watch, as Joe Biden moves his hand down on this little girl s breast. You can see her elbowing him, as he s clearly making her uncomfortable. But Creepy Joe persists Here s a compilation of Joe Biden s sexual assaults in plain view of the camera and family members:One of the best videos in the collection of Creepy Joe moments caught on tape was when the camera caught the former Senator Jeff Sessions actually SLAPPING Joe s hands when he attempts to grab ahold of Sessions granddaughter. Watch:In another incident from that day, Biden is meeting Colorado Senator Cory Gardner and his wife and 11-year-old daughter. The daughter puts herself on the other side of Biden from her father. Biden reaches out to shake her hand and tires to pull her toward him such that the resisting girl stumbles in her heels. Biden then asks her to hold the Bible for the swearing-in of her father to get her next to him so he could fondle her. Biden drags her over by the arm and positions her close to him with both hands on her. Biden hugs her with his right arm after the ceremonial swearing-in, pulling her hip to his crotch. Biden then holds the girl near him for the family photo session and keeps his left arm around her waist during the photos. Biden finishes by leaning over and whispering in her ear.Note: Watch Biden s hand beginning at the 1:32 mark. He actually rotates his hand up to touch the side of the 11-year-old girl s breast.Via: Gateway Pundit",
                              "label": 1,
                              "distance": 0.9758387804031372
                        },
                        {
                              "text": "Joe Biden didn t earn his nickname  Creepy Joe  or  Creepy Uncle Joe  for his good behavior. Sadly,  Creepy Joe  earned his nickname after he was caught numerous times groping women and young girls on camera. Of course, the media gives Joe Biden a pass, because he s a Democrat, and if there s anything we ve learned over the past 4 decades, it s that high-profile members of the Democrat Party, like accused rapist Bill Clinton, can t be held accountable for their  playful  sexual advances towards women, and in the especially creepy Joe Biden s case, young girls.The first girl is a niece of Senate Majority Leader Mitch McConnell of Kentucky (R). The girl with the sharp elbow is apparently a relative of freshman Senator Steve Daines of Montana (R).An enlarged image from C-SPAN shows Biden s hand sliding over the chest of McConnell s niece.Another incident shows Biden s right hand sliding down a girl s shoulder and then his fingers creep over toward her breast [at about the 4:20 mark]. The girl elbowed Biden and stepped away from him, but Biden grabbed her and put his right hand back over her breast.Watch, as Joe Biden moves his hand down on this little girl s breast. You can see her elbowing him, as he s clearly making her uncomfortable. But Creepy Joe persists Here s a compilation of Joe Biden s sexual assaults in plain view of the camera and family members:One of the best videos in the collection of Creepy Joe moments caught on tape was when the camera caught the former Senator Jeff Sessions actually SLAPPING Joe s hands when he attempts to grab ahold of Sessions granddaughter. Watch:In another incident from that day, Biden is meeting Colorado Senator Cory Gardner and his wife and 11-year-old daughter. The daughter puts herself on the other side of Biden from her father. Biden reaches out to shake her hand and tires to pull her toward him such that the resisting girl stumbles in her heels. Biden then asks her to hold the Bible for the swearing-in of her father to get her next to him so he could fondle her. Biden drags her over by the arm and positions her close to him with both hands on her. Biden hugs her with his right arm after the ceremonial swearing-in, pulling her hip to his crotch. Biden then holds the girl near him for the family photo session and keeps his left arm around her waist during the photos. Biden finishes by leaning over and whispering in her ear.Note: Watch Biden s hand beginning at the 1:32 mark. He actually rotates his hand up to touch the side of the 11-year-old girl s breast.Via: Gateway Pundit",
                              "label": 1,
                              "distance": 0.9758387804031372
                        }
                  ]
            },
            "title": "PART of FAKE",
            "body": "While on the campaign trail for Hillary Clinton in Ohio, Vice President Joe Biden was talking about the dangers of a Donald Trump presidency and what that would do to the average citizen.However, while speaking, a protester started shouting at Biden about the Iraq War. And while he could have simply ignored this protester or let the crowd drown him out with chants of Hillary! Biden instead hushed the crowd to field his question.After Biden answered the question, the protester, still upset, let the vice president know that his friend had died. ",
            "time": "2022-11-05T13:58:12.706775"
      }
]